espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
// Copyright 2017-2018 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_GDMA_REG_H_
#define _SOC_GDMA_REG_H_


#ifdef __cplusplus
extern "C" {
#endif
#include "soc.h"

#define GDMA_IN_CONF0_CH0_REG          (DR_REG_GDMA_BASE + 0x0)
/* GDMA_MEM_TRANS_EN_CH0 : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit 1 to enable automatic transmitting data from memory to memory via D
MA..*/
#define GDMA_MEM_TRANS_EN_CH0    (BIT(4))
#define GDMA_MEM_TRANS_EN_CH0_M  (BIT(4))
#define GDMA_MEM_TRANS_EN_CH0_V  0x1
#define GDMA_MEM_TRANS_EN_CH0_S  4
/* GDMA_IN_DATA_BURST_EN_CH0 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel 0 receiving data
when accessing internal SRAM. .*/
#define GDMA_IN_DATA_BURST_EN_CH0    (BIT(3))
#define GDMA_IN_DATA_BURST_EN_CH0_M  (BIT(3))
#define GDMA_IN_DATA_BURST_EN_CH0_V  0x1
#define GDMA_IN_DATA_BURST_EN_CH0_S  3
/* GDMA_INDSCR_BURST_EN_CH0 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel 0 reading link de
scriptor when accessing internal SRAM. .*/
#define GDMA_INDSCR_BURST_EN_CH0    (BIT(2))
#define GDMA_INDSCR_BURST_EN_CH0_M  (BIT(2))
#define GDMA_INDSCR_BURST_EN_CH0_V  0x1
#define GDMA_INDSCR_BURST_EN_CH0_S  2
/* GDMA_IN_LOOP_TEST_CH0 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: reserved.*/
#define GDMA_IN_LOOP_TEST_CH0    (BIT(1))
#define GDMA_IN_LOOP_TEST_CH0_M  (BIT(1))
#define GDMA_IN_LOOP_TEST_CH0_V  0x1
#define GDMA_IN_LOOP_TEST_CH0_S  1
/* GDMA_IN_RST_CH0 : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: This bit is used to reset DMA channel 0 Rx FSM and Rx FIFO pointer..*/
#define GDMA_IN_RST_CH0    (BIT(0))
#define GDMA_IN_RST_CH0_M  (BIT(0))
#define GDMA_IN_RST_CH0_V  0x1
#define GDMA_IN_RST_CH0_S  0

#define GDMA_IN_CONF1_CH0_REG          (DR_REG_GDMA_BASE + 0x4)
/* GDMA_IN_EXT_MEM_BK_SIZE_CH0 : R/W ;bitpos:[14:13] ;default: 2'b0 ; */
/*description: Block size of Rx channel 0 when DMA access external SRAM. 0: 16 bytes      1: 32
 bytes    2/3:reserved.*/
#define GDMA_IN_EXT_MEM_BK_SIZE_CH0    0x00000003
#define GDMA_IN_EXT_MEM_BK_SIZE_CH0_M  ((GDMA_IN_EXT_MEM_BK_SIZE_CH0_V)<<(GDMA_IN_EXT_MEM_BK_SIZE_CH0_S))
#define GDMA_IN_EXT_MEM_BK_SIZE_CH0_V  0x3
#define GDMA_IN_EXT_MEM_BK_SIZE_CH0_S  13
/* GDMA_IN_CHECK_OWNER_CH0 : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to enable checking the owner attribute of the link descriptor..*/
#define GDMA_IN_CHECK_OWNER_CH0    (BIT(12))
#define GDMA_IN_CHECK_OWNER_CH0_M  (BIT(12))
#define GDMA_IN_CHECK_OWNER_CH0_V  0x1
#define GDMA_IN_CHECK_OWNER_CH0_S  12
/* GDMA_DMA_INFIFO_FULL_THRS_CH0 : R/W ;bitpos:[11:0] ;default: 12'hc ; */
/*description: This register is used to generate the INFIFO_FULL_WM_INT interrupt when Rx chann
el 0 received byte number in Rx FIFO is up to the value of the register..*/
#define GDMA_DMA_INFIFO_FULL_THRS_CH0    0x00000FFF
#define GDMA_DMA_INFIFO_FULL_THRS_CH0_M  ((GDMA_DMA_INFIFO_FULL_THRS_CH0_V)<<(GDMA_DMA_INFIFO_FULL_THRS_CH0_S))
#define GDMA_DMA_INFIFO_FULL_THRS_CH0_V  0xFFF
#define GDMA_DMA_INFIFO_FULL_THRS_CH0_S  0

#define GDMA_IN_INT_RAW_CH0_REG          (DR_REG_GDMA_BASE + 0x8)
/* GDMA_INFIFO_UDF_L3_CH0_INT_RAW : R/WTC/SS ;bitpos:[9] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo of Rx channel 0 is
underflow. .*/
#define GDMA_INFIFO_UDF_L3_CH0_INT_RAW    (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH0_INT_RAW_M  (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH0_INT_RAW_V  0x1
#define GDMA_INFIFO_UDF_L3_CH0_INT_RAW_S  9
/* GDMA_INFIFO_OVF_L3_CH0_INT_RAW : R/WTC/SS ;bitpos:[8] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo of Rx channel 0 is
overflow. .*/
#define GDMA_INFIFO_OVF_L3_CH0_INT_RAW    (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH0_INT_RAW_M  (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH0_INT_RAW_V  0x1
#define GDMA_INFIFO_OVF_L3_CH0_INT_RAW_S  8
/* GDMA_INFIFO_UDF_L1_CH0_INT_RAW : R/WTC/SS ;bitpos:[7] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
underflow. .*/
#define GDMA_INFIFO_UDF_L1_CH0_INT_RAW    (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH0_INT_RAW_M  (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH0_INT_RAW_V  0x1
#define GDMA_INFIFO_UDF_L1_CH0_INT_RAW_S  7
/* GDMA_INFIFO_OVF_L1_CH0_INT_RAW : R/WTC/SS ;bitpos:[6] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
overflow. .*/
#define GDMA_INFIFO_OVF_L1_CH0_INT_RAW    (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH0_INT_RAW_M  (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH0_INT_RAW_V  0x1
#define GDMA_INFIFO_OVF_L1_CH0_INT_RAW_S  6
/* GDMA_INFIFO_FULL_WM_CH0_INT_RAW : R/WTC/SS ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when received data byte number is up t
o threshold configured by REG_DMA_INFIFO_FULL_THRS_CH0 in Rx FIFO of channel 0..*/
#define GDMA_INFIFO_FULL_WM_CH0_INT_RAW    (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH0_INT_RAW_M  (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH0_INT_RAW_V  0x1
#define GDMA_INFIFO_FULL_WM_CH0_INT_RAW_S  5
/* GDMA_IN_DSCR_EMPTY_CH0_INT_RAW : R/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when Rx buffer pointed by inlink is fu
ll and receiving data is not completed, but there is no more inlink for Rx chann
el 0..*/
#define GDMA_IN_DSCR_EMPTY_CH0_INT_RAW    (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH0_INT_RAW_M  (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH0_INT_RAW_V  0x1
#define GDMA_IN_DSCR_EMPTY_CH0_INT_RAW_S  4
/* GDMA_IN_DSCR_ERR_CH0_INT_RAW : R/WTC/SS ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when detecting inlink descriptor error
, including owner error, the second and third word error of inlink descriptor fo
r Rx channel 0..*/
#define GDMA_IN_DSCR_ERR_CH0_INT_RAW    (BIT(3))
#define GDMA_IN_DSCR_ERR_CH0_INT_RAW_M  (BIT(3))
#define GDMA_IN_DSCR_ERR_CH0_INT_RAW_V  0x1
#define GDMA_IN_DSCR_ERR_CH0_INT_RAW_S  3
/* GDMA_IN_ERR_EOF_CH0_INT_RAW : R/WTC/SS ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when data error is detected only in th
e case that the peripheral is UHCI0 for Rx channel 0. For other peripherals, thi
s raw interrupt is reserved..*/
#define GDMA_IN_ERR_EOF_CH0_INT_RAW    (BIT(2))
#define GDMA_IN_ERR_EOF_CH0_INT_RAW_M  (BIT(2))
#define GDMA_IN_ERR_EOF_CH0_INT_RAW_V  0x1
#define GDMA_IN_ERR_EOF_CH0_INT_RAW_S  2
/* GDMA_IN_SUC_EOF_CH0_INT_RAW : R/WTC/SS ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data pointed by one inli
nk descriptor has been received for Rx channel 0. For UHCI0, the raw interrupt b
it turns to high level when the last data pointed by one inlink descriptor has b
een received and no data error is detected for Rx channel 0..*/
#define GDMA_IN_SUC_EOF_CH0_INT_RAW    (BIT(1))
#define GDMA_IN_SUC_EOF_CH0_INT_RAW_M  (BIT(1))
#define GDMA_IN_SUC_EOF_CH0_INT_RAW_V  0x1
#define GDMA_IN_SUC_EOF_CH0_INT_RAW_S  1
/* GDMA_IN_DONE_CH0_INT_RAW : R/WTC/SS ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data pointed by one inli
nk descriptor has been received for Rx channel 0..*/
#define GDMA_IN_DONE_CH0_INT_RAW    (BIT(0))
#define GDMA_IN_DONE_CH0_INT_RAW_M  (BIT(0))
#define GDMA_IN_DONE_CH0_INT_RAW_V  0x1
#define GDMA_IN_DONE_CH0_INT_RAW_S  0

#define GDMA_IN_INT_ST_CH0_REG          (DR_REG_GDMA_BASE + 0xC)
/* GDMA_INFIFO_UDF_L3_CH0_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L3_CH0_INT_ST    (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH0_INT_ST_M  (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH0_INT_ST_V  0x1
#define GDMA_INFIFO_UDF_L3_CH0_INT_ST_S  9
/* GDMA_INFIFO_OVF_L3_CH0_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L3_CH0_INT_ST    (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH0_INT_ST_M  (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH0_INT_ST_V  0x1
#define GDMA_INFIFO_OVF_L3_CH0_INT_ST_S  8
/* GDMA_INFIFO_UDF_L1_CH0_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L1_CH0_INT_ST    (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH0_INT_ST_M  (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH0_INT_ST_V  0x1
#define GDMA_INFIFO_UDF_L1_CH0_INT_ST_S  7
/* GDMA_INFIFO_OVF_L1_CH0_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L1_CH0_INT_ST    (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH0_INT_ST_M  (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH0_INT_ST_V  0x1
#define GDMA_INFIFO_OVF_L1_CH0_INT_ST_S  6
/* GDMA_INFIFO_FULL_WM_CH0_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_FULL_WM_CH_INT interrupt..*/
#define GDMA_INFIFO_FULL_WM_CH0_INT_ST    (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH0_INT_ST_M  (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH0_INT_ST_V  0x1
#define GDMA_INFIFO_FULL_WM_CH0_INT_ST_S  5
/* GDMA_IN_DSCR_EMPTY_CH0_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt..*/
#define GDMA_IN_DSCR_EMPTY_CH0_INT_ST    (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH0_INT_ST_M  (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH0_INT_ST_V  0x1
#define GDMA_IN_DSCR_EMPTY_CH0_INT_ST_S  4
/* GDMA_IN_DSCR_ERR_CH0_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_IN_DSCR_ERR_CH0_INT_ST    (BIT(3))
#define GDMA_IN_DSCR_ERR_CH0_INT_ST_M  (BIT(3))
#define GDMA_IN_DSCR_ERR_CH0_INT_ST_V  0x1
#define GDMA_IN_DSCR_ERR_CH0_INT_ST_S  3
/* GDMA_IN_ERR_EOF_CH0_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt..*/
#define GDMA_IN_ERR_EOF_CH0_INT_ST    (BIT(2))
#define GDMA_IN_ERR_EOF_CH0_INT_ST_M  (BIT(2))
#define GDMA_IN_ERR_EOF_CH0_INT_ST_V  0x1
#define GDMA_IN_ERR_EOF_CH0_INT_ST_S  2
/* GDMA_IN_SUC_EOF_CH0_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt..*/
#define GDMA_IN_SUC_EOF_CH0_INT_ST    (BIT(1))
#define GDMA_IN_SUC_EOF_CH0_INT_ST_M  (BIT(1))
#define GDMA_IN_SUC_EOF_CH0_INT_ST_V  0x1
#define GDMA_IN_SUC_EOF_CH0_INT_ST_S  1
/* GDMA_IN_DONE_CH0_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DONE_CH_INT interrupt..*/
#define GDMA_IN_DONE_CH0_INT_ST    (BIT(0))
#define GDMA_IN_DONE_CH0_INT_ST_M  (BIT(0))
#define GDMA_IN_DONE_CH0_INT_ST_V  0x1
#define GDMA_IN_DONE_CH0_INT_ST_S  0

#define GDMA_IN_INT_ENA_CH0_REG          (DR_REG_GDMA_BASE + 0x10)
/* GDMA_INFIFO_UDF_L3_CH0_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L3_CH0_INT_ENA    (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH0_INT_ENA_M  (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH0_INT_ENA_V  0x1
#define GDMA_INFIFO_UDF_L3_CH0_INT_ENA_S  9
/* GDMA_INFIFO_OVF_L3_CH0_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L3_CH0_INT_ENA    (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH0_INT_ENA_M  (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH0_INT_ENA_V  0x1
#define GDMA_INFIFO_OVF_L3_CH0_INT_ENA_S  8
/* GDMA_INFIFO_UDF_L1_CH0_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L1_CH0_INT_ENA    (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH0_INT_ENA_M  (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH0_INT_ENA_V  0x1
#define GDMA_INFIFO_UDF_L1_CH0_INT_ENA_S  7
/* GDMA_INFIFO_OVF_L1_CH0_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L1_CH0_INT_ENA    (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH0_INT_ENA_M  (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH0_INT_ENA_V  0x1
#define GDMA_INFIFO_OVF_L1_CH0_INT_ENA_S  6
/* GDMA_INFIFO_FULL_WM_CH0_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_FULL_WM_CH_INT interrupt..*/
#define GDMA_INFIFO_FULL_WM_CH0_INT_ENA    (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH0_INT_ENA_M  (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH0_INT_ENA_V  0x1
#define GDMA_INFIFO_FULL_WM_CH0_INT_ENA_S  5
/* GDMA_IN_DSCR_EMPTY_CH0_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt..*/
#define GDMA_IN_DSCR_EMPTY_CH0_INT_ENA    (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH0_INT_ENA_M  (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH0_INT_ENA_V  0x1
#define GDMA_IN_DSCR_EMPTY_CH0_INT_ENA_S  4
/* GDMA_IN_DSCR_ERR_CH0_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_IN_DSCR_ERR_CH0_INT_ENA    (BIT(3))
#define GDMA_IN_DSCR_ERR_CH0_INT_ENA_M  (BIT(3))
#define GDMA_IN_DSCR_ERR_CH0_INT_ENA_V  0x1
#define GDMA_IN_DSCR_ERR_CH0_INT_ENA_S  3
/* GDMA_IN_ERR_EOF_CH0_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt..*/
#define GDMA_IN_ERR_EOF_CH0_INT_ENA    (BIT(2))
#define GDMA_IN_ERR_EOF_CH0_INT_ENA_M  (BIT(2))
#define GDMA_IN_ERR_EOF_CH0_INT_ENA_V  0x1
#define GDMA_IN_ERR_EOF_CH0_INT_ENA_S  2
/* GDMA_IN_SUC_EOF_CH0_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt..*/
#define GDMA_IN_SUC_EOF_CH0_INT_ENA    (BIT(1))
#define GDMA_IN_SUC_EOF_CH0_INT_ENA_M  (BIT(1))
#define GDMA_IN_SUC_EOF_CH0_INT_ENA_V  0x1
#define GDMA_IN_SUC_EOF_CH0_INT_ENA_S  1
/* GDMA_IN_DONE_CH0_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_DONE_CH_INT interrupt..*/
#define GDMA_IN_DONE_CH0_INT_ENA    (BIT(0))
#define GDMA_IN_DONE_CH0_INT_ENA_M  (BIT(0))
#define GDMA_IN_DONE_CH0_INT_ENA_V  0x1
#define GDMA_IN_DONE_CH0_INT_ENA_S  0

#define GDMA_IN_INT_CLR_CH0_REG          (DR_REG_GDMA_BASE + 0x14)
/* GDMA_INFIFO_UDF_L3_CH0_INT_CLR : WT ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L3_CH0_INT_CLR    (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH0_INT_CLR_M  (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH0_INT_CLR_V  0x1
#define GDMA_INFIFO_UDF_L3_CH0_INT_CLR_S  9
/* GDMA_INFIFO_OVF_L3_CH0_INT_CLR : WT ;bitpos:[8] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L3_CH0_INT_CLR    (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH0_INT_CLR_M  (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH0_INT_CLR_V  0x1
#define GDMA_INFIFO_OVF_L3_CH0_INT_CLR_S  8
/* GDMA_INFIFO_UDF_L1_CH0_INT_CLR : WT ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L1_CH0_INT_CLR    (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH0_INT_CLR_M  (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH0_INT_CLR_V  0x1
#define GDMA_INFIFO_UDF_L1_CH0_INT_CLR_S  7
/* GDMA_INFIFO_OVF_L1_CH0_INT_CLR : WT ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L1_CH0_INT_CLR    (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH0_INT_CLR_M  (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH0_INT_CLR_V  0x1
#define GDMA_INFIFO_OVF_L1_CH0_INT_CLR_S  6
/* GDMA_DMA_INFIFO_FULL_WM_CH0_INT_CLR : WT ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_FULL_WM_CH_INT interrupt..*/
#define GDMA_DMA_INFIFO_FULL_WM_CH0_INT_CLR    (BIT(5))
#define GDMA_DMA_INFIFO_FULL_WM_CH0_INT_CLR_M  (BIT(5))
#define GDMA_DMA_INFIFO_FULL_WM_CH0_INT_CLR_V  0x1
#define GDMA_DMA_INFIFO_FULL_WM_CH0_INT_CLR_S  5
/* GDMA_IN_DSCR_EMPTY_CH0_INT_CLR : WT ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt..*/
#define GDMA_IN_DSCR_EMPTY_CH0_INT_CLR    (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH0_INT_CLR_M  (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH0_INT_CLR_V  0x1
#define GDMA_IN_DSCR_EMPTY_CH0_INT_CLR_S  4
/* GDMA_IN_DSCR_ERR_CH0_INT_CLR : WT ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_IN_DSCR_ERR_CH0_INT_CLR    (BIT(3))
#define GDMA_IN_DSCR_ERR_CH0_INT_CLR_M  (BIT(3))
#define GDMA_IN_DSCR_ERR_CH0_INT_CLR_V  0x1
#define GDMA_IN_DSCR_ERR_CH0_INT_CLR_S  3
/* GDMA_IN_ERR_EOF_CH0_INT_CLR : WT ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_ERR_EOF_CH_INT interrupt..*/
#define GDMA_IN_ERR_EOF_CH0_INT_CLR    (BIT(2))
#define GDMA_IN_ERR_EOF_CH0_INT_CLR_M  (BIT(2))
#define GDMA_IN_ERR_EOF_CH0_INT_CLR_V  0x1
#define GDMA_IN_ERR_EOF_CH0_INT_CLR_S  2
/* GDMA_IN_SUC_EOF_CH0_INT_CLR : WT ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_SUC_EOF_CH_INT interrupt..*/
#define GDMA_IN_SUC_EOF_CH0_INT_CLR    (BIT(1))
#define GDMA_IN_SUC_EOF_CH0_INT_CLR_M  (BIT(1))
#define GDMA_IN_SUC_EOF_CH0_INT_CLR_V  0x1
#define GDMA_IN_SUC_EOF_CH0_INT_CLR_S  1
/* GDMA_IN_DONE_CH0_INT_CLR : WT ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DONE_CH_INT interrupt..*/
#define GDMA_IN_DONE_CH0_INT_CLR    (BIT(0))
#define GDMA_IN_DONE_CH0_INT_CLR_M  (BIT(0))
#define GDMA_IN_DONE_CH0_INT_CLR_V  0x1
#define GDMA_IN_DONE_CH0_INT_CLR_S  0

