espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
#define GDMA_INFIFO_STATUS_CH0_REG          (DR_REG_GDMA_BASE + 0x18)
/* GDMA_IN_BUF_HUNGRY_CH0 : RO ;bitpos:[28] ;default: 1'b0 ; */
/*description: reserved.*/
#define GDMA_IN_BUF_HUNGRY_CH0    (BIT(28))
#define GDMA_IN_BUF_HUNGRY_CH0_M  (BIT(28))
#define GDMA_IN_BUF_HUNGRY_CH0_V  0x1
#define GDMA_IN_BUF_HUNGRY_CH0_S  28
/* GDMA_IN_REMAIN_UNDER_4B_L3_CH0 : RO ;bitpos:[27] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_IN_REMAIN_UNDER_4B_L3_CH0    (BIT(27))
#define GDMA_IN_REMAIN_UNDER_4B_L3_CH0_M  (BIT(27))
#define GDMA_IN_REMAIN_UNDER_4B_L3_CH0_V  0x1
#define GDMA_IN_REMAIN_UNDER_4B_L3_CH0_S  27
/* GDMA_IN_REMAIN_UNDER_3B_L3_CH0 : RO ;bitpos:[26] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_IN_REMAIN_UNDER_3B_L3_CH0    (BIT(26))
#define GDMA_IN_REMAIN_UNDER_3B_L3_CH0_M  (BIT(26))
#define GDMA_IN_REMAIN_UNDER_3B_L3_CH0_V  0x1
#define GDMA_IN_REMAIN_UNDER_3B_L3_CH0_S  26
/* GDMA_IN_REMAIN_UNDER_2B_L3_CH0 : RO ;bitpos:[25] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_IN_REMAIN_UNDER_2B_L3_CH0    (BIT(25))
#define GDMA_IN_REMAIN_UNDER_2B_L3_CH0_M  (BIT(25))
#define GDMA_IN_REMAIN_UNDER_2B_L3_CH0_V  0x1
#define GDMA_IN_REMAIN_UNDER_2B_L3_CH0_S  25
/* GDMA_IN_REMAIN_UNDER_1B_L3_CH0 : RO ;bitpos:[24] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_IN_REMAIN_UNDER_1B_L3_CH0    (BIT(24))
#define GDMA_IN_REMAIN_UNDER_1B_L3_CH0_M  (BIT(24))
#define GDMA_IN_REMAIN_UNDER_1B_L3_CH0_V  0x1
#define GDMA_IN_REMAIN_UNDER_1B_L3_CH0_S  24
/* GDMA_INFIFO_CNT_L3_CH0 : RO ;bitpos:[23:19] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L3 Rx FIFO for Rx channel 0..*/
#define GDMA_INFIFO_CNT_L3_CH0    0x0000001F
#define GDMA_INFIFO_CNT_L3_CH0_M  ((GDMA_INFIFO_CNT_L3_CH0_V)<<(GDMA_INFIFO_CNT_L3_CH0_S))
#define GDMA_INFIFO_CNT_L3_CH0_V  0x1F
#define GDMA_INFIFO_CNT_L3_CH0_S  19
/* GDMA_INFIFO_CNT_L2_CH0 : RO ;bitpos:[18:12] ;default: 7'b0 ; */
/*description: The register stores the byte number of the data in L2 Rx FIFO for Rx channel 0..*/
#define GDMA_INFIFO_CNT_L2_CH0    0x0000007F
#define GDMA_INFIFO_CNT_L2_CH0_M  ((GDMA_INFIFO_CNT_L2_CH0_V)<<(GDMA_INFIFO_CNT_L2_CH0_S))
#define GDMA_INFIFO_CNT_L2_CH0_V  0x7F
#define GDMA_INFIFO_CNT_L2_CH0_S  12
/* GDMA_INFIFO_CNT_L1_CH0 : RO ;bitpos:[11:6] ;default: 6'b0 ; */
/*description: The register stores the byte number of the data in L1 Rx FIFO for Rx channel 0..*/
#define GDMA_INFIFO_CNT_L1_CH0    0x0000003F
#define GDMA_INFIFO_CNT_L1_CH0_M  ((GDMA_INFIFO_CNT_L1_CH0_V)<<(GDMA_INFIFO_CNT_L1_CH0_S))
#define GDMA_INFIFO_CNT_L1_CH0_V  0x3F
#define GDMA_INFIFO_CNT_L1_CH0_S  6
/* GDMA_INFIFO_EMPTY_L3_CH0 : RO ;bitpos:[5] ;default: 1'b1 ; */
/*description: L3 Rx FIFO empty signal for Rx channel 0..*/
#define GDMA_INFIFO_EMPTY_L3_CH0    (BIT(5))
#define GDMA_INFIFO_EMPTY_L3_CH0_M  (BIT(5))
#define GDMA_INFIFO_EMPTY_L3_CH0_V  0x1
#define GDMA_INFIFO_EMPTY_L3_CH0_S  5
/* GDMA_INFIFO_FULL_L3_CH0 : RO ;bitpos:[4] ;default: 1'b1 ; */
/*description: L3 Rx FIFO full signal for Rx channel 0..*/
#define GDMA_INFIFO_FULL_L3_CH0    (BIT(4))
#define GDMA_INFIFO_FULL_L3_CH0_M  (BIT(4))
#define GDMA_INFIFO_FULL_L3_CH0_V  0x1
#define GDMA_INFIFO_FULL_L3_CH0_S  4
/* GDMA_INFIFO_EMPTY_L2_CH0 : RO ;bitpos:[3] ;default: 1'b1 ; */
/*description: L2 Rx FIFO empty signal for Rx channel 0..*/
#define GDMA_INFIFO_EMPTY_L2_CH0    (BIT(3))
#define GDMA_INFIFO_EMPTY_L2_CH0_M  (BIT(3))
#define GDMA_INFIFO_EMPTY_L2_CH0_V  0x1
#define GDMA_INFIFO_EMPTY_L2_CH0_S  3
/* GDMA_INFIFO_FULL_L2_CH0 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: L2 Rx FIFO full signal for Rx channel 0..*/
#define GDMA_INFIFO_FULL_L2_CH0    (BIT(2))
#define GDMA_INFIFO_FULL_L2_CH0_M  (BIT(2))
#define GDMA_INFIFO_FULL_L2_CH0_V  0x1
#define GDMA_INFIFO_FULL_L2_CH0_S  2
/* GDMA_INFIFO_EMPTY_L1_CH0 : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: L1 Rx FIFO empty signal for Rx channel 0..*/
#define GDMA_INFIFO_EMPTY_L1_CH0    (BIT(1))
#define GDMA_INFIFO_EMPTY_L1_CH0_M  (BIT(1))
#define GDMA_INFIFO_EMPTY_L1_CH0_V  0x1
#define GDMA_INFIFO_EMPTY_L1_CH0_S  1
/* GDMA_INFIFO_FULL_L1_CH0 : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: L1 Rx FIFO full signal for Rx channel 0..*/
#define GDMA_INFIFO_FULL_L1_CH0    (BIT(0))
#define GDMA_INFIFO_FULL_L1_CH0_M  (BIT(0))
#define GDMA_INFIFO_FULL_L1_CH0_V  0x1
#define GDMA_INFIFO_FULL_L1_CH0_S  0

#define GDMA_IN_POP_CH0_REG          (DR_REG_GDMA_BASE + 0x1C)
/* GDMA_INFIFO_POP_CH0 : R/W/SC ;bitpos:[12] ;default: 1'h0 ; */
/*description: Set this bit to pop data from DMA FIFO..*/
#define GDMA_INFIFO_POP_CH0    (BIT(12))
#define GDMA_INFIFO_POP_CH0_M  (BIT(12))
#define GDMA_INFIFO_POP_CH0_V  0x1
#define GDMA_INFIFO_POP_CH0_S  12
/* GDMA_INFIFO_RDATA_CH0 : RO ;bitpos:[11:0] ;default: 12'h800 ; */
/*description: This register stores the data popping from DMA FIFO..*/
#define GDMA_INFIFO_RDATA_CH0    0x00000FFF
#define GDMA_INFIFO_RDATA_CH0_M  ((GDMA_INFIFO_RDATA_CH0_V)<<(GDMA_INFIFO_RDATA_CH0_S))
#define GDMA_INFIFO_RDATA_CH0_V  0xFFF
#define GDMA_INFIFO_RDATA_CH0_S  0

#define GDMA_IN_LINK_CH0_REG          (DR_REG_GDMA_BASE + 0x20)
/* GDMA_INLINK_PARK_CH0 : RO ;bitpos:[24] ;default: 1'h1 ; */
/*description: 1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM
 is working..*/
#define GDMA_INLINK_PARK_CH0    (BIT(24))
#define GDMA_INLINK_PARK_CH0_M  (BIT(24))
#define GDMA_INLINK_PARK_CH0_V  0x1
#define GDMA_INLINK_PARK_CH0_S  24
/* GDMA_INLINK_RESTART_CH0 : R/W/SC ;bitpos:[23] ;default: 1'b0 ; */
/*description: Set this bit to mount a new inlink descriptor..*/
#define GDMA_INLINK_RESTART_CH0    (BIT(23))
#define GDMA_INLINK_RESTART_CH0_M  (BIT(23))
#define GDMA_INLINK_RESTART_CH0_V  0x1
#define GDMA_INLINK_RESTART_CH0_S  23
/* GDMA_INLINK_START_CH0 : R/W/SC ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this bit to start dealing with the inlink descriptors..*/
#define GDMA_INLINK_START_CH0    (BIT(22))
#define GDMA_INLINK_START_CH0_M  (BIT(22))
#define GDMA_INLINK_START_CH0_V  0x1
#define GDMA_INLINK_START_CH0_S  22
/* GDMA_INLINK_STOP_CH0 : R/W/SC ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this bit to stop dealing with the inlink descriptors..*/
#define GDMA_INLINK_STOP_CH0    (BIT(21))
#define GDMA_INLINK_STOP_CH0_M  (BIT(21))
#define GDMA_INLINK_STOP_CH0_V  0x1
#define GDMA_INLINK_STOP_CH0_S  21
/* GDMA_INLINK_AUTO_RET_CH0 : R/W ;bitpos:[20] ;default: 1'b1 ; */
/*description: Set this bit to return to current inlink descriptor's address, when there are so
me errors in current receiving data..*/
#define GDMA_INLINK_AUTO_RET_CH0    (BIT(20))
#define GDMA_INLINK_AUTO_RET_CH0_M  (BIT(20))
#define GDMA_INLINK_AUTO_RET_CH0_V  0x1
#define GDMA_INLINK_AUTO_RET_CH0_S  20
/* GDMA_INLINK_ADDR_CH0 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: This register stores the 20 least significant bits of the first inlink descripto
r's address..*/
#define GDMA_INLINK_ADDR_CH0    0x000FFFFF
#define GDMA_INLINK_ADDR_CH0_M  ((GDMA_INLINK_ADDR_CH0_V)<<(GDMA_INLINK_ADDR_CH0_S))
#define GDMA_INLINK_ADDR_CH0_V  0xFFFFF
#define GDMA_INLINK_ADDR_CH0_S  0

#define GDMA_IN_STATE_CH0_REG          (DR_REG_GDMA_BASE + 0x24)
/* GDMA_IN_STATE_CH0 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved.*/
#define GDMA_IN_STATE_CH0    0x00000007
#define GDMA_IN_STATE_CH0_M  ((GDMA_IN_STATE_CH0_V)<<(GDMA_IN_STATE_CH0_S))
#define GDMA_IN_STATE_CH0_V  0x7
#define GDMA_IN_STATE_CH0_S  20
/* GDMA_IN_DSCR_STATE_CH0 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved.*/
#define GDMA_IN_DSCR_STATE_CH0    0x00000003
#define GDMA_IN_DSCR_STATE_CH0_M  ((GDMA_IN_DSCR_STATE_CH0_V)<<(GDMA_IN_DSCR_STATE_CH0_S))
#define GDMA_IN_DSCR_STATE_CH0_V  0x3
#define GDMA_IN_DSCR_STATE_CH0_S  18
/* GDMA_INLINK_DSCR_ADDR_CH0 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current inlink descriptor's address..*/
#define GDMA_INLINK_DSCR_ADDR_CH0    0x0003FFFF
#define GDMA_INLINK_DSCR_ADDR_CH0_M  ((GDMA_INLINK_DSCR_ADDR_CH0_V)<<(GDMA_INLINK_DSCR_ADDR_CH0_S))
#define GDMA_INLINK_DSCR_ADDR_CH0_V  0x3FFFF
#define GDMA_INLINK_DSCR_ADDR_CH0_S  0

#define GDMA_IN_SUC_EOF_DES_ADDR_CH0_REG          (DR_REG_GDMA_BASE + 0x28)
/* GDMA_IN_SUC_EOF_DES_ADDR_CH0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when the EOF bit in th
is descriptor is 1..*/
#define GDMA_IN_SUC_EOF_DES_ADDR_CH0    0xFFFFFFFF
#define GDMA_IN_SUC_EOF_DES_ADDR_CH0_M  ((GDMA_IN_SUC_EOF_DES_ADDR_CH0_V)<<(GDMA_IN_SUC_EOF_DES_ADDR_CH0_S))
#define GDMA_IN_SUC_EOF_DES_ADDR_CH0_V  0xFFFFFFFF
#define GDMA_IN_SUC_EOF_DES_ADDR_CH0_S  0

#define GDMA_IN_ERR_EOF_DES_ADDR_CH0_REG          (DR_REG_GDMA_BASE + 0x2C)
/* GDMA_IN_ERR_EOF_DES_ADDR_CH0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when there are some er
rors in current receiving data. Only used when peripheral is UHCI0..*/
#define GDMA_IN_ERR_EOF_DES_ADDR_CH0    0xFFFFFFFF
#define GDMA_IN_ERR_EOF_DES_ADDR_CH0_M  ((GDMA_IN_ERR_EOF_DES_ADDR_CH0_V)<<(GDMA_IN_ERR_EOF_DES_ADDR_CH0_S))
#define GDMA_IN_ERR_EOF_DES_ADDR_CH0_V  0xFFFFFFFF
#define GDMA_IN_ERR_EOF_DES_ADDR_CH0_S  0

