espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
#define GDMA_IN_DSCR_CH0_REG          (DR_REG_GDMA_BASE + 0x30)
/* GDMA_INLINK_DSCR_CH0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current inlink descriptor x..*/
#define GDMA_INLINK_DSCR_CH0    0xFFFFFFFF
#define GDMA_INLINK_DSCR_CH0_M  ((GDMA_INLINK_DSCR_CH0_V)<<(GDMA_INLINK_DSCR_CH0_S))
#define GDMA_INLINK_DSCR_CH0_V  0xFFFFFFFF
#define GDMA_INLINK_DSCR_CH0_S  0

#define GDMA_IN_DSCR_BF0_CH0_REG          (DR_REG_GDMA_BASE + 0x34)
/* GDMA_INLINK_DSCR_BF0_CH0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last inlink descriptor x-1..*/
#define GDMA_INLINK_DSCR_BF0_CH0    0xFFFFFFFF
#define GDMA_INLINK_DSCR_BF0_CH0_M  ((GDMA_INLINK_DSCR_BF0_CH0_V)<<(GDMA_INLINK_DSCR_BF0_CH0_S))
#define GDMA_INLINK_DSCR_BF0_CH0_V  0xFFFFFFFF
#define GDMA_INLINK_DSCR_BF0_CH0_S  0

#define GDMA_IN_DSCR_BF1_CH0_REG          (DR_REG_GDMA_BASE + 0x38)
/* GDMA_INLINK_DSCR_BF1_CH0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2..*/
#define GDMA_INLINK_DSCR_BF1_CH0    0xFFFFFFFF
#define GDMA_INLINK_DSCR_BF1_CH0_M  ((GDMA_INLINK_DSCR_BF1_CH0_V)<<(GDMA_INLINK_DSCR_BF1_CH0_S))
#define GDMA_INLINK_DSCR_BF1_CH0_V  0xFFFFFFFF
#define GDMA_INLINK_DSCR_BF1_CH0_S  0

#define GDMA_IN_WIGHT_CH0_REG          (DR_REG_GDMA_BASE + 0x3C)
/* GDMA_RX_WEIGHT_CH0 : R/W ;bitpos:[11:8] ;default: 4'hf ; */
/*description: The weight of Rx channel 0. .*/
#define GDMA_RX_WEIGHT_CH0    0x0000000F
#define GDMA_RX_WEIGHT_CH0_M  ((GDMA_RX_WEIGHT_CH0_V)<<(GDMA_RX_WEIGHT_CH0_S))
#define GDMA_RX_WEIGHT_CH0_V  0xF
#define GDMA_RX_WEIGHT_CH0_S  8

#define GDMA_IN_PRI_CH0_REG          (DR_REG_GDMA_BASE + 0x44)
/* GDMA_RX_PRI_CH0 : R/W ;bitpos:[3:0] ;default: 4'b0 ; */
/*description: The priority of Rx channel 0. The larger of the value, the higher of the priorit
y..*/
#define GDMA_RX_PRI_CH0    0x0000000F
#define GDMA_RX_PRI_CH0_M  ((GDMA_RX_PRI_CH0_V)<<(GDMA_RX_PRI_CH0_S))
#define GDMA_RX_PRI_CH0_V  0xF
#define GDMA_RX_PRI_CH0_S  0

#define GDMA_IN_PERI_SEL_CH0_REG          (DR_REG_GDMA_BASE + 0x48)
/* GDMA_PERI_IN_SEL_CH0 : R/W ;bitpos:[5:0] ;default: 6'h3f ; */
/*description: This register is used to select peripheral for Rx channel 0. 0:SPI2. 1: SPI3. 2:
 UHCI0. 3: I2S0. 4: I2S1. 5: LCD_CAM. 6: AES. 7: SHA. 8: ADC_DAC. 9: RMT..*/
#define GDMA_PERI_IN_SEL_CH0    0x0000003F
#define GDMA_PERI_IN_SEL_CH0_M  ((GDMA_PERI_IN_SEL_CH0_V)<<(GDMA_PERI_IN_SEL_CH0_S))
#define GDMA_PERI_IN_SEL_CH0_V  0x3F
#define GDMA_PERI_IN_SEL_CH0_S  0

#define GDMA_OUT_CONF0_CH0_REG          (DR_REG_GDMA_BASE + 0x60)
/* GDMA_OUT_DATA_BURST_EN_CH0 : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel 0 transmitting da
ta when accessing internal SRAM. .*/
#define GDMA_OUT_DATA_BURST_EN_CH0    (BIT(5))
#define GDMA_OUT_DATA_BURST_EN_CH0_M  (BIT(5))
#define GDMA_OUT_DATA_BURST_EN_CH0_V  0x1
#define GDMA_OUT_DATA_BURST_EN_CH0_S  5
/* GDMA_OUTDSCR_BURST_EN_CH0 : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel 0 reading link de
scriptor when accessing internal SRAM. .*/
#define GDMA_OUTDSCR_BURST_EN_CH0    (BIT(4))
#define GDMA_OUTDSCR_BURST_EN_CH0_M  (BIT(4))
#define GDMA_OUTDSCR_BURST_EN_CH0_V  0x1
#define GDMA_OUTDSCR_BURST_EN_CH0_S  4
/* GDMA_OUT_EOF_MODE_CH0 : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel 0 is
 generated when data need to transmit has been popped from FIFO in DMA.*/
#define GDMA_OUT_EOF_MODE_CH0    (BIT(3))
#define GDMA_OUT_EOF_MODE_CH0_M  (BIT(3))
#define GDMA_OUT_EOF_MODE_CH0_V  0x1
#define GDMA_OUT_EOF_MODE_CH0_S  3
/* GDMA_OUT_AUTO_WRBACK_CH0 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to enable automatic outlink-writeback when all the data in tx buffe
r has been transmitted..*/
#define GDMA_OUT_AUTO_WRBACK_CH0    (BIT(2))
#define GDMA_OUT_AUTO_WRBACK_CH0_M  (BIT(2))
#define GDMA_OUT_AUTO_WRBACK_CH0_V  0x1
#define GDMA_OUT_AUTO_WRBACK_CH0_S  2
/* GDMA_OUT_LOOP_TEST_CH0 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: reserved.*/
#define GDMA_OUT_LOOP_TEST_CH0    (BIT(1))
#define GDMA_OUT_LOOP_TEST_CH0_M  (BIT(1))
#define GDMA_OUT_LOOP_TEST_CH0_V  0x1
#define GDMA_OUT_LOOP_TEST_CH0_S  1
/* GDMA_OUT_RST_CH0 : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: This bit is used to reset DMA channel 0 Tx FSM and Tx FIFO pointer..*/
#define GDMA_OUT_RST_CH0    (BIT(0))
#define GDMA_OUT_RST_CH0_M  (BIT(0))
#define GDMA_OUT_RST_CH0_V  0x1
#define GDMA_OUT_RST_CH0_S  0

#define GDMA_OUT_CONF1_CH0_REG          (DR_REG_GDMA_BASE + 0x64)
/* GDMA_OUT_EXT_MEM_BK_SIZE_CH0 : R/W ;bitpos:[14:13] ;default: 2'b0 ; */
/*description: Block size of Tx channel 0 when DMA access external SRAM. 0: 16 bytes      1: 32
 bytes    2/3:reserved.*/
#define GDMA_OUT_EXT_MEM_BK_SIZE_CH0    0x00000003
#define GDMA_OUT_EXT_MEM_BK_SIZE_CH0_M  ((GDMA_OUT_EXT_MEM_BK_SIZE_CH0_V)<<(GDMA_OUT_EXT_MEM_BK_SIZE_CH0_S))
#define GDMA_OUT_EXT_MEM_BK_SIZE_CH0_V  0x3
#define GDMA_OUT_EXT_MEM_BK_SIZE_CH0_S  13
/* GDMA_OUT_CHECK_OWNER_CH0 : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to enable checking the owner attribute of the link descriptor..*/
#define GDMA_OUT_CHECK_OWNER_CH0    (BIT(12))
#define GDMA_OUT_CHECK_OWNER_CH0_M  (BIT(12))
#define GDMA_OUT_CHECK_OWNER_CH0_V  0x1
#define GDMA_OUT_CHECK_OWNER_CH0_S  12

#define GDMA_OUT_INT_RAW_CH0_REG          (DR_REG_GDMA_BASE + 0x68)
/* GDMA_OUTFIFO_UDF_L3_CH0_INT_RAW : R/WTC/SS ;bitpos:[7] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo of Tx channel 0 is
underflow. .*/
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_RAW    (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_RAW_M  (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_RAW_V  0x1
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_RAW_S  7
/* GDMA_OUTFIFO_OVF_L3_CH0_INT_RAW : R/WTC/SS ;bitpos:[6] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo of Tx channel 0 is
overflow. .*/
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_RAW    (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_RAW_M  (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_RAW_V  0x1
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_RAW_S  6
/* GDMA_OUTFIFO_UDF_L1_CH0_INT_RAW : R/WTC/SS ;bitpos:[5] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo of Tx channel 0 is
underflow. .*/
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_RAW    (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_RAW_M  (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_RAW_V  0x1
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_RAW_S  5
/* GDMA_OUTFIFO_OVF_L1_CH0_INT_RAW : R/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo of Tx channel 0 is
overflow. .*/
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_RAW    (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_RAW_M  (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_RAW_V  0x1
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_RAW_S  4
/* GDMA_OUT_TOTAL_EOF_CH0_INT_RAW : R/WTC/SS ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when data corresponding a outlink (inc
ludes one link descriptor or few link descriptors) is transmitted out for Tx cha
nnel 0..*/
#define GDMA_OUT_TOTAL_EOF_CH0_INT_RAW    (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH0_INT_RAW_M  (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH0_INT_RAW_V  0x1
#define GDMA_OUT_TOTAL_EOF_CH0_INT_RAW_S  3
/* GDMA_OUT_DSCR_ERR_CH0_INT_RAW : R/WTC/SS ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when detecting outlink descriptor erro
r, including owner error, the second and third word error of outlink descriptor
for Tx channel 0..*/
#define GDMA_OUT_DSCR_ERR_CH0_INT_RAW    (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH0_INT_RAW_M  (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH0_INT_RAW_V  0x1
#define GDMA_OUT_DSCR_ERR_CH0_INT_RAW_S  2
/* GDMA_OUT_EOF_CH0_INT_RAW : R/WTC/SS ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data pointed by one outl
ink descriptor has been read from memory for Tx channel 0. .*/
#define GDMA_OUT_EOF_CH0_INT_RAW    (BIT(1))
#define GDMA_OUT_EOF_CH0_INT_RAW_M  (BIT(1))
#define GDMA_OUT_EOF_CH0_INT_RAW_V  0x1
#define GDMA_OUT_EOF_CH0_INT_RAW_S  1
/* GDMA_OUT_DONE_CH0_INT_RAW : R/WTC/SS ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data pointed by one outl
ink descriptor has been transmitted to peripherals for Tx channel 0..*/
#define GDMA_OUT_DONE_CH0_INT_RAW    (BIT(0))
#define GDMA_OUT_DONE_CH0_INT_RAW_M  (BIT(0))
#define GDMA_OUT_DONE_CH0_INT_RAW_V  0x1
#define GDMA_OUT_DONE_CH0_INT_RAW_S  0

#define GDMA_OUT_INT_ST_CH0_REG          (DR_REG_GDMA_BASE + 0x6C)
/* GDMA_OUTFIFO_UDF_L3_CH0_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_ST    (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_ST_M  (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_ST_V  0x1
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_ST_S  7
/* GDMA_OUTFIFO_OVF_L3_CH0_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_ST    (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_ST_M  (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_ST_V  0x1
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_ST_S  6
/* GDMA_OUTFIFO_UDF_L1_CH0_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_ST    (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_ST_M  (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_ST_V  0x1
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_ST_S  5
/* GDMA_OUTFIFO_OVF_L1_CH0_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_ST    (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_ST_M  (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_ST_V  0x1
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_ST_S  4
/* GDMA_OUT_TOTAL_EOF_CH0_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt..*/
#define GDMA_OUT_TOTAL_EOF_CH0_INT_ST    (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH0_INT_ST_M  (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH0_INT_ST_V  0x1
#define GDMA_OUT_TOTAL_EOF_CH0_INT_ST_S  3
/* GDMA_OUT_DSCR_ERR_CH0_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_OUT_DSCR_ERR_CH0_INT_ST    (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH0_INT_ST_M  (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH0_INT_ST_V  0x1
#define GDMA_OUT_DSCR_ERR_CH0_INT_ST_S  2
/* GDMA_OUT_EOF_CH0_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_EOF_CH_INT interrupt..*/
#define GDMA_OUT_EOF_CH0_INT_ST    (BIT(1))
#define GDMA_OUT_EOF_CH0_INT_ST_M  (BIT(1))
#define GDMA_OUT_EOF_CH0_INT_ST_V  0x1
#define GDMA_OUT_EOF_CH0_INT_ST_S  1
/* GDMA_OUT_DONE_CH0_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DONE_CH_INT interrupt..*/
#define GDMA_OUT_DONE_CH0_INT_ST    (BIT(0))
#define GDMA_OUT_DONE_CH0_INT_ST_M  (BIT(0))
#define GDMA_OUT_DONE_CH0_INT_ST_V  0x1
#define GDMA_OUT_DONE_CH0_INT_ST_S  0

#define GDMA_OUT_INT_ENA_CH0_REG          (DR_REG_GDMA_BASE + 0x70)
/* GDMA_OUTFIFO_UDF_L3_CH0_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_ENA    (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_ENA_M  (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_ENA_V  0x1
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_ENA_S  7
/* GDMA_OUTFIFO_OVF_L3_CH0_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_ENA    (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_ENA_M  (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_ENA_V  0x1
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_ENA_S  6
/* GDMA_OUTFIFO_UDF_L1_CH0_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_ENA    (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_ENA_M  (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_ENA_V  0x1
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_ENA_S  5
/* GDMA_OUTFIFO_OVF_L1_CH0_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_ENA    (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_ENA_M  (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_ENA_V  0x1
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_ENA_S  4
/* GDMA_OUT_TOTAL_EOF_CH0_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt..*/
#define GDMA_OUT_TOTAL_EOF_CH0_INT_ENA    (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH0_INT_ENA_M  (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH0_INT_ENA_V  0x1
#define GDMA_OUT_TOTAL_EOF_CH0_INT_ENA_S  3
/* GDMA_OUT_DSCR_ERR_CH0_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_OUT_DSCR_ERR_CH0_INT_ENA    (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH0_INT_ENA_M  (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH0_INT_ENA_V  0x1
#define GDMA_OUT_DSCR_ERR_CH0_INT_ENA_S  2
/* GDMA_OUT_EOF_CH0_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_EOF_CH_INT interrupt..*/
#define GDMA_OUT_EOF_CH0_INT_ENA    (BIT(1))
#define GDMA_OUT_EOF_CH0_INT_ENA_M  (BIT(1))
#define GDMA_OUT_EOF_CH0_INT_ENA_V  0x1
#define GDMA_OUT_EOF_CH0_INT_ENA_S  1
/* GDMA_OUT_DONE_CH0_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_DONE_CH_INT interrupt..*/
#define GDMA_OUT_DONE_CH0_INT_ENA    (BIT(0))
#define GDMA_OUT_DONE_CH0_INT_ENA_M  (BIT(0))
#define GDMA_OUT_DONE_CH0_INT_ENA_V  0x1
#define GDMA_OUT_DONE_CH0_INT_ENA_S  0

#define GDMA_OUT_INT_CLR_CH0_REG          (DR_REG_GDMA_BASE + 0x74)
/* GDMA_OUTFIFO_UDF_L3_CH0_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_CLR    (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_CLR_M  (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_CLR_V  0x1
#define GDMA_OUTFIFO_UDF_L3_CH0_INT_CLR_S  7
/* GDMA_OUTFIFO_OVF_L3_CH0_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_CLR    (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_CLR_M  (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_CLR_V  0x1
#define GDMA_OUTFIFO_OVF_L3_CH0_INT_CLR_S  6
/* GDMA_OUTFIFO_UDF_L1_CH0_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_CLR    (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_CLR_M  (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_CLR_V  0x1
#define GDMA_OUTFIFO_UDF_L1_CH0_INT_CLR_S  5
/* GDMA_OUTFIFO_OVF_L1_CH0_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_CLR    (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_CLR_M  (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_CLR_V  0x1
#define GDMA_OUTFIFO_OVF_L1_CH0_INT_CLR_S  4
/* GDMA_OUT_TOTAL_EOF_CH0_INT_CLR : WT ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt..*/
#define GDMA_OUT_TOTAL_EOF_CH0_INT_CLR    (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH0_INT_CLR_M  (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH0_INT_CLR_V  0x1
#define GDMA_OUT_TOTAL_EOF_CH0_INT_CLR_S  3
/* GDMA_OUT_DSCR_ERR_CH0_INT_CLR : WT ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_OUT_DSCR_ERR_CH0_INT_CLR    (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH0_INT_CLR_M  (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH0_INT_CLR_V  0x1
#define GDMA_OUT_DSCR_ERR_CH0_INT_CLR_S  2
/* GDMA_OUT_EOF_CH0_INT_CLR : WT ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_EOF_CH_INT interrupt..*/
#define GDMA_OUT_EOF_CH0_INT_CLR    (BIT(1))
#define GDMA_OUT_EOF_CH0_INT_CLR_M  (BIT(1))
#define GDMA_OUT_EOF_CH0_INT_CLR_V  0x1
#define GDMA_OUT_EOF_CH0_INT_CLR_S  1
/* GDMA_OUT_DONE_CH0_INT_CLR : WT ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DONE_CH_INT interrupt..*/
#define GDMA_OUT_DONE_CH0_INT_CLR    (BIT(0))
#define GDMA_OUT_DONE_CH0_INT_CLR_M  (BIT(0))
#define GDMA_OUT_DONE_CH0_INT_CLR_V  0x1
#define GDMA_OUT_DONE_CH0_INT_CLR_S  0

#define GDMA_OUTFIFO_STATUS_CH0_REG          (DR_REG_GDMA_BASE + 0x78)
/* GDMA_OUT_REMAIN_UNDER_4B_L3_CH0 : RO ;bitpos:[26] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_OUT_REMAIN_UNDER_4B_L3_CH0    (BIT(26))
#define GDMA_OUT_REMAIN_UNDER_4B_L3_CH0_M  (BIT(26))
#define GDMA_OUT_REMAIN_UNDER_4B_L3_CH0_V  0x1
#define GDMA_OUT_REMAIN_UNDER_4B_L3_CH0_S  26
/* GDMA_OUT_REMAIN_UNDER_3B_L3_CH0 : RO ;bitpos:[25] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_OUT_REMAIN_UNDER_3B_L3_CH0    (BIT(25))
#define GDMA_OUT_REMAIN_UNDER_3B_L3_CH0_M  (BIT(25))
#define GDMA_OUT_REMAIN_UNDER_3B_L3_CH0_V  0x1
#define GDMA_OUT_REMAIN_UNDER_3B_L3_CH0_S  25
/* GDMA_OUT_REMAIN_UNDER_2B_L3_CH0 : RO ;bitpos:[24] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_OUT_REMAIN_UNDER_2B_L3_CH0    (BIT(24))
#define GDMA_OUT_REMAIN_UNDER_2B_L3_CH0_M  (BIT(24))
#define GDMA_OUT_REMAIN_UNDER_2B_L3_CH0_V  0x1
#define GDMA_OUT_REMAIN_UNDER_2B_L3_CH0_S  24
/* GDMA_OUT_REMAIN_UNDER_1B_L3_CH0 : RO ;bitpos:[23] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_OUT_REMAIN_UNDER_1B_L3_CH0    (BIT(23))
#define GDMA_OUT_REMAIN_UNDER_1B_L3_CH0_M  (BIT(23))
#define GDMA_OUT_REMAIN_UNDER_1B_L3_CH0_V  0x1
#define GDMA_OUT_REMAIN_UNDER_1B_L3_CH0_S  23
/* GDMA_OUTFIFO_CNT_L3_CH0 : RO ;bitpos:[22:18] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L3 Tx FIFO for Tx channel 0..*/
#define GDMA_OUTFIFO_CNT_L3_CH0    0x0000001F
#define GDMA_OUTFIFO_CNT_L3_CH0_M  ((GDMA_OUTFIFO_CNT_L3_CH0_V)<<(GDMA_OUTFIFO_CNT_L3_CH0_S))
#define GDMA_OUTFIFO_CNT_L3_CH0_V  0x1F
#define GDMA_OUTFIFO_CNT_L3_CH0_S  18
/* GDMA_OUTFIFO_CNT_L2_CH0 : RO ;bitpos:[17:11] ;default: 7'b0 ; */
/*description: The register stores the byte number of the data in L2 Tx FIFO for Tx channel 0..*/
#define GDMA_OUTFIFO_CNT_L2_CH0    0x0000007F
#define GDMA_OUTFIFO_CNT_L2_CH0_M  ((GDMA_OUTFIFO_CNT_L2_CH0_V)<<(GDMA_OUTFIFO_CNT_L2_CH0_S))
#define GDMA_OUTFIFO_CNT_L2_CH0_V  0x7F
#define GDMA_OUTFIFO_CNT_L2_CH0_S  11
/* GDMA_OUTFIFO_CNT_L1_CH0 : RO ;bitpos:[10:6] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L1 Tx FIFO for Tx channel 0..*/
#define GDMA_OUTFIFO_CNT_L1_CH0    0x0000001F
#define GDMA_OUTFIFO_CNT_L1_CH0_M  ((GDMA_OUTFIFO_CNT_L1_CH0_V)<<(GDMA_OUTFIFO_CNT_L1_CH0_S))
#define GDMA_OUTFIFO_CNT_L1_CH0_V  0x1F
#define GDMA_OUTFIFO_CNT_L1_CH0_S  6
/* GDMA_OUTFIFO_EMPTY_L3_CH0 : RO ;bitpos:[5] ;default: 1'b1 ; */
/*description: L3 Tx FIFO empty signal for Tx channel 0..*/
#define GDMA_OUTFIFO_EMPTY_L3_CH0    (BIT(5))
#define GDMA_OUTFIFO_EMPTY_L3_CH0_M  (BIT(5))
#define GDMA_OUTFIFO_EMPTY_L3_CH0_V  0x1
#define GDMA_OUTFIFO_EMPTY_L3_CH0_S  5
/* GDMA_OUTFIFO_FULL_L3_CH0 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: L3 Tx FIFO full signal for Tx channel 0..*/
#define GDMA_OUTFIFO_FULL_L3_CH0    (BIT(4))
#define GDMA_OUTFIFO_FULL_L3_CH0_M  (BIT(4))
#define GDMA_OUTFIFO_FULL_L3_CH0_V  0x1
#define GDMA_OUTFIFO_FULL_L3_CH0_S  4
/* GDMA_OUTFIFO_EMPTY_L2_CH0 : RO ;bitpos:[3] ;default: 1'b1 ; */
/*description: L2 Tx FIFO empty signal for Tx channel 0..*/
#define GDMA_OUTFIFO_EMPTY_L2_CH0    (BIT(3))
#define GDMA_OUTFIFO_EMPTY_L2_CH0_M  (BIT(3))
#define GDMA_OUTFIFO_EMPTY_L2_CH0_V  0x1
#define GDMA_OUTFIFO_EMPTY_L2_CH0_S  3
/* GDMA_OUTFIFO_FULL_L2_CH0 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: L2 Tx FIFO full signal for Tx channel 0..*/
#define GDMA_OUTFIFO_FULL_L2_CH0    (BIT(2))
#define GDMA_OUTFIFO_FULL_L2_CH0_M  (BIT(2))
#define GDMA_OUTFIFO_FULL_L2_CH0_V  0x1
#define GDMA_OUTFIFO_FULL_L2_CH0_S  2
/* GDMA_OUTFIFO_EMPTY_L1_CH0 : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: L1 Tx FIFO empty signal for Tx channel 0..*/
#define GDMA_OUTFIFO_EMPTY_L1_CH0    (BIT(1))
#define GDMA_OUTFIFO_EMPTY_L1_CH0_M  (BIT(1))
#define GDMA_OUTFIFO_EMPTY_L1_CH0_V  0x1
#define GDMA_OUTFIFO_EMPTY_L1_CH0_S  1
/* GDMA_OUTFIFO_FULL_L1_CH0 : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: L1 Tx FIFO full signal for Tx channel 0..*/
#define GDMA_OUTFIFO_FULL_L1_CH0    (BIT(0))
#define GDMA_OUTFIFO_FULL_L1_CH0_M  (BIT(0))
#define GDMA_OUTFIFO_FULL_L1_CH0_V  0x1
#define GDMA_OUTFIFO_FULL_L1_CH0_S  0

#define GDMA_OUT_PUSH_CH0_REG          (DR_REG_GDMA_BASE + 0x7C)
/* GDMA_OUTFIFO_PUSH_CH0 : R/W/SC ;bitpos:[9] ;default: 1'h0 ; */
/*description: Set this bit to push data into DMA FIFO..*/
#define GDMA_OUTFIFO_PUSH_CH0    (BIT(9))
#define GDMA_OUTFIFO_PUSH_CH0_M  (BIT(9))
#define GDMA_OUTFIFO_PUSH_CH0_V  0x1
#define GDMA_OUTFIFO_PUSH_CH0_S  9
/* GDMA_OUTFIFO_WDATA_CH0 : R/W ;bitpos:[8:0] ;default: 9'h0 ; */
/*description: This register stores the data that need to be pushed into DMA FIFO..*/
#define GDMA_OUTFIFO_WDATA_CH0    0x000001FF
#define GDMA_OUTFIFO_WDATA_CH0_M  ((GDMA_OUTFIFO_WDATA_CH0_V)<<(GDMA_OUTFIFO_WDATA_CH0_S))
#define GDMA_OUTFIFO_WDATA_CH0_V  0x1FF
#define GDMA_OUTFIFO_WDATA_CH0_S  0

#define GDMA_OUT_LINK_CH0_REG          (DR_REG_GDMA_BASE + 0x80)
/* GDMA_OUTLINK_PARK_CH0 : RO ;bitpos:[23] ;default: 1'h1 ; */
/*description: 1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's F
SM is working..*/
#define GDMA_OUTLINK_PARK_CH0    (BIT(23))
#define GDMA_OUTLINK_PARK_CH0_M  (BIT(23))
#define GDMA_OUTLINK_PARK_CH0_V  0x1
#define GDMA_OUTLINK_PARK_CH0_S  23
/* GDMA_OUTLINK_RESTART_CH0 : R/W/SC ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this bit to restart a new outlink from the last address. .*/
#define GDMA_OUTLINK_RESTART_CH0    (BIT(22))
#define GDMA_OUTLINK_RESTART_CH0_M  (BIT(22))
#define GDMA_OUTLINK_RESTART_CH0_V  0x1
#define GDMA_OUTLINK_RESTART_CH0_S  22
/* GDMA_OUTLINK_START_CH0 : R/W/SC ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this bit to start dealing with the outlink descriptors..*/
#define GDMA_OUTLINK_START_CH0    (BIT(21))
#define GDMA_OUTLINK_START_CH0_M  (BIT(21))
#define GDMA_OUTLINK_START_CH0_V  0x1
#define GDMA_OUTLINK_START_CH0_S  21
/* GDMA_OUTLINK_STOP_CH0 : R/W/SC ;bitpos:[20] ;default: 1'b0 ; */
/*description: Set this bit to stop dealing with the outlink descriptors..*/
#define GDMA_OUTLINK_STOP_CH0    (BIT(20))
#define GDMA_OUTLINK_STOP_CH0_M  (BIT(20))
#define GDMA_OUTLINK_STOP_CH0_V  0x1
#define GDMA_OUTLINK_STOP_CH0_S  20
/* GDMA_OUTLINK_ADDR_CH0 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: This register stores the 20 least significant bits of the first outlink descript
or's address..*/
#define GDMA_OUTLINK_ADDR_CH0    0x000FFFFF
#define GDMA_OUTLINK_ADDR_CH0_M  ((GDMA_OUTLINK_ADDR_CH0_V)<<(GDMA_OUTLINK_ADDR_CH0_S))
#define GDMA_OUTLINK_ADDR_CH0_V  0xFFFFF
#define GDMA_OUTLINK_ADDR_CH0_S  0

