espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
#define GDMA_OUT_STATE_CH0_REG          (DR_REG_GDMA_BASE + 0x84)
/* GDMA_OUT_STATE_CH0 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved.*/
#define GDMA_OUT_STATE_CH0    0x00000007
#define GDMA_OUT_STATE_CH0_M  ((GDMA_OUT_STATE_CH0_V)<<(GDMA_OUT_STATE_CH0_S))
#define GDMA_OUT_STATE_CH0_V  0x7
#define GDMA_OUT_STATE_CH0_S  20
/* GDMA_OUT_DSCR_STATE_CH0 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved.*/
#define GDMA_OUT_DSCR_STATE_CH0    0x00000003
#define GDMA_OUT_DSCR_STATE_CH0_M  ((GDMA_OUT_DSCR_STATE_CH0_V)<<(GDMA_OUT_DSCR_STATE_CH0_S))
#define GDMA_OUT_DSCR_STATE_CH0_V  0x3
#define GDMA_OUT_DSCR_STATE_CH0_S  18
/* GDMA_OUTLINK_DSCR_ADDR_CH0 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current outlink descriptor's address..*/
#define GDMA_OUTLINK_DSCR_ADDR_CH0    0x0003FFFF
#define GDMA_OUTLINK_DSCR_ADDR_CH0_M  ((GDMA_OUTLINK_DSCR_ADDR_CH0_V)<<(GDMA_OUTLINK_DSCR_ADDR_CH0_S))
#define GDMA_OUTLINK_DSCR_ADDR_CH0_V  0x3FFFF
#define GDMA_OUTLINK_DSCR_ADDR_CH0_S  0

#define GDMA_OUT_EOF_DES_ADDR_CH0_REG          (DR_REG_GDMA_BASE + 0x88)
/* GDMA_OUT_EOF_DES_ADDR_CH0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor when the EOF bit in t
his descriptor is 1..*/
#define GDMA_OUT_EOF_DES_ADDR_CH0    0xFFFFFFFF
#define GDMA_OUT_EOF_DES_ADDR_CH0_M  ((GDMA_OUT_EOF_DES_ADDR_CH0_V)<<(GDMA_OUT_EOF_DES_ADDR_CH0_S))
#define GDMA_OUT_EOF_DES_ADDR_CH0_V  0xFFFFFFFF
#define GDMA_OUT_EOF_DES_ADDR_CH0_S  0

#define GDMA_OUT_EOF_BFR_DES_ADDR_CH0_REG          (DR_REG_GDMA_BASE + 0x8C)
/* GDMA_OUT_EOF_BFR_DES_ADDR_CH0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor before the last outli
nk descriptor..*/
#define GDMA_OUT_EOF_BFR_DES_ADDR_CH0    0xFFFFFFFF
#define GDMA_OUT_EOF_BFR_DES_ADDR_CH0_M  ((GDMA_OUT_EOF_BFR_DES_ADDR_CH0_V)<<(GDMA_OUT_EOF_BFR_DES_ADDR_CH0_S))
#define GDMA_OUT_EOF_BFR_DES_ADDR_CH0_V  0xFFFFFFFF
#define GDMA_OUT_EOF_BFR_DES_ADDR_CH0_S  0

#define GDMA_OUT_DSCR_CH0_REG          (DR_REG_GDMA_BASE + 0x90)
/* GDMA_OUTLINK_DSCR_CH0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current outlink descriptor y..*/
#define GDMA_OUTLINK_DSCR_CH0    0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_CH0_M  ((GDMA_OUTLINK_DSCR_CH0_V)<<(GDMA_OUTLINK_DSCR_CH0_S))
#define GDMA_OUTLINK_DSCR_CH0_V  0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_CH0_S  0

#define GDMA_OUT_DSCR_BF0_CH0_REG          (DR_REG_GDMA_BASE + 0x94)
/* GDMA_OUTLINK_DSCR_BF0_CH0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last outlink descriptor y-1..*/
#define GDMA_OUTLINK_DSCR_BF0_CH0    0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_BF0_CH0_M  ((GDMA_OUTLINK_DSCR_BF0_CH0_V)<<(GDMA_OUTLINK_DSCR_BF0_CH0_S))
#define GDMA_OUTLINK_DSCR_BF0_CH0_V  0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_BF0_CH0_S  0

#define GDMA_OUT_DSCR_BF1_CH0_REG          (DR_REG_GDMA_BASE + 0x98)
/* GDMA_OUTLINK_DSCR_BF1_CH0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2..*/
#define GDMA_OUTLINK_DSCR_BF1_CH0    0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_BF1_CH0_M  ((GDMA_OUTLINK_DSCR_BF1_CH0_V)<<(GDMA_OUTLINK_DSCR_BF1_CH0_S))
#define GDMA_OUTLINK_DSCR_BF1_CH0_V  0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_BF1_CH0_S  0

#define GDMA_OUT_WIGHT_CH0_REG          (DR_REG_GDMA_BASE + 0x9C)
/* GDMA_TX_WEIGHT_CH0 : R/W ;bitpos:[11:8] ;default: 4'hf ; */
/*description: The weight of Tx channel 0. .*/
#define GDMA_TX_WEIGHT_CH0    0x0000000F
#define GDMA_TX_WEIGHT_CH0_M  ((GDMA_TX_WEIGHT_CH0_V)<<(GDMA_TX_WEIGHT_CH0_S))
#define GDMA_TX_WEIGHT_CH0_V  0xF
#define GDMA_TX_WEIGHT_CH0_S  8

#define GDMA_OUT_PRI_CH0_REG          (DR_REG_GDMA_BASE + 0xA4)
/* GDMA_TX_PRI_CH0 : R/W ;bitpos:[3:0] ;default: 4'b0 ; */
/*description: The priority of Tx channel 0. The larger of the value, the higher of the priorit
y..*/
#define GDMA_TX_PRI_CH0    0x0000000F
#define GDMA_TX_PRI_CH0_M  ((GDMA_TX_PRI_CH0_V)<<(GDMA_TX_PRI_CH0_S))
#define GDMA_TX_PRI_CH0_V  0xF
#define GDMA_TX_PRI_CH0_S  0

#define GDMA_OUT_PERI_SEL_CH0_REG          (DR_REG_GDMA_BASE + 0xA8)
/* GDMA_PERI_OUT_SEL_CH0 : R/W ;bitpos:[5:0] ;default: 6'h3f ; */
/*description: This register is used to select peripheral for Tx channel 0. 0:SPI2. 1: SPI3. 2:
 UHCI0. 3: I2S0. 4: I2S1. 5: LCD_CAM. 6: AES. 7: SHA. 8: ADC_DAC. 9: RMT.; 7: AE
S. 8: SHA. 9: ADC_DAC..*/
#define GDMA_PERI_OUT_SEL_CH0    0x0000003F
#define GDMA_PERI_OUT_SEL_CH0_M  ((GDMA_PERI_OUT_SEL_CH0_V)<<(GDMA_PERI_OUT_SEL_CH0_S))
#define GDMA_PERI_OUT_SEL_CH0_V  0x3F
#define GDMA_PERI_OUT_SEL_CH0_S  0

#define GDMA_IN_CONF0_CH1_REG          (DR_REG_GDMA_BASE + 0xC0)
/* GDMA_MEM_TRANS_EN_CH1 : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit 1 to enable automatic transmitting data from memory to memory via D
MA..*/
#define GDMA_MEM_TRANS_EN_CH1    (BIT(4))
#define GDMA_MEM_TRANS_EN_CH1_M  (BIT(4))
#define GDMA_MEM_TRANS_EN_CH1_V  0x1
#define GDMA_MEM_TRANS_EN_CH1_S  4
/* GDMA_IN_DATA_BURST_EN_CH1 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel 1 receiving data
when accessing internal SRAM. .*/
#define GDMA_IN_DATA_BURST_EN_CH1    (BIT(3))
#define GDMA_IN_DATA_BURST_EN_CH1_M  (BIT(3))
#define GDMA_IN_DATA_BURST_EN_CH1_V  0x1
#define GDMA_IN_DATA_BURST_EN_CH1_S  3
/* GDMA_INDSCR_BURST_EN_CH1 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel 1 reading link de
scriptor when accessing internal SRAM. .*/
#define GDMA_INDSCR_BURST_EN_CH1    (BIT(2))
#define GDMA_INDSCR_BURST_EN_CH1_M  (BIT(2))
#define GDMA_INDSCR_BURST_EN_CH1_V  0x1
#define GDMA_INDSCR_BURST_EN_CH1_S  2
/* GDMA_IN_LOOP_TEST_CH1 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: reserved.*/
#define GDMA_IN_LOOP_TEST_CH1    (BIT(1))
#define GDMA_IN_LOOP_TEST_CH1_M  (BIT(1))
#define GDMA_IN_LOOP_TEST_CH1_V  0x1
#define GDMA_IN_LOOP_TEST_CH1_S  1
/* GDMA_IN_RST_CH1 : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: This bit is used to reset DMA channel 1 Rx FSM and Rx FIFO pointer..*/
#define GDMA_IN_RST_CH1    (BIT(0))
#define GDMA_IN_RST_CH1_M  (BIT(0))
#define GDMA_IN_RST_CH1_V  0x1
#define GDMA_IN_RST_CH1_S  0

#define GDMA_IN_CONF1_CH1_REG          (DR_REG_GDMA_BASE + 0xC4)
/* GDMA_IN_EXT_MEM_BK_SIZE_CH1 : R/W ;bitpos:[14:13] ;default: 2'b0 ; */
/*description: Block size of Rx channel 1 when DMA access external SRAM. 0: 16 bytes      1: 32
 bytes    2/3:reserved.*/
#define GDMA_IN_EXT_MEM_BK_SIZE_CH1    0x00000003
#define GDMA_IN_EXT_MEM_BK_SIZE_CH1_M  ((GDMA_IN_EXT_MEM_BK_SIZE_CH1_V)<<(GDMA_IN_EXT_MEM_BK_SIZE_CH1_S))
#define GDMA_IN_EXT_MEM_BK_SIZE_CH1_V  0x3
#define GDMA_IN_EXT_MEM_BK_SIZE_CH1_S  13
/* GDMA_IN_CHECK_OWNER_CH1 : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to enable checking the owner attribute of the link descriptor..*/
#define GDMA_IN_CHECK_OWNER_CH1    (BIT(12))
#define GDMA_IN_CHECK_OWNER_CH1_M  (BIT(12))
#define GDMA_IN_CHECK_OWNER_CH1_V  0x1
#define GDMA_IN_CHECK_OWNER_CH1_S  12
/* GDMA_DMA_INFIFO_FULL_THRS_CH1 : R/W ;bitpos:[11:0] ;default: 12'hc ; */
/*description: This register is used to generate the INFIFO_FULL_WM_INT interrupt when Rx chann
el 0 received byte number in Rx FIFO is up to the value of the register..*/
#define GDMA_DMA_INFIFO_FULL_THRS_CH1    0x00000FFF
#define GDMA_DMA_INFIFO_FULL_THRS_CH1_M  ((GDMA_DMA_INFIFO_FULL_THRS_CH1_V)<<(GDMA_DMA_INFIFO_FULL_THRS_CH1_S))
#define GDMA_DMA_INFIFO_FULL_THRS_CH1_V  0xFFF
#define GDMA_DMA_INFIFO_FULL_THRS_CH1_S  0

#define GDMA_IN_INT_RAW_CH1_REG          (DR_REG_GDMA_BASE + 0xC8)
/* GDMA_INFIFO_UDF_L3_CH1_INT_RAW : R/WTC/SS ;bitpos:[9] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo of Rx channel 1 is
underflow. .*/
#define GDMA_INFIFO_UDF_L3_CH1_INT_RAW    (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH1_INT_RAW_M  (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH1_INT_RAW_V  0x1
#define GDMA_INFIFO_UDF_L3_CH1_INT_RAW_S  9
/* GDMA_INFIFO_OVF_L3_CH1_INT_RAW : R/WTC/SS ;bitpos:[8] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo of Rx channel 1 is
overflow. .*/
#define GDMA_INFIFO_OVF_L3_CH1_INT_RAW    (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH1_INT_RAW_M  (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH1_INT_RAW_V  0x1
#define GDMA_INFIFO_OVF_L3_CH1_INT_RAW_S  8
/* GDMA_INFIFO_UDF_L1_CH1_INT_RAW : R/WTC/SS ;bitpos:[7] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo of Rx channel 1 is
underflow. .*/
#define GDMA_INFIFO_UDF_L1_CH1_INT_RAW    (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH1_INT_RAW_M  (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH1_INT_RAW_V  0x1
#define GDMA_INFIFO_UDF_L1_CH1_INT_RAW_S  7
/* GDMA_INFIFO_OVF_L1_CH1_INT_RAW : R/WTC/SS ;bitpos:[6] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo of Rx channel 1 is
overflow. .*/
#define GDMA_INFIFO_OVF_L1_CH1_INT_RAW    (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH1_INT_RAW_M  (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH1_INT_RAW_V  0x1
#define GDMA_INFIFO_OVF_L1_CH1_INT_RAW_S  6
/* GDMA_INFIFO_FULL_WM_CH1_INT_RAW : R/WTC/SS ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when received data byte number is up t
o threshold configured by REG_DMA_INFIFO_FULL_THRS_CH0 in Rx FIFO of channel 1..*/
#define GDMA_INFIFO_FULL_WM_CH1_INT_RAW    (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH1_INT_RAW_M  (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH1_INT_RAW_V  0x1
#define GDMA_INFIFO_FULL_WM_CH1_INT_RAW_S  5
/* GDMA_IN_DSCR_EMPTY_CH1_INT_RAW : R/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when Rx buffer pointed by inlink is fu
ll and receiving data is not completed, but there is no more inlink for Rx chann
el 1..*/
#define GDMA_IN_DSCR_EMPTY_CH1_INT_RAW    (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH1_INT_RAW_M  (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH1_INT_RAW_V  0x1
#define GDMA_IN_DSCR_EMPTY_CH1_INT_RAW_S  4
/* GDMA_IN_DSCR_ERR_CH1_INT_RAW : R/WTC/SS ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when detecting inlink descriptor error
, including owner error, the second and third word error of inlink descriptor fo
r Rx channel 1..*/
#define GDMA_IN_DSCR_ERR_CH1_INT_RAW    (BIT(3))
#define GDMA_IN_DSCR_ERR_CH1_INT_RAW_M  (BIT(3))
#define GDMA_IN_DSCR_ERR_CH1_INT_RAW_V  0x1
#define GDMA_IN_DSCR_ERR_CH1_INT_RAW_S  3
/* GDMA_IN_ERR_EOF_CH1_INT_RAW : R/WTC/SS ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when data error is detected only in th
e case that the peripheral is UHCI0 for Rx channel 1. For other peripherals, thi
s raw interrupt is reserved..*/
#define GDMA_IN_ERR_EOF_CH1_INT_RAW    (BIT(2))
#define GDMA_IN_ERR_EOF_CH1_INT_RAW_M  (BIT(2))
#define GDMA_IN_ERR_EOF_CH1_INT_RAW_V  0x1
#define GDMA_IN_ERR_EOF_CH1_INT_RAW_S  2
/* GDMA_IN_SUC_EOF_CH1_INT_RAW : R/WTC/SS ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data pointed by one inli
nk descriptor has been received for Rx channel 1. For UHCI0, the raw interrupt b
it turns to high level when the last data pointed by one inlink descriptor has b
een received and no data error is detected for Rx channel 0..*/
#define GDMA_IN_SUC_EOF_CH1_INT_RAW    (BIT(1))
#define GDMA_IN_SUC_EOF_CH1_INT_RAW_M  (BIT(1))
#define GDMA_IN_SUC_EOF_CH1_INT_RAW_V  0x1
#define GDMA_IN_SUC_EOF_CH1_INT_RAW_S  1
/* GDMA_IN_DONE_CH1_INT_RAW : R/WTC/SS ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data pointed by one inli
nk descriptor has been received for Rx channel 1..*/
#define GDMA_IN_DONE_CH1_INT_RAW    (BIT(0))
#define GDMA_IN_DONE_CH1_INT_RAW_M  (BIT(0))
#define GDMA_IN_DONE_CH1_INT_RAW_V  0x1
#define GDMA_IN_DONE_CH1_INT_RAW_S  0

