espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
#define GDMA_IN_INT_ST_CH1_REG          (DR_REG_GDMA_BASE + 0xCC)
/* GDMA_INFIFO_UDF_L3_CH1_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L3_CH1_INT_ST    (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH1_INT_ST_M  (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH1_INT_ST_V  0x1
#define GDMA_INFIFO_UDF_L3_CH1_INT_ST_S  9
/* GDMA_INFIFO_OVF_L3_CH1_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L3_CH1_INT_ST    (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH1_INT_ST_M  (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH1_INT_ST_V  0x1
#define GDMA_INFIFO_OVF_L3_CH1_INT_ST_S  8
/* GDMA_INFIFO_UDF_L1_CH1_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L1_CH1_INT_ST    (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH1_INT_ST_M  (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH1_INT_ST_V  0x1
#define GDMA_INFIFO_UDF_L1_CH1_INT_ST_S  7
/* GDMA_INFIFO_OVF_L1_CH1_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L1_CH1_INT_ST    (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH1_INT_ST_M  (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH1_INT_ST_V  0x1
#define GDMA_INFIFO_OVF_L1_CH1_INT_ST_S  6
/* GDMA_INFIFO_FULL_WM_CH1_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_FULL_WM_CH_INT interrupt..*/
#define GDMA_INFIFO_FULL_WM_CH1_INT_ST    (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH1_INT_ST_M  (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH1_INT_ST_V  0x1
#define GDMA_INFIFO_FULL_WM_CH1_INT_ST_S  5
/* GDMA_IN_DSCR_EMPTY_CH1_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt..*/
#define GDMA_IN_DSCR_EMPTY_CH1_INT_ST    (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH1_INT_ST_M  (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH1_INT_ST_V  0x1
#define GDMA_IN_DSCR_EMPTY_CH1_INT_ST_S  4
/* GDMA_IN_DSCR_ERR_CH1_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_IN_DSCR_ERR_CH1_INT_ST    (BIT(3))
#define GDMA_IN_DSCR_ERR_CH1_INT_ST_M  (BIT(3))
#define GDMA_IN_DSCR_ERR_CH1_INT_ST_V  0x1
#define GDMA_IN_DSCR_ERR_CH1_INT_ST_S  3
/* GDMA_IN_ERR_EOF_CH1_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt..*/
#define GDMA_IN_ERR_EOF_CH1_INT_ST    (BIT(2))
#define GDMA_IN_ERR_EOF_CH1_INT_ST_M  (BIT(2))
#define GDMA_IN_ERR_EOF_CH1_INT_ST_V  0x1
#define GDMA_IN_ERR_EOF_CH1_INT_ST_S  2
/* GDMA_IN_SUC_EOF_CH1_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt..*/
#define GDMA_IN_SUC_EOF_CH1_INT_ST    (BIT(1))
#define GDMA_IN_SUC_EOF_CH1_INT_ST_M  (BIT(1))
#define GDMA_IN_SUC_EOF_CH1_INT_ST_V  0x1
#define GDMA_IN_SUC_EOF_CH1_INT_ST_S  1
/* GDMA_IN_DONE_CH1_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DONE_CH_INT interrupt..*/
#define GDMA_IN_DONE_CH1_INT_ST    (BIT(0))
#define GDMA_IN_DONE_CH1_INT_ST_M  (BIT(0))
#define GDMA_IN_DONE_CH1_INT_ST_V  0x1
#define GDMA_IN_DONE_CH1_INT_ST_S  0

#define GDMA_IN_INT_ENA_CH1_REG          (DR_REG_GDMA_BASE + 0xD0)
/* GDMA_INFIFO_UDF_L3_CH1_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L3_CH1_INT_ENA    (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH1_INT_ENA_M  (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH1_INT_ENA_V  0x1
#define GDMA_INFIFO_UDF_L3_CH1_INT_ENA_S  9
/* GDMA_INFIFO_OVF_L3_CH1_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L3_CH1_INT_ENA    (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH1_INT_ENA_M  (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH1_INT_ENA_V  0x1
#define GDMA_INFIFO_OVF_L3_CH1_INT_ENA_S  8
/* GDMA_INFIFO_UDF_L1_CH1_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L1_CH1_INT_ENA    (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH1_INT_ENA_M  (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH1_INT_ENA_V  0x1
#define GDMA_INFIFO_UDF_L1_CH1_INT_ENA_S  7
/* GDMA_INFIFO_OVF_L1_CH1_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L1_CH1_INT_ENA    (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH1_INT_ENA_M  (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH1_INT_ENA_V  0x1
#define GDMA_INFIFO_OVF_L1_CH1_INT_ENA_S  6
/* GDMA_INFIFO_FULL_WM_CH1_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_FULL_WM_CH_INT interrupt..*/
#define GDMA_INFIFO_FULL_WM_CH1_INT_ENA    (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH1_INT_ENA_M  (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH1_INT_ENA_V  0x1
#define GDMA_INFIFO_FULL_WM_CH1_INT_ENA_S  5
/* GDMA_IN_DSCR_EMPTY_CH1_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt..*/
#define GDMA_IN_DSCR_EMPTY_CH1_INT_ENA    (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH1_INT_ENA_M  (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH1_INT_ENA_V  0x1
#define GDMA_IN_DSCR_EMPTY_CH1_INT_ENA_S  4
/* GDMA_IN_DSCR_ERR_CH1_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_IN_DSCR_ERR_CH1_INT_ENA    (BIT(3))
#define GDMA_IN_DSCR_ERR_CH1_INT_ENA_M  (BIT(3))
#define GDMA_IN_DSCR_ERR_CH1_INT_ENA_V  0x1
#define GDMA_IN_DSCR_ERR_CH1_INT_ENA_S  3
/* GDMA_IN_ERR_EOF_CH1_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt..*/
#define GDMA_IN_ERR_EOF_CH1_INT_ENA    (BIT(2))
#define GDMA_IN_ERR_EOF_CH1_INT_ENA_M  (BIT(2))
#define GDMA_IN_ERR_EOF_CH1_INT_ENA_V  0x1
#define GDMA_IN_ERR_EOF_CH1_INT_ENA_S  2
/* GDMA_IN_SUC_EOF_CH1_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt..*/
#define GDMA_IN_SUC_EOF_CH1_INT_ENA    (BIT(1))
#define GDMA_IN_SUC_EOF_CH1_INT_ENA_M  (BIT(1))
#define GDMA_IN_SUC_EOF_CH1_INT_ENA_V  0x1
#define GDMA_IN_SUC_EOF_CH1_INT_ENA_S  1
/* GDMA_IN_DONE_CH1_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_DONE_CH_INT interrupt..*/
#define GDMA_IN_DONE_CH1_INT_ENA    (BIT(0))
#define GDMA_IN_DONE_CH1_INT_ENA_M  (BIT(0))
#define GDMA_IN_DONE_CH1_INT_ENA_V  0x1
#define GDMA_IN_DONE_CH1_INT_ENA_S  0

#define GDMA_IN_INT_CLR_CH1_REG          (DR_REG_GDMA_BASE + 0xD4)
/* GDMA_INFIFO_UDF_L3_CH1_INT_CLR : WT ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L3_CH1_INT_CLR    (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH1_INT_CLR_M  (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH1_INT_CLR_V  0x1
#define GDMA_INFIFO_UDF_L3_CH1_INT_CLR_S  9
/* GDMA_INFIFO_OVF_L3_CH1_INT_CLR : WT ;bitpos:[8] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L3_CH1_INT_CLR    (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH1_INT_CLR_M  (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH1_INT_CLR_V  0x1
#define GDMA_INFIFO_OVF_L3_CH1_INT_CLR_S  8
/* GDMA_INFIFO_UDF_L1_CH1_INT_CLR : WT ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L1_CH1_INT_CLR    (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH1_INT_CLR_M  (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH1_INT_CLR_V  0x1
#define GDMA_INFIFO_UDF_L1_CH1_INT_CLR_S  7
/* GDMA_INFIFO_OVF_L1_CH1_INT_CLR : WT ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L1_CH1_INT_CLR    (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH1_INT_CLR_M  (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH1_INT_CLR_V  0x1
#define GDMA_INFIFO_OVF_L1_CH1_INT_CLR_S  6
/* GDMA_DMA_INFIFO_FULL_WM_CH1_INT_CLR : WT ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_FULL_WM_CH_INT interrupt..*/
#define GDMA_DMA_INFIFO_FULL_WM_CH1_INT_CLR    (BIT(5))
#define GDMA_DMA_INFIFO_FULL_WM_CH1_INT_CLR_M  (BIT(5))
#define GDMA_DMA_INFIFO_FULL_WM_CH1_INT_CLR_V  0x1
#define GDMA_DMA_INFIFO_FULL_WM_CH1_INT_CLR_S  5
/* GDMA_IN_DSCR_EMPTY_CH1_INT_CLR : WT ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt..*/
#define GDMA_IN_DSCR_EMPTY_CH1_INT_CLR    (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH1_INT_CLR_M  (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH1_INT_CLR_V  0x1
#define GDMA_IN_DSCR_EMPTY_CH1_INT_CLR_S  4
/* GDMA_IN_DSCR_ERR_CH1_INT_CLR : WT ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_IN_DSCR_ERR_CH1_INT_CLR    (BIT(3))
#define GDMA_IN_DSCR_ERR_CH1_INT_CLR_M  (BIT(3))
#define GDMA_IN_DSCR_ERR_CH1_INT_CLR_V  0x1
#define GDMA_IN_DSCR_ERR_CH1_INT_CLR_S  3
/* GDMA_IN_ERR_EOF_CH1_INT_CLR : WT ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_ERR_EOF_CH_INT interrupt..*/
#define GDMA_IN_ERR_EOF_CH1_INT_CLR    (BIT(2))
#define GDMA_IN_ERR_EOF_CH1_INT_CLR_M  (BIT(2))
#define GDMA_IN_ERR_EOF_CH1_INT_CLR_V  0x1
#define GDMA_IN_ERR_EOF_CH1_INT_CLR_S  2
/* GDMA_IN_SUC_EOF_CH1_INT_CLR : WT ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_SUC_EOF_CH_INT interrupt..*/
#define GDMA_IN_SUC_EOF_CH1_INT_CLR    (BIT(1))
#define GDMA_IN_SUC_EOF_CH1_INT_CLR_M  (BIT(1))
#define GDMA_IN_SUC_EOF_CH1_INT_CLR_V  0x1
#define GDMA_IN_SUC_EOF_CH1_INT_CLR_S  1
/* GDMA_IN_DONE_CH1_INT_CLR : WT ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DONE_CH_INT interrupt..*/
#define GDMA_IN_DONE_CH1_INT_CLR    (BIT(0))
#define GDMA_IN_DONE_CH1_INT_CLR_M  (BIT(0))
#define GDMA_IN_DONE_CH1_INT_CLR_V  0x1
#define GDMA_IN_DONE_CH1_INT_CLR_S  0

