espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
#define GDMA_OUT_INT_ST_CH1_REG          (DR_REG_GDMA_BASE + 0x12C)
/* GDMA_OUTFIFO_UDF_L3_CH1_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L3_CH1_INT_ST    (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH1_INT_ST_M  (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH1_INT_ST_V  0x1
#define GDMA_OUTFIFO_UDF_L3_CH1_INT_ST_S  7
/* GDMA_OUTFIFO_OVF_L3_CH1_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L3_CH1_INT_ST    (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH1_INT_ST_M  (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH1_INT_ST_V  0x1
#define GDMA_OUTFIFO_OVF_L3_CH1_INT_ST_S  6
/* GDMA_OUTFIFO_UDF_L1_CH1_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L1_CH1_INT_ST    (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH1_INT_ST_M  (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH1_INT_ST_V  0x1
#define GDMA_OUTFIFO_UDF_L1_CH1_INT_ST_S  5
/* GDMA_OUTFIFO_OVF_L1_CH1_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L1_CH1_INT_ST    (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH1_INT_ST_M  (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH1_INT_ST_V  0x1
#define GDMA_OUTFIFO_OVF_L1_CH1_INT_ST_S  4
/* GDMA_OUT_TOTAL_EOF_CH1_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt..*/
#define GDMA_OUT_TOTAL_EOF_CH1_INT_ST    (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH1_INT_ST_M  (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH1_INT_ST_V  0x1
#define GDMA_OUT_TOTAL_EOF_CH1_INT_ST_S  3
/* GDMA_OUT_DSCR_ERR_CH1_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_OUT_DSCR_ERR_CH1_INT_ST    (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH1_INT_ST_M  (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH1_INT_ST_V  0x1
#define GDMA_OUT_DSCR_ERR_CH1_INT_ST_S  2
/* GDMA_OUT_EOF_CH1_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_EOF_CH_INT interrupt..*/
#define GDMA_OUT_EOF_CH1_INT_ST    (BIT(1))
#define GDMA_OUT_EOF_CH1_INT_ST_M  (BIT(1))
#define GDMA_OUT_EOF_CH1_INT_ST_V  0x1
#define GDMA_OUT_EOF_CH1_INT_ST_S  1
/* GDMA_OUT_DONE_CH1_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DONE_CH_INT interrupt..*/
#define GDMA_OUT_DONE_CH1_INT_ST    (BIT(0))
#define GDMA_OUT_DONE_CH1_INT_ST_M  (BIT(0))
#define GDMA_OUT_DONE_CH1_INT_ST_V  0x1
#define GDMA_OUT_DONE_CH1_INT_ST_S  0

#define GDMA_OUT_INT_ENA_CH1_REG          (DR_REG_GDMA_BASE + 0x130)
/* GDMA_OUTFIFO_UDF_L3_CH1_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L3_CH1_INT_ENA    (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH1_INT_ENA_M  (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH1_INT_ENA_V  0x1
#define GDMA_OUTFIFO_UDF_L3_CH1_INT_ENA_S  7
/* GDMA_OUTFIFO_OVF_L3_CH1_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L3_CH1_INT_ENA    (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH1_INT_ENA_M  (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH1_INT_ENA_V  0x1
#define GDMA_OUTFIFO_OVF_L3_CH1_INT_ENA_S  6
/* GDMA_OUTFIFO_UDF_L1_CH1_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L1_CH1_INT_ENA    (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH1_INT_ENA_M  (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH1_INT_ENA_V  0x1
#define GDMA_OUTFIFO_UDF_L1_CH1_INT_ENA_S  5
/* GDMA_OUTFIFO_OVF_L1_CH1_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L1_CH1_INT_ENA    (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH1_INT_ENA_M  (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH1_INT_ENA_V  0x1
#define GDMA_OUTFIFO_OVF_L1_CH1_INT_ENA_S  4
/* GDMA_OUT_TOTAL_EOF_CH1_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt..*/
#define GDMA_OUT_TOTAL_EOF_CH1_INT_ENA    (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH1_INT_ENA_M  (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH1_INT_ENA_V  0x1
#define GDMA_OUT_TOTAL_EOF_CH1_INT_ENA_S  3
/* GDMA_OUT_DSCR_ERR_CH1_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_OUT_DSCR_ERR_CH1_INT_ENA    (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH1_INT_ENA_M  (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH1_INT_ENA_V  0x1
#define GDMA_OUT_DSCR_ERR_CH1_INT_ENA_S  2
/* GDMA_OUT_EOF_CH1_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_EOF_CH_INT interrupt..*/
#define GDMA_OUT_EOF_CH1_INT_ENA    (BIT(1))
#define GDMA_OUT_EOF_CH1_INT_ENA_M  (BIT(1))
#define GDMA_OUT_EOF_CH1_INT_ENA_V  0x1
#define GDMA_OUT_EOF_CH1_INT_ENA_S  1
/* GDMA_OUT_DONE_CH1_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_DONE_CH_INT interrupt..*/
#define GDMA_OUT_DONE_CH1_INT_ENA    (BIT(0))
#define GDMA_OUT_DONE_CH1_INT_ENA_M  (BIT(0))
#define GDMA_OUT_DONE_CH1_INT_ENA_V  0x1
#define GDMA_OUT_DONE_CH1_INT_ENA_S  0

#define GDMA_OUT_INT_CLR_CH1_REG          (DR_REG_GDMA_BASE + 0x134)
/* GDMA_OUTFIFO_UDF_L3_CH1_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L3_CH1_INT_CLR    (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH1_INT_CLR_M  (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH1_INT_CLR_V  0x1
#define GDMA_OUTFIFO_UDF_L3_CH1_INT_CLR_S  7
/* GDMA_OUTFIFO_OVF_L3_CH1_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L3_CH1_INT_CLR    (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH1_INT_CLR_M  (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH1_INT_CLR_V  0x1
#define GDMA_OUTFIFO_OVF_L3_CH1_INT_CLR_S  6
/* GDMA_OUTFIFO_UDF_L1_CH1_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L1_CH1_INT_CLR    (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH1_INT_CLR_M  (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH1_INT_CLR_V  0x1
#define GDMA_OUTFIFO_UDF_L1_CH1_INT_CLR_S  5
/* GDMA_OUTFIFO_OVF_L1_CH1_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L1_CH1_INT_CLR    (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH1_INT_CLR_M  (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH1_INT_CLR_V  0x1
#define GDMA_OUTFIFO_OVF_L1_CH1_INT_CLR_S  4
/* GDMA_OUT_TOTAL_EOF_CH1_INT_CLR : WT ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt..*/
#define GDMA_OUT_TOTAL_EOF_CH1_INT_CLR    (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH1_INT_CLR_M  (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH1_INT_CLR_V  0x1
#define GDMA_OUT_TOTAL_EOF_CH1_INT_CLR_S  3
/* GDMA_OUT_DSCR_ERR_CH1_INT_CLR : WT ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_OUT_DSCR_ERR_CH1_INT_CLR    (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH1_INT_CLR_M  (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH1_INT_CLR_V  0x1
#define GDMA_OUT_DSCR_ERR_CH1_INT_CLR_S  2
/* GDMA_OUT_EOF_CH1_INT_CLR : WT ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_EOF_CH_INT interrupt..*/
#define GDMA_OUT_EOF_CH1_INT_CLR    (BIT(1))
#define GDMA_OUT_EOF_CH1_INT_CLR_M  (BIT(1))
#define GDMA_OUT_EOF_CH1_INT_CLR_V  0x1
#define GDMA_OUT_EOF_CH1_INT_CLR_S  1
/* GDMA_OUT_DONE_CH1_INT_CLR : WT ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DONE_CH_INT interrupt..*/
#define GDMA_OUT_DONE_CH1_INT_CLR    (BIT(0))
#define GDMA_OUT_DONE_CH1_INT_CLR_M  (BIT(0))
#define GDMA_OUT_DONE_CH1_INT_CLR_V  0x1
#define GDMA_OUT_DONE_CH1_INT_CLR_S  0

#define GDMA_OUTFIFO_STATUS_CH1_REG          (DR_REG_GDMA_BASE + 0x138)
/* GDMA_OUT_REMAIN_UNDER_4B_L3_CH1 : RO ;bitpos:[26] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_OUT_REMAIN_UNDER_4B_L3_CH1    (BIT(26))
#define GDMA_OUT_REMAIN_UNDER_4B_L3_CH1_M  (BIT(26))
#define GDMA_OUT_REMAIN_UNDER_4B_L3_CH1_V  0x1
#define GDMA_OUT_REMAIN_UNDER_4B_L3_CH1_S  26
/* GDMA_OUT_REMAIN_UNDER_3B_L3_CH1 : RO ;bitpos:[25] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_OUT_REMAIN_UNDER_3B_L3_CH1    (BIT(25))
#define GDMA_OUT_REMAIN_UNDER_3B_L3_CH1_M  (BIT(25))
#define GDMA_OUT_REMAIN_UNDER_3B_L3_CH1_V  0x1
#define GDMA_OUT_REMAIN_UNDER_3B_L3_CH1_S  25
/* GDMA_OUT_REMAIN_UNDER_2B_L3_CH1 : RO ;bitpos:[24] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_OUT_REMAIN_UNDER_2B_L3_CH1    (BIT(24))
#define GDMA_OUT_REMAIN_UNDER_2B_L3_CH1_M  (BIT(24))
#define GDMA_OUT_REMAIN_UNDER_2B_L3_CH1_V  0x1
#define GDMA_OUT_REMAIN_UNDER_2B_L3_CH1_S  24
/* GDMA_OUT_REMAIN_UNDER_1B_L3_CH1 : RO ;bitpos:[23] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_OUT_REMAIN_UNDER_1B_L3_CH1    (BIT(23))
#define GDMA_OUT_REMAIN_UNDER_1B_L3_CH1_M  (BIT(23))
#define GDMA_OUT_REMAIN_UNDER_1B_L3_CH1_V  0x1
#define GDMA_OUT_REMAIN_UNDER_1B_L3_CH1_S  23
/* GDMA_OUTFIFO_CNT_L3_CH1 : RO ;bitpos:[22:18] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L3 Tx FIFO for Tx channel 1..*/
#define GDMA_OUTFIFO_CNT_L3_CH1    0x0000001F
#define GDMA_OUTFIFO_CNT_L3_CH1_M  ((GDMA_OUTFIFO_CNT_L3_CH1_V)<<(GDMA_OUTFIFO_CNT_L3_CH1_S))
#define GDMA_OUTFIFO_CNT_L3_CH1_V  0x1F
#define GDMA_OUTFIFO_CNT_L3_CH1_S  18
/* GDMA_OUTFIFO_CNT_L2_CH1 : RO ;bitpos:[17:11] ;default: 7'b0 ; */
/*description: The register stores the byte number of the data in L2 Tx FIFO for Tx channel 1..*/
#define GDMA_OUTFIFO_CNT_L2_CH1    0x0000007F
#define GDMA_OUTFIFO_CNT_L2_CH1_M  ((GDMA_OUTFIFO_CNT_L2_CH1_V)<<(GDMA_OUTFIFO_CNT_L2_CH1_S))
#define GDMA_OUTFIFO_CNT_L2_CH1_V  0x7F
#define GDMA_OUTFIFO_CNT_L2_CH1_S  11
/* GDMA_OUTFIFO_CNT_L1_CH1 : RO ;bitpos:[10:6] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L1 Tx FIFO for Tx channel 1..*/
#define GDMA_OUTFIFO_CNT_L1_CH1    0x0000001F
#define GDMA_OUTFIFO_CNT_L1_CH1_M  ((GDMA_OUTFIFO_CNT_L1_CH1_V)<<(GDMA_OUTFIFO_CNT_L1_CH1_S))
#define GDMA_OUTFIFO_CNT_L1_CH1_V  0x1F
#define GDMA_OUTFIFO_CNT_L1_CH1_S  6
/* GDMA_OUTFIFO_EMPTY_L3_CH1 : RO ;bitpos:[5] ;default: 1'b1 ; */
/*description: L3 Tx FIFO empty signal for Tx channel 1..*/
#define GDMA_OUTFIFO_EMPTY_L3_CH1    (BIT(5))
#define GDMA_OUTFIFO_EMPTY_L3_CH1_M  (BIT(5))
#define GDMA_OUTFIFO_EMPTY_L3_CH1_V  0x1
#define GDMA_OUTFIFO_EMPTY_L3_CH1_S  5
/* GDMA_OUTFIFO_FULL_L3_CH1 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: L3 Tx FIFO full signal for Tx channel 1..*/
#define GDMA_OUTFIFO_FULL_L3_CH1    (BIT(4))
#define GDMA_OUTFIFO_FULL_L3_CH1_M  (BIT(4))
#define GDMA_OUTFIFO_FULL_L3_CH1_V  0x1
#define GDMA_OUTFIFO_FULL_L3_CH1_S  4
/* GDMA_OUTFIFO_EMPTY_L2_CH1 : RO ;bitpos:[3] ;default: 1'b1 ; */
/*description: L2 Tx FIFO empty signal for Tx channel 1..*/
#define GDMA_OUTFIFO_EMPTY_L2_CH1    (BIT(3))
#define GDMA_OUTFIFO_EMPTY_L2_CH1_M  (BIT(3))
#define GDMA_OUTFIFO_EMPTY_L2_CH1_V  0x1
#define GDMA_OUTFIFO_EMPTY_L2_CH1_S  3
/* GDMA_OUTFIFO_FULL_L2_CH1 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: L2 Tx FIFO full signal for Tx channel 1..*/
#define GDMA_OUTFIFO_FULL_L2_CH1    (BIT(2))
#define GDMA_OUTFIFO_FULL_L2_CH1_M  (BIT(2))
#define GDMA_OUTFIFO_FULL_L2_CH1_V  0x1
#define GDMA_OUTFIFO_FULL_L2_CH1_S  2
/* GDMA_OUTFIFO_EMPTY_L1_CH1 : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: L1 Tx FIFO empty signal for Tx channel 1..*/
#define GDMA_OUTFIFO_EMPTY_L1_CH1    (BIT(1))
#define GDMA_OUTFIFO_EMPTY_L1_CH1_M  (BIT(1))
#define GDMA_OUTFIFO_EMPTY_L1_CH1_V  0x1
#define GDMA_OUTFIFO_EMPTY_L1_CH1_S  1
/* GDMA_OUTFIFO_FULL_L1_CH1 : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: L1 Tx FIFO full signal for Tx channel 1..*/
#define GDMA_OUTFIFO_FULL_L1_CH1    (BIT(0))
#define GDMA_OUTFIFO_FULL_L1_CH1_M  (BIT(0))
#define GDMA_OUTFIFO_FULL_L1_CH1_V  0x1
#define GDMA_OUTFIFO_FULL_L1_CH1_S  0

#define GDMA_OUT_PUSH_CH1_REG          (DR_REG_GDMA_BASE + 0x13C)
/* GDMA_OUTFIFO_PUSH_CH1 : R/W/SC ;bitpos:[9] ;default: 1'h0 ; */
/*description: Set this bit to push data into DMA FIFO..*/
#define GDMA_OUTFIFO_PUSH_CH1    (BIT(9))
#define GDMA_OUTFIFO_PUSH_CH1_M  (BIT(9))
#define GDMA_OUTFIFO_PUSH_CH1_V  0x1
#define GDMA_OUTFIFO_PUSH_CH1_S  9
/* GDMA_OUTFIFO_WDATA_CH1 : R/W ;bitpos:[8:0] ;default: 9'h0 ; */
/*description: This register stores the data that need to be pushed into DMA FIFO..*/
#define GDMA_OUTFIFO_WDATA_CH1    0x000001FF
#define GDMA_OUTFIFO_WDATA_CH1_M  ((GDMA_OUTFIFO_WDATA_CH1_V)<<(GDMA_OUTFIFO_WDATA_CH1_S))
#define GDMA_OUTFIFO_WDATA_CH1_V  0x1FF
#define GDMA_OUTFIFO_WDATA_CH1_S  0

#define GDMA_OUT_LINK_CH1_REG          (DR_REG_GDMA_BASE + 0x140)
/* GDMA_OUTLINK_PARK_CH1 : RO ;bitpos:[23] ;default: 1'h1 ; */
/*description: 1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's F
SM is working..*/
#define GDMA_OUTLINK_PARK_CH1    (BIT(23))
#define GDMA_OUTLINK_PARK_CH1_M  (BIT(23))
#define GDMA_OUTLINK_PARK_CH1_V  0x1
#define GDMA_OUTLINK_PARK_CH1_S  23
/* GDMA_OUTLINK_RESTART_CH1 : R/W/SC ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this bit to restart a new outlink from the last address. .*/
#define GDMA_OUTLINK_RESTART_CH1    (BIT(22))
#define GDMA_OUTLINK_RESTART_CH1_M  (BIT(22))
#define GDMA_OUTLINK_RESTART_CH1_V  0x1
#define GDMA_OUTLINK_RESTART_CH1_S  22
/* GDMA_OUTLINK_START_CH1 : R/W/SC ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this bit to start dealing with the outlink descriptors..*/
#define GDMA_OUTLINK_START_CH1    (BIT(21))
#define GDMA_OUTLINK_START_CH1_M  (BIT(21))
#define GDMA_OUTLINK_START_CH1_V  0x1
#define GDMA_OUTLINK_START_CH1_S  21
/* GDMA_OUTLINK_STOP_CH1 : R/W/SC ;bitpos:[20] ;default: 1'b0 ; */
/*description: Set this bit to stop dealing with the outlink descriptors..*/
#define GDMA_OUTLINK_STOP_CH1    (BIT(20))
#define GDMA_OUTLINK_STOP_CH1_M  (BIT(20))
#define GDMA_OUTLINK_STOP_CH1_V  0x1
#define GDMA_OUTLINK_STOP_CH1_S  20
/* GDMA_OUTLINK_ADDR_CH1 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: This register stores the 20 least significant bits of the first outlink descript
or's address..*/
#define GDMA_OUTLINK_ADDR_CH1    0x000FFFFF
#define GDMA_OUTLINK_ADDR_CH1_M  ((GDMA_OUTLINK_ADDR_CH1_V)<<(GDMA_OUTLINK_ADDR_CH1_S))
#define GDMA_OUTLINK_ADDR_CH1_V  0xFFFFF
#define GDMA_OUTLINK_ADDR_CH1_S  0

