espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
#define GDMA_IN_INT_ENA_CH2_REG          (DR_REG_GDMA_BASE + 0x190)
/* GDMA_INFIFO_UDF_L3_CH2_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L3_CH2_INT_ENA    (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH2_INT_ENA_M  (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH2_INT_ENA_V  0x1
#define GDMA_INFIFO_UDF_L3_CH2_INT_ENA_S  9
/* GDMA_INFIFO_OVF_L3_CH2_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L3_CH2_INT_ENA    (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH2_INT_ENA_M  (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH2_INT_ENA_V  0x1
#define GDMA_INFIFO_OVF_L3_CH2_INT_ENA_S  8
/* GDMA_INFIFO_UDF_L1_CH2_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L1_CH2_INT_ENA    (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH2_INT_ENA_M  (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH2_INT_ENA_V  0x1
#define GDMA_INFIFO_UDF_L1_CH2_INT_ENA_S  7
/* GDMA_INFIFO_OVF_L1_CH2_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L1_CH2_INT_ENA    (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH2_INT_ENA_M  (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH2_INT_ENA_V  0x1
#define GDMA_INFIFO_OVF_L1_CH2_INT_ENA_S  6
/* GDMA_INFIFO_FULL_WM_CH2_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_FULL_WM_CH_INT interrupt..*/
#define GDMA_INFIFO_FULL_WM_CH2_INT_ENA    (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH2_INT_ENA_M  (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH2_INT_ENA_V  0x1
#define GDMA_INFIFO_FULL_WM_CH2_INT_ENA_S  5
/* GDMA_IN_DSCR_EMPTY_CH2_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt..*/
#define GDMA_IN_DSCR_EMPTY_CH2_INT_ENA    (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH2_INT_ENA_M  (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH2_INT_ENA_V  0x1
#define GDMA_IN_DSCR_EMPTY_CH2_INT_ENA_S  4
/* GDMA_IN_DSCR_ERR_CH2_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_IN_DSCR_ERR_CH2_INT_ENA    (BIT(3))
#define GDMA_IN_DSCR_ERR_CH2_INT_ENA_M  (BIT(3))
#define GDMA_IN_DSCR_ERR_CH2_INT_ENA_V  0x1
#define GDMA_IN_DSCR_ERR_CH2_INT_ENA_S  3
/* GDMA_IN_ERR_EOF_CH2_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt..*/
#define GDMA_IN_ERR_EOF_CH2_INT_ENA    (BIT(2))
#define GDMA_IN_ERR_EOF_CH2_INT_ENA_M  (BIT(2))
#define GDMA_IN_ERR_EOF_CH2_INT_ENA_V  0x1
#define GDMA_IN_ERR_EOF_CH2_INT_ENA_S  2
/* GDMA_IN_SUC_EOF_CH2_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt..*/
#define GDMA_IN_SUC_EOF_CH2_INT_ENA    (BIT(1))
#define GDMA_IN_SUC_EOF_CH2_INT_ENA_M  (BIT(1))
#define GDMA_IN_SUC_EOF_CH2_INT_ENA_V  0x1
#define GDMA_IN_SUC_EOF_CH2_INT_ENA_S  1
/* GDMA_IN_DONE_CH2_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_DONE_CH_INT interrupt..*/
#define GDMA_IN_DONE_CH2_INT_ENA    (BIT(0))
#define GDMA_IN_DONE_CH2_INT_ENA_M  (BIT(0))
#define GDMA_IN_DONE_CH2_INT_ENA_V  0x1
#define GDMA_IN_DONE_CH2_INT_ENA_S  0

#define GDMA_IN_INT_CLR_CH2_REG          (DR_REG_GDMA_BASE + 0x194)
/* GDMA_INFIFO_UDF_L3_CH2_INT_CLR : WT ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L3_CH2_INT_CLR    (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH2_INT_CLR_M  (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH2_INT_CLR_V  0x1
#define GDMA_INFIFO_UDF_L3_CH2_INT_CLR_S  9
/* GDMA_INFIFO_OVF_L3_CH2_INT_CLR : WT ;bitpos:[8] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L3_CH2_INT_CLR    (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH2_INT_CLR_M  (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH2_INT_CLR_V  0x1
#define GDMA_INFIFO_OVF_L3_CH2_INT_CLR_S  8
/* GDMA_INFIFO_UDF_L1_CH2_INT_CLR : WT ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L1_CH2_INT_CLR    (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH2_INT_CLR_M  (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH2_INT_CLR_V  0x1
#define GDMA_INFIFO_UDF_L1_CH2_INT_CLR_S  7
/* GDMA_INFIFO_OVF_L1_CH2_INT_CLR : WT ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L1_CH2_INT_CLR    (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH2_INT_CLR_M  (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH2_INT_CLR_V  0x1
#define GDMA_INFIFO_OVF_L1_CH2_INT_CLR_S  6
/* GDMA_DMA_INFIFO_FULL_WM_CH2_INT_CLR : WT ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_FULL_WM_CH_INT interrupt..*/
#define GDMA_DMA_INFIFO_FULL_WM_CH2_INT_CLR    (BIT(5))
#define GDMA_DMA_INFIFO_FULL_WM_CH2_INT_CLR_M  (BIT(5))
#define GDMA_DMA_INFIFO_FULL_WM_CH2_INT_CLR_V  0x1
#define GDMA_DMA_INFIFO_FULL_WM_CH2_INT_CLR_S  5
/* GDMA_IN_DSCR_EMPTY_CH2_INT_CLR : WT ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt..*/
#define GDMA_IN_DSCR_EMPTY_CH2_INT_CLR    (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH2_INT_CLR_M  (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH2_INT_CLR_V  0x1
#define GDMA_IN_DSCR_EMPTY_CH2_INT_CLR_S  4
/* GDMA_IN_DSCR_ERR_CH2_INT_CLR : WT ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_IN_DSCR_ERR_CH2_INT_CLR    (BIT(3))
#define GDMA_IN_DSCR_ERR_CH2_INT_CLR_M  (BIT(3))
#define GDMA_IN_DSCR_ERR_CH2_INT_CLR_V  0x1
#define GDMA_IN_DSCR_ERR_CH2_INT_CLR_S  3
/* GDMA_IN_ERR_EOF_CH2_INT_CLR : WT ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_ERR_EOF_CH_INT interrupt..*/
#define GDMA_IN_ERR_EOF_CH2_INT_CLR    (BIT(2))
#define GDMA_IN_ERR_EOF_CH2_INT_CLR_M  (BIT(2))
#define GDMA_IN_ERR_EOF_CH2_INT_CLR_V  0x1
#define GDMA_IN_ERR_EOF_CH2_INT_CLR_S  2
/* GDMA_IN_SUC_EOF_CH2_INT_CLR : WT ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_SUC_EOF_CH_INT interrupt..*/
#define GDMA_IN_SUC_EOF_CH2_INT_CLR    (BIT(1))
#define GDMA_IN_SUC_EOF_CH2_INT_CLR_M  (BIT(1))
#define GDMA_IN_SUC_EOF_CH2_INT_CLR_V  0x1
#define GDMA_IN_SUC_EOF_CH2_INT_CLR_S  1
/* GDMA_IN_DONE_CH2_INT_CLR : WT ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DONE_CH_INT interrupt..*/
#define GDMA_IN_DONE_CH2_INT_CLR    (BIT(0))
#define GDMA_IN_DONE_CH2_INT_CLR_M  (BIT(0))
#define GDMA_IN_DONE_CH2_INT_CLR_V  0x1
#define GDMA_IN_DONE_CH2_INT_CLR_S  0

#define GDMA_INFIFO_STATUS_CH2_REG          (DR_REG_GDMA_BASE + 0x198)
/* GDMA_IN_BUF_HUNGRY_CH2 : RO ;bitpos:[28] ;default: 1'b0 ; */
/*description: reserved.*/
#define GDMA_IN_BUF_HUNGRY_CH2    (BIT(28))
#define GDMA_IN_BUF_HUNGRY_CH2_M  (BIT(28))
#define GDMA_IN_BUF_HUNGRY_CH2_V  0x1
#define GDMA_IN_BUF_HUNGRY_CH2_S  28
/* GDMA_IN_REMAIN_UNDER_4B_L3_CH2 : RO ;bitpos:[27] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_IN_REMAIN_UNDER_4B_L3_CH2    (BIT(27))
#define GDMA_IN_REMAIN_UNDER_4B_L3_CH2_M  (BIT(27))
#define GDMA_IN_REMAIN_UNDER_4B_L3_CH2_V  0x1
#define GDMA_IN_REMAIN_UNDER_4B_L3_CH2_S  27
/* GDMA_IN_REMAIN_UNDER_3B_L3_CH2 : RO ;bitpos:[26] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_IN_REMAIN_UNDER_3B_L3_CH2    (BIT(26))
#define GDMA_IN_REMAIN_UNDER_3B_L3_CH2_M  (BIT(26))
#define GDMA_IN_REMAIN_UNDER_3B_L3_CH2_V  0x1
#define GDMA_IN_REMAIN_UNDER_3B_L3_CH2_S  26
/* GDMA_IN_REMAIN_UNDER_2B_L3_CH2 : RO ;bitpos:[25] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_IN_REMAIN_UNDER_2B_L3_CH2    (BIT(25))
#define GDMA_IN_REMAIN_UNDER_2B_L3_CH2_M  (BIT(25))
#define GDMA_IN_REMAIN_UNDER_2B_L3_CH2_V  0x1
#define GDMA_IN_REMAIN_UNDER_2B_L3_CH2_S  25
/* GDMA_IN_REMAIN_UNDER_1B_L3_CH2 : RO ;bitpos:[24] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_IN_REMAIN_UNDER_1B_L3_CH2    (BIT(24))
#define GDMA_IN_REMAIN_UNDER_1B_L3_CH2_M  (BIT(24))
#define GDMA_IN_REMAIN_UNDER_1B_L3_CH2_V  0x1
#define GDMA_IN_REMAIN_UNDER_1B_L3_CH2_S  24
/* GDMA_INFIFO_CNT_L3_CH2 : RO ;bitpos:[23:19] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L3 Rx FIFO for Rx channel 2..*/
#define GDMA_INFIFO_CNT_L3_CH2    0x0000001F
#define GDMA_INFIFO_CNT_L3_CH2_M  ((GDMA_INFIFO_CNT_L3_CH2_V)<<(GDMA_INFIFO_CNT_L3_CH2_S))
#define GDMA_INFIFO_CNT_L3_CH2_V  0x1F
#define GDMA_INFIFO_CNT_L3_CH2_S  19
/* GDMA_INFIFO_CNT_L2_CH2 : RO ;bitpos:[18:12] ;default: 7'b0 ; */
/*description: The register stores the byte number of the data in L2 Rx FIFO for Rx channel 2..*/
#define GDMA_INFIFO_CNT_L2_CH2    0x0000007F
#define GDMA_INFIFO_CNT_L2_CH2_M  ((GDMA_INFIFO_CNT_L2_CH2_V)<<(GDMA_INFIFO_CNT_L2_CH2_S))
#define GDMA_INFIFO_CNT_L2_CH2_V  0x7F
#define GDMA_INFIFO_CNT_L2_CH2_S  12
/* GDMA_INFIFO_CNT_L1_CH2 : RO ;bitpos:[11:6] ;default: 6'b0 ; */
/*description: The register stores the byte number of the data in L1 Rx FIFO for Rx channel 2..*/
#define GDMA_INFIFO_CNT_L1_CH2    0x0000003F
#define GDMA_INFIFO_CNT_L1_CH2_M  ((GDMA_INFIFO_CNT_L1_CH2_V)<<(GDMA_INFIFO_CNT_L1_CH2_S))
#define GDMA_INFIFO_CNT_L1_CH2_V  0x3F
#define GDMA_INFIFO_CNT_L1_CH2_S  6
/* GDMA_INFIFO_EMPTY_L3_CH2 : RO ;bitpos:[5] ;default: 1'b1 ; */
/*description: L3 Rx FIFO empty signal for Rx channel 2..*/
#define GDMA_INFIFO_EMPTY_L3_CH2    (BIT(5))
#define GDMA_INFIFO_EMPTY_L3_CH2_M  (BIT(5))
#define GDMA_INFIFO_EMPTY_L3_CH2_V  0x1
#define GDMA_INFIFO_EMPTY_L3_CH2_S  5
/* GDMA_INFIFO_FULL_L3_CH2 : RO ;bitpos:[4] ;default: 1'b1 ; */
/*description: L3 Rx FIFO full signal for Rx channel 2..*/
#define GDMA_INFIFO_FULL_L3_CH2    (BIT(4))
#define GDMA_INFIFO_FULL_L3_CH2_M  (BIT(4))
#define GDMA_INFIFO_FULL_L3_CH2_V  0x1
#define GDMA_INFIFO_FULL_L3_CH2_S  4
/* GDMA_INFIFO_EMPTY_L2_CH2 : RO ;bitpos:[3] ;default: 1'b1 ; */
/*description: L2 Rx FIFO empty signal for Rx channel 2..*/
#define GDMA_INFIFO_EMPTY_L2_CH2    (BIT(3))
#define GDMA_INFIFO_EMPTY_L2_CH2_M  (BIT(3))
#define GDMA_INFIFO_EMPTY_L2_CH2_V  0x1
#define GDMA_INFIFO_EMPTY_L2_CH2_S  3
/* GDMA_INFIFO_FULL_L2_CH2 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: L2 Rx FIFO full signal for Rx channel 2..*/
#define GDMA_INFIFO_FULL_L2_CH2    (BIT(2))
#define GDMA_INFIFO_FULL_L2_CH2_M  (BIT(2))
#define GDMA_INFIFO_FULL_L2_CH2_V  0x1
#define GDMA_INFIFO_FULL_L2_CH2_S  2
/* GDMA_INFIFO_EMPTY_L1_CH2 : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: L1 Rx FIFO empty signal for Rx channel 2..*/
#define GDMA_INFIFO_EMPTY_L1_CH2    (BIT(1))
#define GDMA_INFIFO_EMPTY_L1_CH2_M  (BIT(1))
#define GDMA_INFIFO_EMPTY_L1_CH2_V  0x1
#define GDMA_INFIFO_EMPTY_L1_CH2_S  1
/* GDMA_INFIFO_FULL_L1_CH2 : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: L1 Rx FIFO full signal for Rx channel 2..*/
#define GDMA_INFIFO_FULL_L1_CH2    (BIT(0))
#define GDMA_INFIFO_FULL_L1_CH2_M  (BIT(0))
#define GDMA_INFIFO_FULL_L1_CH2_V  0x1
#define GDMA_INFIFO_FULL_L1_CH2_S  0

