espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
#define GDMA_IN_POP_CH2_REG          (DR_REG_GDMA_BASE + 0x19C)
/* GDMA_INFIFO_POP_CH2 : R/W/SC ;bitpos:[12] ;default: 1'h0 ; */
/*description: Set this bit to pop data from DMA FIFO..*/
#define GDMA_INFIFO_POP_CH2    (BIT(12))
#define GDMA_INFIFO_POP_CH2_M  (BIT(12))
#define GDMA_INFIFO_POP_CH2_V  0x1
#define GDMA_INFIFO_POP_CH2_S  12
/* GDMA_INFIFO_RDATA_CH2 : RO ;bitpos:[11:0] ;default: 12'h800 ; */
/*description: This register stores the data popping from DMA FIFO..*/
#define GDMA_INFIFO_RDATA_CH2    0x00000FFF
#define GDMA_INFIFO_RDATA_CH2_M  ((GDMA_INFIFO_RDATA_CH2_V)<<(GDMA_INFIFO_RDATA_CH2_S))
#define GDMA_INFIFO_RDATA_CH2_V  0xFFF
#define GDMA_INFIFO_RDATA_CH2_S  0

#define GDMA_IN_LINK_CH2_REG          (DR_REG_GDMA_BASE + 0x1A0)
/* GDMA_INLINK_PARK_CH2 : RO ;bitpos:[24] ;default: 1'h1 ; */
/*description: 1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM
 is working..*/
#define GDMA_INLINK_PARK_CH2    (BIT(24))
#define GDMA_INLINK_PARK_CH2_M  (BIT(24))
#define GDMA_INLINK_PARK_CH2_V  0x1
#define GDMA_INLINK_PARK_CH2_S  24
/* GDMA_INLINK_RESTART_CH2 : R/W/SC ;bitpos:[23] ;default: 1'b0 ; */
/*description: Set this bit to mount a new inlink descriptor..*/
#define GDMA_INLINK_RESTART_CH2    (BIT(23))
#define GDMA_INLINK_RESTART_CH2_M  (BIT(23))
#define GDMA_INLINK_RESTART_CH2_V  0x1
#define GDMA_INLINK_RESTART_CH2_S  23
/* GDMA_INLINK_START_CH2 : R/W/SC ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this bit to start dealing with the inlink descriptors..*/
#define GDMA_INLINK_START_CH2    (BIT(22))
#define GDMA_INLINK_START_CH2_M  (BIT(22))
#define GDMA_INLINK_START_CH2_V  0x1
#define GDMA_INLINK_START_CH2_S  22
/* GDMA_INLINK_STOP_CH2 : R/W/SC ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this bit to stop dealing with the inlink descriptors..*/
#define GDMA_INLINK_STOP_CH2    (BIT(21))
#define GDMA_INLINK_STOP_CH2_M  (BIT(21))
#define GDMA_INLINK_STOP_CH2_V  0x1
#define GDMA_INLINK_STOP_CH2_S  21
/* GDMA_INLINK_AUTO_RET_CH2 : R/W ;bitpos:[20] ;default: 1'b1 ; */
/*description: Set this bit to return to current inlink descriptor's address, when there are so
me errors in current receiving data..*/
#define GDMA_INLINK_AUTO_RET_CH2    (BIT(20))
#define GDMA_INLINK_AUTO_RET_CH2_M  (BIT(20))
#define GDMA_INLINK_AUTO_RET_CH2_V  0x1
#define GDMA_INLINK_AUTO_RET_CH2_S  20
/* GDMA_INLINK_ADDR_CH2 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: This register stores the 20 least significant bits of the first inlink descripto
r's address..*/
#define GDMA_INLINK_ADDR_CH2    0x000FFFFF
#define GDMA_INLINK_ADDR_CH2_M  ((GDMA_INLINK_ADDR_CH2_V)<<(GDMA_INLINK_ADDR_CH2_S))
#define GDMA_INLINK_ADDR_CH2_V  0xFFFFF
#define GDMA_INLINK_ADDR_CH2_S  0

#define GDMA_IN_STATE_CH2_REG          (DR_REG_GDMA_BASE + 0x1A4)
/* GDMA_IN_STATE_CH2 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved.*/
#define GDMA_IN_STATE_CH2    0x00000007
#define GDMA_IN_STATE_CH2_M  ((GDMA_IN_STATE_CH2_V)<<(GDMA_IN_STATE_CH2_S))
#define GDMA_IN_STATE_CH2_V  0x7
#define GDMA_IN_STATE_CH2_S  20
/* GDMA_IN_DSCR_STATE_CH2 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved.*/
#define GDMA_IN_DSCR_STATE_CH2    0x00000003
#define GDMA_IN_DSCR_STATE_CH2_M  ((GDMA_IN_DSCR_STATE_CH2_V)<<(GDMA_IN_DSCR_STATE_CH2_S))
#define GDMA_IN_DSCR_STATE_CH2_V  0x3
#define GDMA_IN_DSCR_STATE_CH2_S  18
/* GDMA_INLINK_DSCR_ADDR_CH2 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current inlink descriptor's address..*/
#define GDMA_INLINK_DSCR_ADDR_CH2    0x0003FFFF
#define GDMA_INLINK_DSCR_ADDR_CH2_M  ((GDMA_INLINK_DSCR_ADDR_CH2_V)<<(GDMA_INLINK_DSCR_ADDR_CH2_S))
#define GDMA_INLINK_DSCR_ADDR_CH2_V  0x3FFFF
#define GDMA_INLINK_DSCR_ADDR_CH2_S  0

#define GDMA_IN_SUC_EOF_DES_ADDR_CH2_REG          (DR_REG_GDMA_BASE + 0x1A8)
/* GDMA_IN_SUC_EOF_DES_ADDR_CH2 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when the EOF bit in th
is descriptor is 1..*/
#define GDMA_IN_SUC_EOF_DES_ADDR_CH2    0xFFFFFFFF
#define GDMA_IN_SUC_EOF_DES_ADDR_CH2_M  ((GDMA_IN_SUC_EOF_DES_ADDR_CH2_V)<<(GDMA_IN_SUC_EOF_DES_ADDR_CH2_S))
#define GDMA_IN_SUC_EOF_DES_ADDR_CH2_V  0xFFFFFFFF
#define GDMA_IN_SUC_EOF_DES_ADDR_CH2_S  0

#define GDMA_IN_ERR_EOF_DES_ADDR_CH2_REG          (DR_REG_GDMA_BASE + 0x1AC)
/* GDMA_IN_ERR_EOF_DES_ADDR_CH2 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when there are some er
rors in current receiving data. Only used when peripheral is UHCI0..*/
#define GDMA_IN_ERR_EOF_DES_ADDR_CH2    0xFFFFFFFF
#define GDMA_IN_ERR_EOF_DES_ADDR_CH2_M  ((GDMA_IN_ERR_EOF_DES_ADDR_CH2_V)<<(GDMA_IN_ERR_EOF_DES_ADDR_CH2_S))
#define GDMA_IN_ERR_EOF_DES_ADDR_CH2_V  0xFFFFFFFF
#define GDMA_IN_ERR_EOF_DES_ADDR_CH2_S  0

#define GDMA_IN_DSCR_CH2_REG          (DR_REG_GDMA_BASE + 0x1B0)
/* GDMA_INLINK_DSCR_CH2 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current inlink descriptor x..*/
#define GDMA_INLINK_DSCR_CH2    0xFFFFFFFF
#define GDMA_INLINK_DSCR_CH2_M  ((GDMA_INLINK_DSCR_CH2_V)<<(GDMA_INLINK_DSCR_CH2_S))
#define GDMA_INLINK_DSCR_CH2_V  0xFFFFFFFF
#define GDMA_INLINK_DSCR_CH2_S  0

#define GDMA_IN_DSCR_BF0_CH2_REG          (DR_REG_GDMA_BASE + 0x1B4)
/* GDMA_INLINK_DSCR_BF0_CH2 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last inlink descriptor x-1..*/
#define GDMA_INLINK_DSCR_BF0_CH2    0xFFFFFFFF
#define GDMA_INLINK_DSCR_BF0_CH2_M  ((GDMA_INLINK_DSCR_BF0_CH2_V)<<(GDMA_INLINK_DSCR_BF0_CH2_S))
#define GDMA_INLINK_DSCR_BF0_CH2_V  0xFFFFFFFF
#define GDMA_INLINK_DSCR_BF0_CH2_S  0

#define GDMA_IN_DSCR_BF1_CH2_REG          (DR_REG_GDMA_BASE + 0x1B8)
/* GDMA_INLINK_DSCR_BF1_CH2 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2..*/
#define GDMA_INLINK_DSCR_BF1_CH2    0xFFFFFFFF
#define GDMA_INLINK_DSCR_BF1_CH2_M  ((GDMA_INLINK_DSCR_BF1_CH2_V)<<(GDMA_INLINK_DSCR_BF1_CH2_S))
#define GDMA_INLINK_DSCR_BF1_CH2_V  0xFFFFFFFF
#define GDMA_INLINK_DSCR_BF1_CH2_S  0

