espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
#define GDMA_IN_WIGHT_CH2_REG          (DR_REG_GDMA_BASE + 0x1BC)
/* GDMA_RX_WEIGHT_CH2 : R/W ;bitpos:[11:8] ;default: 4'hf ; */
/*description: The weight of Rx channel 2. .*/
#define GDMA_RX_WEIGHT_CH2    0x0000000F
#define GDMA_RX_WEIGHT_CH2_M  ((GDMA_RX_WEIGHT_CH2_V)<<(GDMA_RX_WEIGHT_CH2_S))
#define GDMA_RX_WEIGHT_CH2_V  0xF
#define GDMA_RX_WEIGHT_CH2_S  8

#define GDMA_IN_PRI_CH2_REG          (DR_REG_GDMA_BASE + 0x1C4)
/* GDMA_RX_PRI_CH2 : R/W ;bitpos:[3:0] ;default: 4'b0 ; */
/*description: The priority of Rx channel 2. The larger of the value, the higher of the priorit
y..*/
#define GDMA_RX_PRI_CH2    0x0000000F
#define GDMA_RX_PRI_CH2_M  ((GDMA_RX_PRI_CH2_V)<<(GDMA_RX_PRI_CH2_S))
#define GDMA_RX_PRI_CH2_V  0xF
#define GDMA_RX_PRI_CH2_S  0

#define GDMA_IN_PERI_SEL_CH2_REG          (DR_REG_GDMA_BASE + 0x1C8)
/* GDMA_PERI_IN_SEL_CH2 : R/W ;bitpos:[5:0] ;default: 6'h3f ; */
/*description: This register is used to select peripheral for Rx channel 2. 0:SPI2. 1: SPI3. 2:
 UHCI0. 3: I2S0. 4: I2S1. 5: LCD_CAM. 6: AES. 7: SHA. 8: ADC_DAC. 9: RMT..*/
#define GDMA_PERI_IN_SEL_CH2    0x0000003F
#define GDMA_PERI_IN_SEL_CH2_M  ((GDMA_PERI_IN_SEL_CH2_V)<<(GDMA_PERI_IN_SEL_CH2_S))
#define GDMA_PERI_IN_SEL_CH2_V  0x3F
#define GDMA_PERI_IN_SEL_CH2_S  0

#define GDMA_OUT_CONF0_CH2_REG          (DR_REG_GDMA_BASE + 0x1E0)
/* GDMA_OUT_DATA_BURST_EN_CH2 : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel 2 transmitting da
ta when accessing internal SRAM. .*/
#define GDMA_OUT_DATA_BURST_EN_CH2    (BIT(5))
#define GDMA_OUT_DATA_BURST_EN_CH2_M  (BIT(5))
#define GDMA_OUT_DATA_BURST_EN_CH2_V  0x1
#define GDMA_OUT_DATA_BURST_EN_CH2_S  5
/* GDMA_OUTDSCR_BURST_EN_CH2 : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel 2 reading link de
scriptor when accessing internal SRAM. .*/
#define GDMA_OUTDSCR_BURST_EN_CH2    (BIT(4))
#define GDMA_OUTDSCR_BURST_EN_CH2_M  (BIT(4))
#define GDMA_OUTDSCR_BURST_EN_CH2_V  0x1
#define GDMA_OUTDSCR_BURST_EN_CH2_S  4
/* GDMA_OUT_EOF_MODE_CH2 : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel 0 is
 generated when data need to transmit has been popped from FIFO in DMA.*/
#define GDMA_OUT_EOF_MODE_CH2    (BIT(3))
#define GDMA_OUT_EOF_MODE_CH2_M  (BIT(3))
#define GDMA_OUT_EOF_MODE_CH2_V  0x1
#define GDMA_OUT_EOF_MODE_CH2_S  3
/* GDMA_OUT_AUTO_WRBACK_CH2 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to enable automatic outlink-writeback when all the data in tx buffe
r has been transmitted..*/
#define GDMA_OUT_AUTO_WRBACK_CH2    (BIT(2))
#define GDMA_OUT_AUTO_WRBACK_CH2_M  (BIT(2))
#define GDMA_OUT_AUTO_WRBACK_CH2_V  0x1
#define GDMA_OUT_AUTO_WRBACK_CH2_S  2
/* GDMA_OUT_LOOP_TEST_CH2 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: reserved.*/
#define GDMA_OUT_LOOP_TEST_CH2    (BIT(1))
#define GDMA_OUT_LOOP_TEST_CH2_M  (BIT(1))
#define GDMA_OUT_LOOP_TEST_CH2_V  0x1
#define GDMA_OUT_LOOP_TEST_CH2_S  1
/* GDMA_OUT_RST_CH2 : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: This bit is used to reset DMA channel 2 Tx FSM and Tx FIFO pointer..*/
#define GDMA_OUT_RST_CH2    (BIT(0))
#define GDMA_OUT_RST_CH2_M  (BIT(0))
#define GDMA_OUT_RST_CH2_V  0x1
#define GDMA_OUT_RST_CH2_S  0

#define GDMA_OUT_CONF1_CH2_REG          (DR_REG_GDMA_BASE + 0x1E4)
/* GDMA_OUT_EXT_MEM_BK_SIZE_CH2 : R/W ;bitpos:[14:13] ;default: 2'b0 ; */
/*description: Block size of Tx channel 2 when DMA access external SRAM. 0: 16 bytes      1: 32
 bytes    2/3:reserved.*/
#define GDMA_OUT_EXT_MEM_BK_SIZE_CH2    0x00000003
#define GDMA_OUT_EXT_MEM_BK_SIZE_CH2_M  ((GDMA_OUT_EXT_MEM_BK_SIZE_CH2_V)<<(GDMA_OUT_EXT_MEM_BK_SIZE_CH2_S))
#define GDMA_OUT_EXT_MEM_BK_SIZE_CH2_V  0x3
#define GDMA_OUT_EXT_MEM_BK_SIZE_CH2_S  13
/* GDMA_OUT_CHECK_OWNER_CH2 : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to enable checking the owner attribute of the link descriptor..*/
#define GDMA_OUT_CHECK_OWNER_CH2    (BIT(12))
#define GDMA_OUT_CHECK_OWNER_CH2_M  (BIT(12))
#define GDMA_OUT_CHECK_OWNER_CH2_V  0x1
#define GDMA_OUT_CHECK_OWNER_CH2_S  12

#define GDMA_OUT_INT_RAW_CH2_REG          (DR_REG_GDMA_BASE + 0x1E8)
/* GDMA_OUTFIFO_UDF_L3_CH2_INT_RAW : R/WTC/SS ;bitpos:[7] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo of Tx channel 2 is
underflow. .*/
#define GDMA_OUTFIFO_UDF_L3_CH2_INT_RAW    (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH2_INT_RAW_M  (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH2_INT_RAW_V  0x1
#define GDMA_OUTFIFO_UDF_L3_CH2_INT_RAW_S  7
/* GDMA_OUTFIFO_OVF_L3_CH2_INT_RAW : R/WTC/SS ;bitpos:[6] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo of Tx channel 2 is
overflow. .*/
#define GDMA_OUTFIFO_OVF_L3_CH2_INT_RAW    (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH2_INT_RAW_M  (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH2_INT_RAW_V  0x1
#define GDMA_OUTFIFO_OVF_L3_CH2_INT_RAW_S  6
/* GDMA_OUTFIFO_UDF_L1_CH2_INT_RAW : R/WTC/SS ;bitpos:[5] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo of Tx channel 2 is
underflow. .*/
#define GDMA_OUTFIFO_UDF_L1_CH2_INT_RAW    (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH2_INT_RAW_M  (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH2_INT_RAW_V  0x1
#define GDMA_OUTFIFO_UDF_L1_CH2_INT_RAW_S  5
/* GDMA_OUTFIFO_OVF_L1_CH2_INT_RAW : R/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo of Tx channel 2 is
overflow. .*/
#define GDMA_OUTFIFO_OVF_L1_CH2_INT_RAW    (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH2_INT_RAW_M  (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH2_INT_RAW_V  0x1
#define GDMA_OUTFIFO_OVF_L1_CH2_INT_RAW_S  4
/* GDMA_OUT_TOTAL_EOF_CH2_INT_RAW : R/WTC/SS ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when data corresponding a outlink (inc
ludes one link descriptor or few link descriptors) is transmitted out for Tx cha
nnel 2..*/
#define GDMA_OUT_TOTAL_EOF_CH2_INT_RAW    (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH2_INT_RAW_M  (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH2_INT_RAW_V  0x1
#define GDMA_OUT_TOTAL_EOF_CH2_INT_RAW_S  3
/* GDMA_OUT_DSCR_ERR_CH2_INT_RAW : R/WTC/SS ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when detecting outlink descriptor erro
r, including owner error, the second and third word error of outlink descriptor
for Tx channel 2..*/
#define GDMA_OUT_DSCR_ERR_CH2_INT_RAW    (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH2_INT_RAW_M  (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH2_INT_RAW_V  0x1
#define GDMA_OUT_DSCR_ERR_CH2_INT_RAW_S  2
/* GDMA_OUT_EOF_CH2_INT_RAW : R/WTC/SS ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data pointed by one outl
ink descriptor has been read from memory for Tx channel 2. .*/
#define GDMA_OUT_EOF_CH2_INT_RAW    (BIT(1))
#define GDMA_OUT_EOF_CH2_INT_RAW_M  (BIT(1))
#define GDMA_OUT_EOF_CH2_INT_RAW_V  0x1
#define GDMA_OUT_EOF_CH2_INT_RAW_S  1
/* GDMA_OUT_DONE_CH2_INT_RAW : R/WTC/SS ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data pointed by one outl
ink descriptor has been transmitted to peripherals for Tx channel 2..*/
#define GDMA_OUT_DONE_CH2_INT_RAW    (BIT(0))
#define GDMA_OUT_DONE_CH2_INT_RAW_M  (BIT(0))
#define GDMA_OUT_DONE_CH2_INT_RAW_V  0x1
#define GDMA_OUT_DONE_CH2_INT_RAW_S  0

#define GDMA_OUT_INT_ST_CH2_REG          (DR_REG_GDMA_BASE + 0x1EC)
/* GDMA_OUTFIFO_UDF_L3_CH2_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L3_CH2_INT_ST    (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH2_INT_ST_M  (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH2_INT_ST_V  0x1
#define GDMA_OUTFIFO_UDF_L3_CH2_INT_ST_S  7
/* GDMA_OUTFIFO_OVF_L3_CH2_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L3_CH2_INT_ST    (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH2_INT_ST_M  (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH2_INT_ST_V  0x1
#define GDMA_OUTFIFO_OVF_L3_CH2_INT_ST_S  6
/* GDMA_OUTFIFO_UDF_L1_CH2_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L1_CH2_INT_ST    (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH2_INT_ST_M  (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH2_INT_ST_V  0x1
#define GDMA_OUTFIFO_UDF_L1_CH2_INT_ST_S  5
/* GDMA_OUTFIFO_OVF_L1_CH2_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L1_CH2_INT_ST    (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH2_INT_ST_M  (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH2_INT_ST_V  0x1
#define GDMA_OUTFIFO_OVF_L1_CH2_INT_ST_S  4
/* GDMA_OUT_TOTAL_EOF_CH2_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt..*/
#define GDMA_OUT_TOTAL_EOF_CH2_INT_ST    (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH2_INT_ST_M  (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH2_INT_ST_V  0x1
#define GDMA_OUT_TOTAL_EOF_CH2_INT_ST_S  3
/* GDMA_OUT_DSCR_ERR_CH2_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_OUT_DSCR_ERR_CH2_INT_ST    (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH2_INT_ST_M  (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH2_INT_ST_V  0x1
#define GDMA_OUT_DSCR_ERR_CH2_INT_ST_S  2
/* GDMA_OUT_EOF_CH2_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_EOF_CH_INT interrupt..*/
#define GDMA_OUT_EOF_CH2_INT_ST    (BIT(1))
#define GDMA_OUT_EOF_CH2_INT_ST_M  (BIT(1))
#define GDMA_OUT_EOF_CH2_INT_ST_V  0x1
#define GDMA_OUT_EOF_CH2_INT_ST_S  1
/* GDMA_OUT_DONE_CH2_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DONE_CH_INT interrupt..*/
#define GDMA_OUT_DONE_CH2_INT_ST    (BIT(0))
#define GDMA_OUT_DONE_CH2_INT_ST_M  (BIT(0))
#define GDMA_OUT_DONE_CH2_INT_ST_V  0x1
#define GDMA_OUT_DONE_CH2_INT_ST_S  0

#define GDMA_OUT_INT_ENA_CH2_REG          (DR_REG_GDMA_BASE + 0x1F0)
/* GDMA_OUTFIFO_UDF_L3_CH2_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L3_CH2_INT_ENA    (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH2_INT_ENA_M  (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH2_INT_ENA_V  0x1
#define GDMA_OUTFIFO_UDF_L3_CH2_INT_ENA_S  7
/* GDMA_OUTFIFO_OVF_L3_CH2_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L3_CH2_INT_ENA    (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH2_INT_ENA_M  (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH2_INT_ENA_V  0x1
#define GDMA_OUTFIFO_OVF_L3_CH2_INT_ENA_S  6
/* GDMA_OUTFIFO_UDF_L1_CH2_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L1_CH2_INT_ENA    (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH2_INT_ENA_M  (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH2_INT_ENA_V  0x1
#define GDMA_OUTFIFO_UDF_L1_CH2_INT_ENA_S  5
/* GDMA_OUTFIFO_OVF_L1_CH2_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L1_CH2_INT_ENA    (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH2_INT_ENA_M  (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH2_INT_ENA_V  0x1
#define GDMA_OUTFIFO_OVF_L1_CH2_INT_ENA_S  4
/* GDMA_OUT_TOTAL_EOF_CH2_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt..*/
#define GDMA_OUT_TOTAL_EOF_CH2_INT_ENA    (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH2_INT_ENA_M  (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH2_INT_ENA_V  0x1
#define GDMA_OUT_TOTAL_EOF_CH2_INT_ENA_S  3
/* GDMA_OUT_DSCR_ERR_CH2_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_OUT_DSCR_ERR_CH2_INT_ENA    (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH2_INT_ENA_M  (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH2_INT_ENA_V  0x1
#define GDMA_OUT_DSCR_ERR_CH2_INT_ENA_S  2
/* GDMA_OUT_EOF_CH2_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_EOF_CH_INT interrupt..*/
#define GDMA_OUT_EOF_CH2_INT_ENA    (BIT(1))
#define GDMA_OUT_EOF_CH2_INT_ENA_M  (BIT(1))
#define GDMA_OUT_EOF_CH2_INT_ENA_V  0x1
#define GDMA_OUT_EOF_CH2_INT_ENA_S  1
/* GDMA_OUT_DONE_CH2_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_DONE_CH_INT interrupt..*/
#define GDMA_OUT_DONE_CH2_INT_ENA    (BIT(0))
#define GDMA_OUT_DONE_CH2_INT_ENA_M  (BIT(0))
#define GDMA_OUT_DONE_CH2_INT_ENA_V  0x1
#define GDMA_OUT_DONE_CH2_INT_ENA_S  0

