espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
#define GDMA_INFIFO_STATUS_CH3_REG          (DR_REG_GDMA_BASE + 0x258)
/* GDMA_IN_BUF_HUNGRY_CH3 : RO ;bitpos:[28] ;default: 1'b0 ; */
/*description: reserved.*/
#define GDMA_IN_BUF_HUNGRY_CH3    (BIT(28))
#define GDMA_IN_BUF_HUNGRY_CH3_M  (BIT(28))
#define GDMA_IN_BUF_HUNGRY_CH3_V  0x1
#define GDMA_IN_BUF_HUNGRY_CH3_S  28
/* GDMA_IN_REMAIN_UNDER_4B_L3_CH3 : RO ;bitpos:[27] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_IN_REMAIN_UNDER_4B_L3_CH3    (BIT(27))
#define GDMA_IN_REMAIN_UNDER_4B_L3_CH3_M  (BIT(27))
#define GDMA_IN_REMAIN_UNDER_4B_L3_CH3_V  0x1
#define GDMA_IN_REMAIN_UNDER_4B_L3_CH3_S  27
/* GDMA_IN_REMAIN_UNDER_3B_L3_CH3 : RO ;bitpos:[26] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_IN_REMAIN_UNDER_3B_L3_CH3    (BIT(26))
#define GDMA_IN_REMAIN_UNDER_3B_L3_CH3_M  (BIT(26))
#define GDMA_IN_REMAIN_UNDER_3B_L3_CH3_V  0x1
#define GDMA_IN_REMAIN_UNDER_3B_L3_CH3_S  26
/* GDMA_IN_REMAIN_UNDER_2B_L3_CH3 : RO ;bitpos:[25] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_IN_REMAIN_UNDER_2B_L3_CH3    (BIT(25))
#define GDMA_IN_REMAIN_UNDER_2B_L3_CH3_M  (BIT(25))
#define GDMA_IN_REMAIN_UNDER_2B_L3_CH3_V  0x1
#define GDMA_IN_REMAIN_UNDER_2B_L3_CH3_S  25
/* GDMA_IN_REMAIN_UNDER_1B_L3_CH3 : RO ;bitpos:[24] ;default: 1'b1 ; */
/*description: reserved.*/
#define GDMA_IN_REMAIN_UNDER_1B_L3_CH3    (BIT(24))
#define GDMA_IN_REMAIN_UNDER_1B_L3_CH3_M  (BIT(24))
#define GDMA_IN_REMAIN_UNDER_1B_L3_CH3_V  0x1
#define GDMA_IN_REMAIN_UNDER_1B_L3_CH3_S  24
/* GDMA_INFIFO_CNT_L3_CH3 : RO ;bitpos:[23:19] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L3 Rx FIFO for Rx channel 3..*/
#define GDMA_INFIFO_CNT_L3_CH3    0x0000001F
#define GDMA_INFIFO_CNT_L3_CH3_M  ((GDMA_INFIFO_CNT_L3_CH3_V)<<(GDMA_INFIFO_CNT_L3_CH3_S))
#define GDMA_INFIFO_CNT_L3_CH3_V  0x1F
#define GDMA_INFIFO_CNT_L3_CH3_S  19
/* GDMA_INFIFO_CNT_L2_CH3 : RO ;bitpos:[18:12] ;default: 7'b0 ; */
/*description: The register stores the byte number of the data in L2 Rx FIFO for Rx channel 3..*/
#define GDMA_INFIFO_CNT_L2_CH3    0x0000007F
#define GDMA_INFIFO_CNT_L2_CH3_M  ((GDMA_INFIFO_CNT_L2_CH3_V)<<(GDMA_INFIFO_CNT_L2_CH3_S))
#define GDMA_INFIFO_CNT_L2_CH3_V  0x7F
#define GDMA_INFIFO_CNT_L2_CH3_S  12
/* GDMA_INFIFO_CNT_L1_CH3 : RO ;bitpos:[11:6] ;default: 6'b0 ; */
/*description: The register stores the byte number of the data in L1 Rx FIFO for Rx channel 3..*/
#define GDMA_INFIFO_CNT_L1_CH3    0x0000003F
#define GDMA_INFIFO_CNT_L1_CH3_M  ((GDMA_INFIFO_CNT_L1_CH3_V)<<(GDMA_INFIFO_CNT_L1_CH3_S))
#define GDMA_INFIFO_CNT_L1_CH3_V  0x3F
#define GDMA_INFIFO_CNT_L1_CH3_S  6
/* GDMA_INFIFO_EMPTY_L3_CH3 : RO ;bitpos:[5] ;default: 1'b1 ; */
/*description: L3 Rx FIFO empty signal for Rx channel 3..*/
#define GDMA_INFIFO_EMPTY_L3_CH3    (BIT(5))
#define GDMA_INFIFO_EMPTY_L3_CH3_M  (BIT(5))
#define GDMA_INFIFO_EMPTY_L3_CH3_V  0x1
#define GDMA_INFIFO_EMPTY_L3_CH3_S  5
/* GDMA_INFIFO_FULL_L3_CH3 : RO ;bitpos:[4] ;default: 1'b1 ; */
/*description: L3 Rx FIFO full signal for Rx channel 3..*/
#define GDMA_INFIFO_FULL_L3_CH3    (BIT(4))
#define GDMA_INFIFO_FULL_L3_CH3_M  (BIT(4))
#define GDMA_INFIFO_FULL_L3_CH3_V  0x1
#define GDMA_INFIFO_FULL_L3_CH3_S  4
/* GDMA_INFIFO_EMPTY_L2_CH3 : RO ;bitpos:[3] ;default: 1'b1 ; */
/*description: L2 Rx FIFO empty signal for Rx channel 3..*/
#define GDMA_INFIFO_EMPTY_L2_CH3    (BIT(3))
#define GDMA_INFIFO_EMPTY_L2_CH3_M  (BIT(3))
#define GDMA_INFIFO_EMPTY_L2_CH3_V  0x1
#define GDMA_INFIFO_EMPTY_L2_CH3_S  3
/* GDMA_INFIFO_FULL_L2_CH3 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: L2 Rx FIFO full signal for Rx channel 3..*/
#define GDMA_INFIFO_FULL_L2_CH3    (BIT(2))
#define GDMA_INFIFO_FULL_L2_CH3_M  (BIT(2))
#define GDMA_INFIFO_FULL_L2_CH3_V  0x1
#define GDMA_INFIFO_FULL_L2_CH3_S  2
/* GDMA_INFIFO_EMPTY_L1_CH3 : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: L1 Rx FIFO empty signal for Rx channel 3..*/
#define GDMA_INFIFO_EMPTY_L1_CH3    (BIT(1))
#define GDMA_INFIFO_EMPTY_L1_CH3_M  (BIT(1))
#define GDMA_INFIFO_EMPTY_L1_CH3_V  0x1
#define GDMA_INFIFO_EMPTY_L1_CH3_S  1
/* GDMA_INFIFO_FULL_L1_CH3 : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: L1 Rx FIFO full signal for Rx channel 3..*/
#define GDMA_INFIFO_FULL_L1_CH3    (BIT(0))
#define GDMA_INFIFO_FULL_L1_CH3_M  (BIT(0))
#define GDMA_INFIFO_FULL_L1_CH3_V  0x1
#define GDMA_INFIFO_FULL_L1_CH3_S  0

#define GDMA_IN_POP_CH3_REG          (DR_REG_GDMA_BASE + 0x25C)
/* GDMA_INFIFO_POP_CH3 : R/W/SC ;bitpos:[12] ;default: 1'h0 ; */
/*description: Set this bit to pop data from DMA FIFO..*/
#define GDMA_INFIFO_POP_CH3    (BIT(12))
#define GDMA_INFIFO_POP_CH3_M  (BIT(12))
#define GDMA_INFIFO_POP_CH3_V  0x1
#define GDMA_INFIFO_POP_CH3_S  12
/* GDMA_INFIFO_RDATA_CH3 : RO ;bitpos:[11:0] ;default: 12'h800 ; */
/*description: This register stores the data popping from DMA FIFO..*/
#define GDMA_INFIFO_RDATA_CH3    0x00000FFF
#define GDMA_INFIFO_RDATA_CH3_M  ((GDMA_INFIFO_RDATA_CH3_V)<<(GDMA_INFIFO_RDATA_CH3_S))
#define GDMA_INFIFO_RDATA_CH3_V  0xFFF
#define GDMA_INFIFO_RDATA_CH3_S  0

#define GDMA_IN_LINK_CH3_REG          (DR_REG_GDMA_BASE + 0x260)
/* GDMA_INLINK_PARK_CH3 : RO ;bitpos:[24] ;default: 1'h1 ; */
/*description: 1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM
 is working..*/
#define GDMA_INLINK_PARK_CH3    (BIT(24))
#define GDMA_INLINK_PARK_CH3_M  (BIT(24))
#define GDMA_INLINK_PARK_CH3_V  0x1
#define GDMA_INLINK_PARK_CH3_S  24
/* GDMA_INLINK_RESTART_CH3 : R/W/SC ;bitpos:[23] ;default: 1'b0 ; */
/*description: Set this bit to mount a new inlink descriptor..*/
#define GDMA_INLINK_RESTART_CH3    (BIT(23))
#define GDMA_INLINK_RESTART_CH3_M  (BIT(23))
#define GDMA_INLINK_RESTART_CH3_V  0x1
#define GDMA_INLINK_RESTART_CH3_S  23
/* GDMA_INLINK_START_CH3 : R/W/SC ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this bit to start dealing with the inlink descriptors..*/
#define GDMA_INLINK_START_CH3    (BIT(22))
#define GDMA_INLINK_START_CH3_M  (BIT(22))
#define GDMA_INLINK_START_CH3_V  0x1
#define GDMA_INLINK_START_CH3_S  22
/* GDMA_INLINK_STOP_CH3 : R/W/SC ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this bit to stop dealing with the inlink descriptors..*/
#define GDMA_INLINK_STOP_CH3    (BIT(21))
#define GDMA_INLINK_STOP_CH3_M  (BIT(21))
#define GDMA_INLINK_STOP_CH3_V  0x1
#define GDMA_INLINK_STOP_CH3_S  21
/* GDMA_INLINK_AUTO_RET_CH3 : R/W ;bitpos:[20] ;default: 1'b1 ; */
/*description: Set this bit to return to current inlink descriptor's address, when there are so
me errors in current receiving data..*/
#define GDMA_INLINK_AUTO_RET_CH3    (BIT(20))
#define GDMA_INLINK_AUTO_RET_CH3_M  (BIT(20))
#define GDMA_INLINK_AUTO_RET_CH3_V  0x1
#define GDMA_INLINK_AUTO_RET_CH3_S  20
/* GDMA_INLINK_ADDR_CH3 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: This register stores the 20 least significant bits of the first inlink descripto
r's address..*/
#define GDMA_INLINK_ADDR_CH3    0x000FFFFF
#define GDMA_INLINK_ADDR_CH3_M  ((GDMA_INLINK_ADDR_CH3_V)<<(GDMA_INLINK_ADDR_CH3_S))
#define GDMA_INLINK_ADDR_CH3_V  0xFFFFF
#define GDMA_INLINK_ADDR_CH3_S  0

