espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
#define GDMA_IN_STATE_CH3_REG          (DR_REG_GDMA_BASE + 0x264)
/* GDMA_IN_STATE_CH3 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved.*/
#define GDMA_IN_STATE_CH3    0x00000007
#define GDMA_IN_STATE_CH3_M  ((GDMA_IN_STATE_CH3_V)<<(GDMA_IN_STATE_CH3_S))
#define GDMA_IN_STATE_CH3_V  0x7
#define GDMA_IN_STATE_CH3_S  20
/* GDMA_IN_DSCR_STATE_CH3 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved.*/
#define GDMA_IN_DSCR_STATE_CH3    0x00000003
#define GDMA_IN_DSCR_STATE_CH3_M  ((GDMA_IN_DSCR_STATE_CH3_V)<<(GDMA_IN_DSCR_STATE_CH3_S))
#define GDMA_IN_DSCR_STATE_CH3_V  0x3
#define GDMA_IN_DSCR_STATE_CH3_S  18
/* GDMA_INLINK_DSCR_ADDR_CH3 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current inlink descriptor's address..*/
#define GDMA_INLINK_DSCR_ADDR_CH3    0x0003FFFF
#define GDMA_INLINK_DSCR_ADDR_CH3_M  ((GDMA_INLINK_DSCR_ADDR_CH3_V)<<(GDMA_INLINK_DSCR_ADDR_CH3_S))
#define GDMA_INLINK_DSCR_ADDR_CH3_V  0x3FFFF
#define GDMA_INLINK_DSCR_ADDR_CH3_S  0

#define GDMA_IN_SUC_EOF_DES_ADDR_CH3_REG          (DR_REG_GDMA_BASE + 0x268)
/* GDMA_IN_SUC_EOF_DES_ADDR_CH3 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when the EOF bit in th
is descriptor is 1..*/
#define GDMA_IN_SUC_EOF_DES_ADDR_CH3    0xFFFFFFFF
#define GDMA_IN_SUC_EOF_DES_ADDR_CH3_M  ((GDMA_IN_SUC_EOF_DES_ADDR_CH3_V)<<(GDMA_IN_SUC_EOF_DES_ADDR_CH3_S))
#define GDMA_IN_SUC_EOF_DES_ADDR_CH3_V  0xFFFFFFFF
#define GDMA_IN_SUC_EOF_DES_ADDR_CH3_S  0

#define GDMA_IN_ERR_EOF_DES_ADDR_CH3_REG          (DR_REG_GDMA_BASE + 0x26C)
/* GDMA_IN_ERR_EOF_DES_ADDR_CH3 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when there are some er
rors in current receiving data. Only used when peripheral is UHCI0..*/
#define GDMA_IN_ERR_EOF_DES_ADDR_CH3    0xFFFFFFFF
#define GDMA_IN_ERR_EOF_DES_ADDR_CH3_M  ((GDMA_IN_ERR_EOF_DES_ADDR_CH3_V)<<(GDMA_IN_ERR_EOF_DES_ADDR_CH3_S))
#define GDMA_IN_ERR_EOF_DES_ADDR_CH3_V  0xFFFFFFFF
#define GDMA_IN_ERR_EOF_DES_ADDR_CH3_S  0

#define GDMA_IN_DSCR_CH3_REG          (DR_REG_GDMA_BASE + 0x270)
/* GDMA_INLINK_DSCR_CH3 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current inlink descriptor x..*/
#define GDMA_INLINK_DSCR_CH3    0xFFFFFFFF
#define GDMA_INLINK_DSCR_CH3_M  ((GDMA_INLINK_DSCR_CH3_V)<<(GDMA_INLINK_DSCR_CH3_S))
#define GDMA_INLINK_DSCR_CH3_V  0xFFFFFFFF
#define GDMA_INLINK_DSCR_CH3_S  0

#define GDMA_IN_DSCR_BF0_CH3_REG          (DR_REG_GDMA_BASE + 0x274)
/* GDMA_INLINK_DSCR_BF0_CH3 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last inlink descriptor x-1..*/
#define GDMA_INLINK_DSCR_BF0_CH3    0xFFFFFFFF
#define GDMA_INLINK_DSCR_BF0_CH3_M  ((GDMA_INLINK_DSCR_BF0_CH3_V)<<(GDMA_INLINK_DSCR_BF0_CH3_S))
#define GDMA_INLINK_DSCR_BF0_CH3_V  0xFFFFFFFF
#define GDMA_INLINK_DSCR_BF0_CH3_S  0

#define GDMA_IN_DSCR_BF1_CH3_REG          (DR_REG_GDMA_BASE + 0x278)
/* GDMA_INLINK_DSCR_BF1_CH3 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2..*/
#define GDMA_INLINK_DSCR_BF1_CH3    0xFFFFFFFF
#define GDMA_INLINK_DSCR_BF1_CH3_M  ((GDMA_INLINK_DSCR_BF1_CH3_V)<<(GDMA_INLINK_DSCR_BF1_CH3_S))
#define GDMA_INLINK_DSCR_BF1_CH3_V  0xFFFFFFFF
#define GDMA_INLINK_DSCR_BF1_CH3_S  0

#define GDMA_IN_WIGHT_CH3_REG          (DR_REG_GDMA_BASE + 0x27C)
/* GDMA_RX_WEIGHT_CH3 : R/W ;bitpos:[11:8] ;default: 4'hf ; */
/*description: The weight of Rx channel 3. .*/
#define GDMA_RX_WEIGHT_CH3    0x0000000F
#define GDMA_RX_WEIGHT_CH3_M  ((GDMA_RX_WEIGHT_CH3_V)<<(GDMA_RX_WEIGHT_CH3_S))
#define GDMA_RX_WEIGHT_CH3_V  0xF
#define GDMA_RX_WEIGHT_CH3_S  8

#define GDMA_IN_PRI_CH3_REG          (DR_REG_GDMA_BASE + 0x284)
/* GDMA_RX_PRI_CH3 : R/W ;bitpos:[3:0] ;default: 4'b0 ; */
/*description: The priority of Rx channel 3. The larger of the value, the higher of the priorit
y..*/
#define GDMA_RX_PRI_CH3    0x0000000F
#define GDMA_RX_PRI_CH3_M  ((GDMA_RX_PRI_CH3_V)<<(GDMA_RX_PRI_CH3_S))
#define GDMA_RX_PRI_CH3_V  0xF
#define GDMA_RX_PRI_CH3_S  0

#define GDMA_IN_PERI_SEL_CH3_REG          (DR_REG_GDMA_BASE + 0x288)
/* GDMA_PERI_IN_SEL_CH3 : R/W ;bitpos:[5:0] ;default: 6'h3f ; */
/*description: This register is used to select peripheral for Rx channel 3. 0:SPI2. 1: SPI3. 2:
 UHCI0. 3: I2S0. 4: I2S1. 5: LCD_CAM. 6: AES. 7: SHA. 8: ADC_DAC. 9: RMT..*/
#define GDMA_PERI_IN_SEL_CH3    0x0000003F
#define GDMA_PERI_IN_SEL_CH3_M  ((GDMA_PERI_IN_SEL_CH3_V)<<(GDMA_PERI_IN_SEL_CH3_S))
#define GDMA_PERI_IN_SEL_CH3_V  0x3F
#define GDMA_PERI_IN_SEL_CH3_S  0

#define GDMA_OUT_CONF0_CH3_REG          (DR_REG_GDMA_BASE + 0x2A0)
/* GDMA_OUT_DATA_BURST_EN_CH3 : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel 3 transmitting da
ta when accessing internal SRAM. .*/
#define GDMA_OUT_DATA_BURST_EN_CH3    (BIT(5))
#define GDMA_OUT_DATA_BURST_EN_CH3_M  (BIT(5))
#define GDMA_OUT_DATA_BURST_EN_CH3_V  0x1
#define GDMA_OUT_DATA_BURST_EN_CH3_S  5
/* GDMA_OUTDSCR_BURST_EN_CH3 : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel 3 reading link de
scriptor when accessing internal SRAM. .*/
#define GDMA_OUTDSCR_BURST_EN_CH3    (BIT(4))
#define GDMA_OUTDSCR_BURST_EN_CH3_M  (BIT(4))
#define GDMA_OUTDSCR_BURST_EN_CH3_V  0x1
#define GDMA_OUTDSCR_BURST_EN_CH3_S  4
/* GDMA_OUT_EOF_MODE_CH3 : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel 3 is
 generated when data need to transmit has been popped from FIFO in DMA.*/
#define GDMA_OUT_EOF_MODE_CH3    (BIT(3))
#define GDMA_OUT_EOF_MODE_CH3_M  (BIT(3))
#define GDMA_OUT_EOF_MODE_CH3_V  0x1
#define GDMA_OUT_EOF_MODE_CH3_S  3
/* GDMA_OUT_AUTO_WRBACK_CH3 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to enable automatic outlink-writeback when all the data in tx buffe
r has been transmitted..*/
#define GDMA_OUT_AUTO_WRBACK_CH3    (BIT(2))
#define GDMA_OUT_AUTO_WRBACK_CH3_M  (BIT(2))
#define GDMA_OUT_AUTO_WRBACK_CH3_V  0x1
#define GDMA_OUT_AUTO_WRBACK_CH3_S  2
/* GDMA_OUT_LOOP_TEST_CH3 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: reserved.*/
#define GDMA_OUT_LOOP_TEST_CH3    (BIT(1))
#define GDMA_OUT_LOOP_TEST_CH3_M  (BIT(1))
#define GDMA_OUT_LOOP_TEST_CH3_V  0x1
#define GDMA_OUT_LOOP_TEST_CH3_S  1
/* GDMA_OUT_RST_CH3 : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: This bit is used to reset DMA channel 3 Tx FSM and Tx FIFO pointer..*/
#define GDMA_OUT_RST_CH3    (BIT(0))
#define GDMA_OUT_RST_CH3_M  (BIT(0))
#define GDMA_OUT_RST_CH3_V  0x1
#define GDMA_OUT_RST_CH3_S  0

#define GDMA_OUT_CONF1_CH3_REG          (DR_REG_GDMA_BASE + 0x2A4)
/* GDMA_OUT_EXT_MEM_BK_SIZE_CH3 : R/W ;bitpos:[14:13] ;default: 2'b0 ; */
/*description: Block size of Tx channel 3 when DMA access external SRAM. 0: 16 bytes      1: 32
 bytes    2/3:reserved.*/
#define GDMA_OUT_EXT_MEM_BK_SIZE_CH3    0x00000003
#define GDMA_OUT_EXT_MEM_BK_SIZE_CH3_M  ((GDMA_OUT_EXT_MEM_BK_SIZE_CH3_V)<<(GDMA_OUT_EXT_MEM_BK_SIZE_CH3_S))
#define GDMA_OUT_EXT_MEM_BK_SIZE_CH3_V  0x3
#define GDMA_OUT_EXT_MEM_BK_SIZE_CH3_S  13
/* GDMA_OUT_CHECK_OWNER_CH3 : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to enable checking the owner attribute of the link descriptor..*/
#define GDMA_OUT_CHECK_OWNER_CH3    (BIT(12))
#define GDMA_OUT_CHECK_OWNER_CH3_M  (BIT(12))
#define GDMA_OUT_CHECK_OWNER_CH3_V  0x1
#define GDMA_OUT_CHECK_OWNER_CH3_S  12

#define GDMA_OUT_INT_RAW_CH3_REG          (DR_REG_GDMA_BASE + 0x2A8)
/* GDMA_OUTFIFO_UDF_L3_CH3_INT_RAW : R/WTC/SS ;bitpos:[7] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo of Tx channel 3 is
underflow. .*/
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_RAW    (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_RAW_M  (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_RAW_V  0x1
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_RAW_S  7
/* GDMA_OUTFIFO_OVF_L3_CH3_INT_RAW : R/WTC/SS ;bitpos:[6] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo of Tx channel 3 is
overflow. .*/
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_RAW    (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_RAW_M  (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_RAW_V  0x1
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_RAW_S  6
/* GDMA_OUTFIFO_UDF_L1_CH3_INT_RAW : R/WTC/SS ;bitpos:[5] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo of Tx channel 3 is
underflow. .*/
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_RAW    (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_RAW_M  (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_RAW_V  0x1
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_RAW_S  5
/* GDMA_OUTFIFO_OVF_L1_CH3_INT_RAW : R/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo of Tx channel 3 is
overflow. .*/
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_RAW    (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_RAW_M  (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_RAW_V  0x1
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_RAW_S  4
/* GDMA_OUT_TOTAL_EOF_CH3_INT_RAW : R/WTC/SS ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when data corresponding a outlink (inc
ludes one link descriptor or few link descriptors) is transmitted out for Tx cha
nnel 3..*/
#define GDMA_OUT_TOTAL_EOF_CH3_INT_RAW    (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH3_INT_RAW_M  (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH3_INT_RAW_V  0x1
#define GDMA_OUT_TOTAL_EOF_CH3_INT_RAW_S  3
/* GDMA_OUT_DSCR_ERR_CH3_INT_RAW : R/WTC/SS ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when detecting outlink descriptor erro
r, including owner error, the second and third word error of outlink descriptor
for Tx channel 3..*/
#define GDMA_OUT_DSCR_ERR_CH3_INT_RAW    (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH3_INT_RAW_M  (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH3_INT_RAW_V  0x1
#define GDMA_OUT_DSCR_ERR_CH3_INT_RAW_S  2
/* GDMA_OUT_EOF_CH3_INT_RAW : R/WTC/SS ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data pointed by one outl
ink descriptor has been read from memory for Tx channel 3. .*/
#define GDMA_OUT_EOF_CH3_INT_RAW    (BIT(1))
#define GDMA_OUT_EOF_CH3_INT_RAW_M  (BIT(1))
#define GDMA_OUT_EOF_CH3_INT_RAW_V  0x1
#define GDMA_OUT_EOF_CH3_INT_RAW_S  1
/* GDMA_OUT_DONE_CH3_INT_RAW : R/WTC/SS ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data pointed by one outl
ink descriptor has been transmitted to peripherals for Tx channel 3..*/
#define GDMA_OUT_DONE_CH3_INT_RAW    (BIT(0))
#define GDMA_OUT_DONE_CH3_INT_RAW_M  (BIT(0))
#define GDMA_OUT_DONE_CH3_INT_RAW_V  0x1
#define GDMA_OUT_DONE_CH3_INT_RAW_S  0

