espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
#define GDMA_OUT_INT_ST_CH3_REG          (DR_REG_GDMA_BASE + 0x2AC)
/* GDMA_OUTFIFO_UDF_L3_CH3_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_ST    (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_ST_M  (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_ST_V  0x1
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_ST_S  7
/* GDMA_OUTFIFO_OVF_L3_CH3_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_ST    (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_ST_M  (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_ST_V  0x1
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_ST_S  6
/* GDMA_OUTFIFO_UDF_L1_CH3_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_ST    (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_ST_M  (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_ST_V  0x1
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_ST_S  5
/* GDMA_OUTFIFO_OVF_L1_CH3_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_ST    (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_ST_M  (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_ST_V  0x1
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_ST_S  4
/* GDMA_OUT_TOTAL_EOF_CH3_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt..*/
#define GDMA_OUT_TOTAL_EOF_CH3_INT_ST    (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH3_INT_ST_M  (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH3_INT_ST_V  0x1
#define GDMA_OUT_TOTAL_EOF_CH3_INT_ST_S  3
/* GDMA_OUT_DSCR_ERR_CH3_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_OUT_DSCR_ERR_CH3_INT_ST    (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH3_INT_ST_M  (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH3_INT_ST_V  0x1
#define GDMA_OUT_DSCR_ERR_CH3_INT_ST_S  2
/* GDMA_OUT_EOF_CH3_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_EOF_CH_INT interrupt..*/
#define GDMA_OUT_EOF_CH3_INT_ST    (BIT(1))
#define GDMA_OUT_EOF_CH3_INT_ST_M  (BIT(1))
#define GDMA_OUT_EOF_CH3_INT_ST_V  0x1
#define GDMA_OUT_EOF_CH3_INT_ST_S  1
/* GDMA_OUT_DONE_CH3_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DONE_CH_INT interrupt..*/
#define GDMA_OUT_DONE_CH3_INT_ST    (BIT(0))
#define GDMA_OUT_DONE_CH3_INT_ST_M  (BIT(0))
#define GDMA_OUT_DONE_CH3_INT_ST_V  0x1
#define GDMA_OUT_DONE_CH3_INT_ST_S  0

#define GDMA_OUT_INT_ENA_CH3_REG          (DR_REG_GDMA_BASE + 0x2B0)
/* GDMA_OUTFIFO_UDF_L3_CH3_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_ENA    (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_ENA_M  (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_ENA_V  0x1
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_ENA_S  7
/* GDMA_OUTFIFO_OVF_L3_CH3_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_ENA    (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_ENA_M  (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_ENA_V  0x1
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_ENA_S  6
/* GDMA_OUTFIFO_UDF_L1_CH3_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_ENA    (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_ENA_M  (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_ENA_V  0x1
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_ENA_S  5
/* GDMA_OUTFIFO_OVF_L1_CH3_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_ENA    (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_ENA_M  (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_ENA_V  0x1
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_ENA_S  4
/* GDMA_OUT_TOTAL_EOF_CH3_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt..*/
#define GDMA_OUT_TOTAL_EOF_CH3_INT_ENA    (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH3_INT_ENA_M  (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH3_INT_ENA_V  0x1
#define GDMA_OUT_TOTAL_EOF_CH3_INT_ENA_S  3
/* GDMA_OUT_DSCR_ERR_CH3_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_OUT_DSCR_ERR_CH3_INT_ENA    (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH3_INT_ENA_M  (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH3_INT_ENA_V  0x1
#define GDMA_OUT_DSCR_ERR_CH3_INT_ENA_S  2
/* GDMA_OUT_EOF_CH3_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_EOF_CH_INT interrupt..*/
#define GDMA_OUT_EOF_CH3_INT_ENA    (BIT(1))
#define GDMA_OUT_EOF_CH3_INT_ENA_M  (BIT(1))
#define GDMA_OUT_EOF_CH3_INT_ENA_V  0x1
#define GDMA_OUT_EOF_CH3_INT_ENA_S  1
/* GDMA_OUT_DONE_CH3_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_DONE_CH_INT interrupt..*/
#define GDMA_OUT_DONE_CH3_INT_ENA    (BIT(0))
#define GDMA_OUT_DONE_CH3_INT_ENA_M  (BIT(0))
#define GDMA_OUT_DONE_CH3_INT_ENA_V  0x1
#define GDMA_OUT_DONE_CH3_INT_ENA_S  0

#define GDMA_OUT_INT_CLR_CH3_REG          (DR_REG_GDMA_BASE + 0x2B4)
/* GDMA_OUTFIFO_UDF_L3_CH3_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_CLR    (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_CLR_M  (BIT(7))
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_CLR_V  0x1
#define GDMA_OUTFIFO_UDF_L3_CH3_INT_CLR_S  7
/* GDMA_OUTFIFO_OVF_L3_CH3_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_CLR    (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_CLR_M  (BIT(6))
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_CLR_V  0x1
#define GDMA_OUTFIFO_OVF_L3_CH3_INT_CLR_S  6
/* GDMA_OUTFIFO_UDF_L1_CH3_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_CLR    (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_CLR_M  (BIT(5))
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_CLR_V  0x1
#define GDMA_OUTFIFO_UDF_L1_CH3_INT_CLR_S  5
/* GDMA_OUTFIFO_OVF_L1_CH3_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_CLR    (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_CLR_M  (BIT(4))
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_CLR_V  0x1
#define GDMA_OUTFIFO_OVF_L1_CH3_INT_CLR_S  4
/* GDMA_OUT_TOTAL_EOF_CH3_INT_CLR : WT ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt..*/
#define GDMA_OUT_TOTAL_EOF_CH3_INT_CLR    (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH3_INT_CLR_M  (BIT(3))
#define GDMA_OUT_TOTAL_EOF_CH3_INT_CLR_V  0x1
#define GDMA_OUT_TOTAL_EOF_CH3_INT_CLR_S  3
/* GDMA_OUT_DSCR_ERR_CH3_INT_CLR : WT ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_OUT_DSCR_ERR_CH3_INT_CLR    (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH3_INT_CLR_M  (BIT(2))
#define GDMA_OUT_DSCR_ERR_CH3_INT_CLR_V  0x1
#define GDMA_OUT_DSCR_ERR_CH3_INT_CLR_S  2
/* GDMA_OUT_EOF_CH3_INT_CLR : WT ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_EOF_CH_INT interrupt..*/
#define GDMA_OUT_EOF_CH3_INT_CLR    (BIT(1))
#define GDMA_OUT_EOF_CH3_INT_CLR_M  (BIT(1))
#define GDMA_OUT_EOF_CH3_INT_CLR_V  0x1
#define GDMA_OUT_EOF_CH3_INT_CLR_S  1
/* GDMA_OUT_DONE_CH3_INT_CLR : WT ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DONE_CH_INT interrupt..*/
#define GDMA_OUT_DONE_CH3_INT_CLR    (BIT(0))
#define GDMA_OUT_DONE_CH3_INT_CLR_M  (BIT(0))
#define GDMA_OUT_DONE_CH3_INT_CLR_V  0x1
#define GDMA_OUT_DONE_CH3_INT_CLR_S  0

