espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
#define GDMA_OUT_STATE_CH3_REG          (DR_REG_GDMA_BASE + 0x2C4)
/* GDMA_OUT_STATE_CH3 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved.*/
#define GDMA_OUT_STATE_CH3    0x00000007
#define GDMA_OUT_STATE_CH3_M  ((GDMA_OUT_STATE_CH3_V)<<(GDMA_OUT_STATE_CH3_S))
#define GDMA_OUT_STATE_CH3_V  0x7
#define GDMA_OUT_STATE_CH3_S  20
/* GDMA_OUT_DSCR_STATE_CH3 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved.*/
#define GDMA_OUT_DSCR_STATE_CH3    0x00000003
#define GDMA_OUT_DSCR_STATE_CH3_M  ((GDMA_OUT_DSCR_STATE_CH3_V)<<(GDMA_OUT_DSCR_STATE_CH3_S))
#define GDMA_OUT_DSCR_STATE_CH3_V  0x3
#define GDMA_OUT_DSCR_STATE_CH3_S  18
/* GDMA_OUTLINK_DSCR_ADDR_CH3 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current outlink descriptor's address..*/
#define GDMA_OUTLINK_DSCR_ADDR_CH3    0x0003FFFF
#define GDMA_OUTLINK_DSCR_ADDR_CH3_M  ((GDMA_OUTLINK_DSCR_ADDR_CH3_V)<<(GDMA_OUTLINK_DSCR_ADDR_CH3_S))
#define GDMA_OUTLINK_DSCR_ADDR_CH3_V  0x3FFFF
#define GDMA_OUTLINK_DSCR_ADDR_CH3_S  0

#define GDMA_OUT_EOF_DES_ADDR_CH3_REG          (DR_REG_GDMA_BASE + 0x2C8)
/* GDMA_OUT_EOF_DES_ADDR_CH3 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor when the EOF bit in t
his descriptor is 1..*/
#define GDMA_OUT_EOF_DES_ADDR_CH3    0xFFFFFFFF
#define GDMA_OUT_EOF_DES_ADDR_CH3_M  ((GDMA_OUT_EOF_DES_ADDR_CH3_V)<<(GDMA_OUT_EOF_DES_ADDR_CH3_S))
#define GDMA_OUT_EOF_DES_ADDR_CH3_V  0xFFFFFFFF
#define GDMA_OUT_EOF_DES_ADDR_CH3_S  0

#define GDMA_OUT_EOF_BFR_DES_ADDR_CH3_REG          (DR_REG_GDMA_BASE + 0x2CC)
/* GDMA_OUT_EOF_BFR_DES_ADDR_CH3 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor before the last outli
nk descriptor..*/
#define GDMA_OUT_EOF_BFR_DES_ADDR_CH3    0xFFFFFFFF
#define GDMA_OUT_EOF_BFR_DES_ADDR_CH3_M  ((GDMA_OUT_EOF_BFR_DES_ADDR_CH3_V)<<(GDMA_OUT_EOF_BFR_DES_ADDR_CH3_S))
#define GDMA_OUT_EOF_BFR_DES_ADDR_CH3_V  0xFFFFFFFF
#define GDMA_OUT_EOF_BFR_DES_ADDR_CH3_S  0

#define GDMA_OUT_DSCR_CH3_REG          (DR_REG_GDMA_BASE + 0x2D0)
/* GDMA_OUTLINK_DSCR_CH3 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current outlink descriptor y..*/
#define GDMA_OUTLINK_DSCR_CH3    0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_CH3_M  ((GDMA_OUTLINK_DSCR_CH3_V)<<(GDMA_OUTLINK_DSCR_CH3_S))
#define GDMA_OUTLINK_DSCR_CH3_V  0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_CH3_S  0

#define GDMA_OUT_DSCR_BF0_CH3_REG          (DR_REG_GDMA_BASE + 0x2D4)
/* GDMA_OUTLINK_DSCR_BF0_CH3 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last outlink descriptor y-1..*/
#define GDMA_OUTLINK_DSCR_BF0_CH3    0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_BF0_CH3_M  ((GDMA_OUTLINK_DSCR_BF0_CH3_V)<<(GDMA_OUTLINK_DSCR_BF0_CH3_S))
#define GDMA_OUTLINK_DSCR_BF0_CH3_V  0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_BF0_CH3_S  0

#define GDMA_OUT_DSCR_BF1_CH3_REG          (DR_REG_GDMA_BASE + 0x2D8)
/* GDMA_OUTLINK_DSCR_BF1_CH3 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2..*/
#define GDMA_OUTLINK_DSCR_BF1_CH3    0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_BF1_CH3_M  ((GDMA_OUTLINK_DSCR_BF1_CH3_V)<<(GDMA_OUTLINK_DSCR_BF1_CH3_S))
#define GDMA_OUTLINK_DSCR_BF1_CH3_V  0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_BF1_CH3_S  0

#define GDMA_OUT_WIGHT_CH3_REG          (DR_REG_GDMA_BASE + 0x2DC)
/* GDMA_TX_WEIGHT_CH3 : R/W ;bitpos:[11:8] ;default: 4'hf ; */
/*description: The weight of Tx channel 3. .*/
#define GDMA_TX_WEIGHT_CH3    0x0000000F
#define GDMA_TX_WEIGHT_CH3_M  ((GDMA_TX_WEIGHT_CH3_V)<<(GDMA_TX_WEIGHT_CH3_S))
#define GDMA_TX_WEIGHT_CH3_V  0xF
#define GDMA_TX_WEIGHT_CH3_S  8

#define GDMA_OUT_PRI_CH3_REG          (DR_REG_GDMA_BASE + 0x2E4)
/* GDMA_TX_PRI_CH3 : R/W ;bitpos:[3:0] ;default: 4'b0 ; */
/*description: The priority of Tx channel 3. The larger of the value, the higher of the priorit
y..*/
#define GDMA_TX_PRI_CH3    0x0000000F
#define GDMA_TX_PRI_CH3_M  ((GDMA_TX_PRI_CH3_V)<<(GDMA_TX_PRI_CH3_S))
#define GDMA_TX_PRI_CH3_V  0xF
#define GDMA_TX_PRI_CH3_S  0

#define GDMA_OUT_PERI_SEL_CH3_REG          (DR_REG_GDMA_BASE + 0x2E8)
/* GDMA_PERI_OUT_SEL_CH3 : R/W ;bitpos:[5:0] ;default: 6'h3f ; */
/*description: This register is used to select peripheral for Tx channel 3. 0:SPI2. 1: SPI3. 2:
 UHCI0. 3: I2S0. 4: I2S1. 5: LCD_CAM. 6: AES. 7: SHA. 8: ADC_DAC. 9: RMT.; 7: AE
S. 8: SHA. 9: ADC_DAC..*/
#define GDMA_PERI_OUT_SEL_CH3    0x0000003F
#define GDMA_PERI_OUT_SEL_CH3_M  ((GDMA_PERI_OUT_SEL_CH3_V)<<(GDMA_PERI_OUT_SEL_CH3_S))
#define GDMA_PERI_OUT_SEL_CH3_V  0x3F
#define GDMA_PERI_OUT_SEL_CH3_S  0

#define GDMA_IN_CONF0_CH4_REG          (DR_REG_GDMA_BASE + 0x300)
/* GDMA_MEM_TRANS_EN_CH4 : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit 1 to enable automatic transmitting data from memory to memory via D
MA..*/
#define GDMA_MEM_TRANS_EN_CH4    (BIT(4))
#define GDMA_MEM_TRANS_EN_CH4_M  (BIT(4))
#define GDMA_MEM_TRANS_EN_CH4_V  0x1
#define GDMA_MEM_TRANS_EN_CH4_S  4
/* GDMA_IN_DATA_BURST_EN_CH4 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel 2 receiving data
when accessing internal SRAM. .*/
#define GDMA_IN_DATA_BURST_EN_CH4    (BIT(3))
#define GDMA_IN_DATA_BURST_EN_CH4_M  (BIT(3))
#define GDMA_IN_DATA_BURST_EN_CH4_V  0x1
#define GDMA_IN_DATA_BURST_EN_CH4_S  3
/* GDMA_INDSCR_BURST_EN_CH4 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel 2 reading link de
scriptor when accessing internal SRAM. .*/
#define GDMA_INDSCR_BURST_EN_CH4    (BIT(2))
#define GDMA_INDSCR_BURST_EN_CH4_M  (BIT(2))
#define GDMA_INDSCR_BURST_EN_CH4_V  0x1
#define GDMA_INDSCR_BURST_EN_CH4_S  2
/* GDMA_IN_LOOP_TEST_CH4 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: reserved.*/
#define GDMA_IN_LOOP_TEST_CH4    (BIT(1))
#define GDMA_IN_LOOP_TEST_CH4_M  (BIT(1))
#define GDMA_IN_LOOP_TEST_CH4_V  0x1
#define GDMA_IN_LOOP_TEST_CH4_S  1
/* GDMA_IN_RST_CH4 : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: This bit is used to reset DMA channel 4 Rx FSM and Rx FIFO pointer..*/
#define GDMA_IN_RST_CH4    (BIT(0))
#define GDMA_IN_RST_CH4_M  (BIT(0))
#define GDMA_IN_RST_CH4_V  0x1
#define GDMA_IN_RST_CH4_S  0

#define GDMA_IN_CONF1_CH4_REG          (DR_REG_GDMA_BASE + 0x304)
/* GDMA_IN_EXT_MEM_BK_SIZE_CH4 : R/W ;bitpos:[14:13] ;default: 2'b0 ; */
/*description: Block size of Rx channel 4 when DMA access external SRAM. 0: 16 bytes      1: 32
 bytes    2/3:reserved.*/
#define GDMA_IN_EXT_MEM_BK_SIZE_CH4    0x00000003
#define GDMA_IN_EXT_MEM_BK_SIZE_CH4_M  ((GDMA_IN_EXT_MEM_BK_SIZE_CH4_V)<<(GDMA_IN_EXT_MEM_BK_SIZE_CH4_S))
#define GDMA_IN_EXT_MEM_BK_SIZE_CH4_V  0x3
#define GDMA_IN_EXT_MEM_BK_SIZE_CH4_S  13
/* GDMA_IN_CHECK_OWNER_CH4 : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to enable checking the owner attribute of the link descriptor..*/
#define GDMA_IN_CHECK_OWNER_CH4    (BIT(12))
#define GDMA_IN_CHECK_OWNER_CH4_M  (BIT(12))
#define GDMA_IN_CHECK_OWNER_CH4_V  0x1
#define GDMA_IN_CHECK_OWNER_CH4_S  12
/* GDMA_DMA_INFIFO_FULL_THRS_CH4 : R/W ;bitpos:[11:0] ;default: 12'hc ; */
/*description: This register is used to generate the INFIFO_FULL_WM_INT interrupt when Rx chann
el 4 received byte number in Rx FIFO is up to the value of the register..*/
#define GDMA_DMA_INFIFO_FULL_THRS_CH4    0x00000FFF
#define GDMA_DMA_INFIFO_FULL_THRS_CH4_M  ((GDMA_DMA_INFIFO_FULL_THRS_CH4_V)<<(GDMA_DMA_INFIFO_FULL_THRS_CH4_S))
#define GDMA_DMA_INFIFO_FULL_THRS_CH4_V  0xFFF
#define GDMA_DMA_INFIFO_FULL_THRS_CH4_S  0

