espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
#define GDMA_IN_INT_RAW_CH4_REG          (DR_REG_GDMA_BASE + 0x308)
/* GDMA_INFIFO_UDF_L3_CH4_INT_RAW : R/WTC/SS ;bitpos:[9] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo of Rx channel 4 is
underflow. .*/
#define GDMA_INFIFO_UDF_L3_CH4_INT_RAW    (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH4_INT_RAW_M  (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH4_INT_RAW_V  0x1
#define GDMA_INFIFO_UDF_L3_CH4_INT_RAW_S  9
/* GDMA_INFIFO_OVF_L3_CH4_INT_RAW : R/WTC/SS ;bitpos:[8] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo of Rx channel 4 is
overflow. .*/
#define GDMA_INFIFO_OVF_L3_CH4_INT_RAW    (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH4_INT_RAW_M  (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH4_INT_RAW_V  0x1
#define GDMA_INFIFO_OVF_L3_CH4_INT_RAW_S  8
/* GDMA_INFIFO_UDF_L1_CH4_INT_RAW : R/WTC/SS ;bitpos:[7] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo of Rx channel 4 is
underflow. .*/
#define GDMA_INFIFO_UDF_L1_CH4_INT_RAW    (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH4_INT_RAW_M  (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH4_INT_RAW_V  0x1
#define GDMA_INFIFO_UDF_L1_CH4_INT_RAW_S  7
/* GDMA_INFIFO_OVF_L1_CH4_INT_RAW : R/WTC/SS ;bitpos:[6] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo of Rx channel 4 is
overflow. .*/
#define GDMA_INFIFO_OVF_L1_CH4_INT_RAW    (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH4_INT_RAW_M  (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH4_INT_RAW_V  0x1
#define GDMA_INFIFO_OVF_L1_CH4_INT_RAW_S  6
/* GDMA_INFIFO_FULL_WM_CH4_INT_RAW : R/WTC/SS ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when received data byte number is up t
o threshold configured by REG_DMA_INFIFO_FULL_THRS_CH0 in Rx FIFO of channel 4..*/
#define GDMA_INFIFO_FULL_WM_CH4_INT_RAW    (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH4_INT_RAW_M  (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH4_INT_RAW_V  0x1
#define GDMA_INFIFO_FULL_WM_CH4_INT_RAW_S  5
/* GDMA_IN_DSCR_EMPTY_CH4_INT_RAW : R/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when Rx buffer pointed by inlink is fu
ll and receiving data is not completed, but there is no more inlink for Rx chann
el 4..*/
#define GDMA_IN_DSCR_EMPTY_CH4_INT_RAW    (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH4_INT_RAW_M  (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH4_INT_RAW_V  0x1
#define GDMA_IN_DSCR_EMPTY_CH4_INT_RAW_S  4
/* GDMA_IN_DSCR_ERR_CH4_INT_RAW : R/WTC/SS ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when detecting inlink descriptor error
, including owner error, the second and third word error of inlink descriptor fo
r Rx channel 4..*/
#define GDMA_IN_DSCR_ERR_CH4_INT_RAW    (BIT(3))
#define GDMA_IN_DSCR_ERR_CH4_INT_RAW_M  (BIT(3))
#define GDMA_IN_DSCR_ERR_CH4_INT_RAW_V  0x1
#define GDMA_IN_DSCR_ERR_CH4_INT_RAW_S  3
/* GDMA_IN_ERR_EOF_CH4_INT_RAW : R/WTC/SS ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when data error is detected only in th
e case that the peripheral is UHCI0 for Rx channel 4. For other peripherals, thi
s raw interrupt is reserved..*/
#define GDMA_IN_ERR_EOF_CH4_INT_RAW    (BIT(2))
#define GDMA_IN_ERR_EOF_CH4_INT_RAW_M  (BIT(2))
#define GDMA_IN_ERR_EOF_CH4_INT_RAW_V  0x1
#define GDMA_IN_ERR_EOF_CH4_INT_RAW_S  2
/* GDMA_IN_SUC_EOF_CH4_INT_RAW : R/WTC/SS ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data pointed by one inli
nk descriptor has been received for Rx channel 4. For UHCI0, the raw interrupt b
it turns to high level when the last data pointed by one inlink descriptor has b
een received and no data error is detected for Rx channel 0..*/
#define GDMA_IN_SUC_EOF_CH4_INT_RAW    (BIT(1))
#define GDMA_IN_SUC_EOF_CH4_INT_RAW_M  (BIT(1))
#define GDMA_IN_SUC_EOF_CH4_INT_RAW_V  0x1
#define GDMA_IN_SUC_EOF_CH4_INT_RAW_S  1
/* GDMA_IN_DONE_CH4_INT_RAW : R/WTC/SS ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data pointed by one inli
nk descriptor has been received for Rx channel 4..*/
#define GDMA_IN_DONE_CH4_INT_RAW    (BIT(0))
#define GDMA_IN_DONE_CH4_INT_RAW_M  (BIT(0))
#define GDMA_IN_DONE_CH4_INT_RAW_V  0x1
#define GDMA_IN_DONE_CH4_INT_RAW_S  0

#define GDMA_IN_INT_ST_CH4_REG          (DR_REG_GDMA_BASE + 0x30C)
/* GDMA_INFIFO_UDF_L3_CH4_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L3_CH4_INT_ST    (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH4_INT_ST_M  (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH4_INT_ST_V  0x1
#define GDMA_INFIFO_UDF_L3_CH4_INT_ST_S  9
/* GDMA_INFIFO_OVF_L3_CH4_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L3_CH4_INT_ST    (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH4_INT_ST_M  (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH4_INT_ST_V  0x1
#define GDMA_INFIFO_OVF_L3_CH4_INT_ST_S  8
/* GDMA_INFIFO_UDF_L1_CH4_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L1_CH4_INT_ST    (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH4_INT_ST_M  (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH4_INT_ST_V  0x1
#define GDMA_INFIFO_UDF_L1_CH4_INT_ST_S  7
/* GDMA_INFIFO_OVF_L1_CH4_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L1_CH4_INT_ST    (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH4_INT_ST_M  (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH4_INT_ST_V  0x1
#define GDMA_INFIFO_OVF_L1_CH4_INT_ST_S  6
/* GDMA_INFIFO_FULL_WM_CH4_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_FULL_WM_CH_INT interrupt..*/
#define GDMA_INFIFO_FULL_WM_CH4_INT_ST    (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH4_INT_ST_M  (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH4_INT_ST_V  0x1
#define GDMA_INFIFO_FULL_WM_CH4_INT_ST_S  5
/* GDMA_IN_DSCR_EMPTY_CH4_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt..*/
#define GDMA_IN_DSCR_EMPTY_CH4_INT_ST    (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH4_INT_ST_M  (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH4_INT_ST_V  0x1
#define GDMA_IN_DSCR_EMPTY_CH4_INT_ST_S  4
/* GDMA_IN_DSCR_ERR_CH4_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_IN_DSCR_ERR_CH4_INT_ST    (BIT(3))
#define GDMA_IN_DSCR_ERR_CH4_INT_ST_M  (BIT(3))
#define GDMA_IN_DSCR_ERR_CH4_INT_ST_V  0x1
#define GDMA_IN_DSCR_ERR_CH4_INT_ST_S  3
/* GDMA_IN_ERR_EOF_CH4_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt..*/
#define GDMA_IN_ERR_EOF_CH4_INT_ST    (BIT(2))
#define GDMA_IN_ERR_EOF_CH4_INT_ST_M  (BIT(2))
#define GDMA_IN_ERR_EOF_CH4_INT_ST_V  0x1
#define GDMA_IN_ERR_EOF_CH4_INT_ST_S  2
/* GDMA_IN_SUC_EOF_CH4_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt..*/
#define GDMA_IN_SUC_EOF_CH4_INT_ST    (BIT(1))
#define GDMA_IN_SUC_EOF_CH4_INT_ST_M  (BIT(1))
#define GDMA_IN_SUC_EOF_CH4_INT_ST_V  0x1
#define GDMA_IN_SUC_EOF_CH4_INT_ST_S  1
/* GDMA_IN_DONE_CH4_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DONE_CH_INT interrupt..*/
#define GDMA_IN_DONE_CH4_INT_ST    (BIT(0))
#define GDMA_IN_DONE_CH4_INT_ST_M  (BIT(0))
#define GDMA_IN_DONE_CH4_INT_ST_V  0x1
#define GDMA_IN_DONE_CH4_INT_ST_S  0

#define GDMA_IN_INT_ENA_CH4_REG          (DR_REG_GDMA_BASE + 0x310)
/* GDMA_INFIFO_UDF_L3_CH4_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L3_CH4_INT_ENA    (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH4_INT_ENA_M  (BIT(9))
#define GDMA_INFIFO_UDF_L3_CH4_INT_ENA_V  0x1
#define GDMA_INFIFO_UDF_L3_CH4_INT_ENA_S  9
/* GDMA_INFIFO_OVF_L3_CH4_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L3_CH4_INT_ENA    (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH4_INT_ENA_M  (BIT(8))
#define GDMA_INFIFO_OVF_L3_CH4_INT_ENA_V  0x1
#define GDMA_INFIFO_OVF_L3_CH4_INT_ENA_S  8
/* GDMA_INFIFO_UDF_L1_CH4_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_UDF_L1_CH4_INT_ENA    (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH4_INT_ENA_M  (BIT(7))
#define GDMA_INFIFO_UDF_L1_CH4_INT_ENA_V  0x1
#define GDMA_INFIFO_UDF_L1_CH4_INT_ENA_S  7
/* GDMA_INFIFO_OVF_L1_CH4_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt..*/
#define GDMA_INFIFO_OVF_L1_CH4_INT_ENA    (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH4_INT_ENA_M  (BIT(6))
#define GDMA_INFIFO_OVF_L1_CH4_INT_ENA_V  0x1
#define GDMA_INFIFO_OVF_L1_CH4_INT_ENA_S  6
/* GDMA_INFIFO_FULL_WM_CH4_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_FULL_WM_CH_INT interrupt..*/
#define GDMA_INFIFO_FULL_WM_CH4_INT_ENA    (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH4_INT_ENA_M  (BIT(5))
#define GDMA_INFIFO_FULL_WM_CH4_INT_ENA_V  0x1
#define GDMA_INFIFO_FULL_WM_CH4_INT_ENA_S  5
/* GDMA_IN_DSCR_EMPTY_CH4_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt..*/
#define GDMA_IN_DSCR_EMPTY_CH4_INT_ENA    (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH4_INT_ENA_M  (BIT(4))
#define GDMA_IN_DSCR_EMPTY_CH4_INT_ENA_V  0x1
#define GDMA_IN_DSCR_EMPTY_CH4_INT_ENA_S  4
/* GDMA_IN_DSCR_ERR_CH4_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt..*/
#define GDMA_IN_DSCR_ERR_CH4_INT_ENA    (BIT(3))
#define GDMA_IN_DSCR_ERR_CH4_INT_ENA_M  (BIT(3))
#define GDMA_IN_DSCR_ERR_CH4_INT_ENA_V  0x1
#define GDMA_IN_DSCR_ERR_CH4_INT_ENA_S  3
/* GDMA_IN_ERR_EOF_CH4_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt..*/
#define GDMA_IN_ERR_EOF_CH4_INT_ENA    (BIT(2))
#define GDMA_IN_ERR_EOF_CH4_INT_ENA_M  (BIT(2))
#define GDMA_IN_ERR_EOF_CH4_INT_ENA_V  0x1
#define GDMA_IN_ERR_EOF_CH4_INT_ENA_S  2
/* GDMA_IN_SUC_EOF_CH4_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt..*/
#define GDMA_IN_SUC_EOF_CH4_INT_ENA    (BIT(1))
#define GDMA_IN_SUC_EOF_CH4_INT_ENA_M  (BIT(1))
#define GDMA_IN_SUC_EOF_CH4_INT_ENA_V  0x1
#define GDMA_IN_SUC_EOF_CH4_INT_ENA_S  1
/* GDMA_IN_DONE_CH4_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_DONE_CH_INT interrupt..*/
#define GDMA_IN_DONE_CH4_INT_ENA    (BIT(0))
#define GDMA_IN_DONE_CH4_INT_ENA_M  (BIT(0))
#define GDMA_IN_DONE_CH4_INT_ENA_V  0x1
#define GDMA_IN_DONE_CH4_INT_ENA_S  0

