espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
#define GDMA_OUT_STATE_CH4_REG          (DR_REG_GDMA_BASE + 0x384)
/* GDMA_OUT_STATE_CH4 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved.*/
#define GDMA_OUT_STATE_CH4    0x00000007
#define GDMA_OUT_STATE_CH4_M  ((GDMA_OUT_STATE_CH4_V)<<(GDMA_OUT_STATE_CH4_S))
#define GDMA_OUT_STATE_CH4_V  0x7
#define GDMA_OUT_STATE_CH4_S  20
/* GDMA_OUT_DSCR_STATE_CH4 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved.*/
#define GDMA_OUT_DSCR_STATE_CH4    0x00000003
#define GDMA_OUT_DSCR_STATE_CH4_M  ((GDMA_OUT_DSCR_STATE_CH4_V)<<(GDMA_OUT_DSCR_STATE_CH4_S))
#define GDMA_OUT_DSCR_STATE_CH4_V  0x3
#define GDMA_OUT_DSCR_STATE_CH4_S  18
/* GDMA_OUTLINK_DSCR_ADDR_CH4 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current outlink descriptor's address..*/
#define GDMA_OUTLINK_DSCR_ADDR_CH4    0x0003FFFF
#define GDMA_OUTLINK_DSCR_ADDR_CH4_M  ((GDMA_OUTLINK_DSCR_ADDR_CH4_V)<<(GDMA_OUTLINK_DSCR_ADDR_CH4_S))
#define GDMA_OUTLINK_DSCR_ADDR_CH4_V  0x3FFFF
#define GDMA_OUTLINK_DSCR_ADDR_CH4_S  0

#define GDMA_OUT_EOF_DES_ADDR_CH4_REG          (DR_REG_GDMA_BASE + 0x388)
/* GDMA_OUT_EOF_DES_ADDR_CH4 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor when the EOF bit in t
his descriptor is 1..*/
#define GDMA_OUT_EOF_DES_ADDR_CH4    0xFFFFFFFF
#define GDMA_OUT_EOF_DES_ADDR_CH4_M  ((GDMA_OUT_EOF_DES_ADDR_CH4_V)<<(GDMA_OUT_EOF_DES_ADDR_CH4_S))
#define GDMA_OUT_EOF_DES_ADDR_CH4_V  0xFFFFFFFF
#define GDMA_OUT_EOF_DES_ADDR_CH4_S  0

#define GDMA_OUT_EOF_BFR_DES_ADDR_CH4_REG          (DR_REG_GDMA_BASE + 0x38C)
/* GDMA_OUT_EOF_BFR_DES_ADDR_CH4 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor before the last outli
nk descriptor..*/
#define GDMA_OUT_EOF_BFR_DES_ADDR_CH4    0xFFFFFFFF
#define GDMA_OUT_EOF_BFR_DES_ADDR_CH4_M  ((GDMA_OUT_EOF_BFR_DES_ADDR_CH4_V)<<(GDMA_OUT_EOF_BFR_DES_ADDR_CH4_S))
#define GDMA_OUT_EOF_BFR_DES_ADDR_CH4_V  0xFFFFFFFF
#define GDMA_OUT_EOF_BFR_DES_ADDR_CH4_S  0

#define GDMA_OUT_DSCR_CH4_REG          (DR_REG_GDMA_BASE + 0x390)
/* GDMA_OUTLINK_DSCR_CH4 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current outlink descriptor y..*/
#define GDMA_OUTLINK_DSCR_CH4    0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_CH4_M  ((GDMA_OUTLINK_DSCR_CH4_V)<<(GDMA_OUTLINK_DSCR_CH4_S))
#define GDMA_OUTLINK_DSCR_CH4_V  0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_CH4_S  0

#define GDMA_OUT_DSCR_BF0_CH4_REG          (DR_REG_GDMA_BASE + 0x394)
/* GDMA_OUTLINK_DSCR_BF0_CH4 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last outlink descriptor y-1..*/
#define GDMA_OUTLINK_DSCR_BF0_CH4    0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_BF0_CH4_M  ((GDMA_OUTLINK_DSCR_BF0_CH4_V)<<(GDMA_OUTLINK_DSCR_BF0_CH4_S))
#define GDMA_OUTLINK_DSCR_BF0_CH4_V  0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_BF0_CH4_S  0

#define GDMA_OUT_DSCR_BF1_CH4_REG          (DR_REG_GDMA_BASE + 0x398)
/* GDMA_OUTLINK_DSCR_BF1_CH4 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2..*/
#define GDMA_OUTLINK_DSCR_BF1_CH4    0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_BF1_CH4_M  ((GDMA_OUTLINK_DSCR_BF1_CH4_V)<<(GDMA_OUTLINK_DSCR_BF1_CH4_S))
#define GDMA_OUTLINK_DSCR_BF1_CH4_V  0xFFFFFFFF
#define GDMA_OUTLINK_DSCR_BF1_CH4_S  0

#define GDMA_OUT_WIGHT_CH4_REG          (DR_REG_GDMA_BASE + 0x39C)
/* GDMA_TX_WEIGHT_CH4 : R/W ;bitpos:[11:8] ;default: 4'hf ; */
/*description: The weight of Tx channel 4. .*/
#define GDMA_TX_WEIGHT_CH4    0x0000000F
#define GDMA_TX_WEIGHT_CH4_M  ((GDMA_TX_WEIGHT_CH4_V)<<(GDMA_TX_WEIGHT_CH4_S))
#define GDMA_TX_WEIGHT_CH4_V  0xF
#define GDMA_TX_WEIGHT_CH4_S  8

#define GDMA_OUT_PRI_CH4_REG          (DR_REG_GDMA_BASE + 0x3A4)
/* GDMA_TX_PRI_CH4 : R/W ;bitpos:[3:0] ;default: 4'b0 ; */
/*description: The priority of Tx channel 4. The larger of the value, the higher of the priorit
y..*/
#define GDMA_TX_PRI_CH4    0x0000000F
#define GDMA_TX_PRI_CH4_M  ((GDMA_TX_PRI_CH4_V)<<(GDMA_TX_PRI_CH4_S))
#define GDMA_TX_PRI_CH4_V  0xF
#define GDMA_TX_PRI_CH4_S  0

#define GDMA_OUT_PERI_SEL_CH4_REG          (DR_REG_GDMA_BASE + 0x3A8)
/* GDMA_PERI_OUT_SEL_CH4 : R/W ;bitpos:[5:0] ;default: 6'h3f ; */
/*description: This register is used to select peripheral for Tx channel 4. 0:SPI2. 1: SPI3. 2:
 UHCI0. 3: I2S0. 4: I2S1. 5: LCD_CAM. 6: AES. 7: SHA. 8: ADC_DAC. 9: RMT.; 7: AE
S. 8: SHA. 9: ADC_DAC..*/
#define GDMA_PERI_OUT_SEL_CH4    0x0000003F
#define GDMA_PERI_OUT_SEL_CH4_M  ((GDMA_PERI_OUT_SEL_CH4_V)<<(GDMA_PERI_OUT_SEL_CH4_S))
#define GDMA_PERI_OUT_SEL_CH4_V  0x3F
#define GDMA_PERI_OUT_SEL_CH4_S  0

#define GDMA_AHB_TEST_REG          (DR_REG_GDMA_BASE + 0x3C0)
/* GDMA_AHB_TESTADDR : R/W ;bitpos:[5:4] ;default: 2'b0 ; */
/*description: reserved.*/
#define GDMA_AHB_TESTADDR    0x00000003
#define GDMA_AHB_TESTADDR_M  ((GDMA_AHB_TESTADDR_V)<<(GDMA_AHB_TESTADDR_S))
#define GDMA_AHB_TESTADDR_V  0x3
#define GDMA_AHB_TESTADDR_S  4
/* GDMA_AHB_TESTMODE : R/W ;bitpos:[2:0] ;default: 3'b0 ; */
/*description: reserved.*/
#define GDMA_AHB_TESTMODE    0x00000007
#define GDMA_AHB_TESTMODE_M  ((GDMA_AHB_TESTMODE_V)<<(GDMA_AHB_TESTMODE_S))
#define GDMA_AHB_TESTMODE_V  0x7
#define GDMA_AHB_TESTMODE_S  0

#define GDMA_PD_CONF_REG          (DR_REG_GDMA_BASE + 0x3C4)
/* GDMA_DMA_RAM_CLK_FO : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: 1: Force to open the clock and bypass the gate-clock when accessing the RAM in D
MA. 0: A gate-clock will be used when accessing the RAM in DMA..*/
#define GDMA_DMA_RAM_CLK_FO    (BIT(6))
#define GDMA_DMA_RAM_CLK_FO_M  (BIT(6))
#define GDMA_DMA_RAM_CLK_FO_V  0x1
#define GDMA_DMA_RAM_CLK_FO_S  6
/* GDMA_DMA_RAM_FORCE_PU : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: .*/
#define GDMA_DMA_RAM_FORCE_PU    (BIT(5))
#define GDMA_DMA_RAM_FORCE_PU_M  (BIT(5))
#define GDMA_DMA_RAM_FORCE_PU_V  0x1
#define GDMA_DMA_RAM_FORCE_PU_S  5
/* GDMA_DMA_RAM_FORCE_PD : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: power down.*/
#define GDMA_DMA_RAM_FORCE_PD    (BIT(4))
#define GDMA_DMA_RAM_FORCE_PD_M  (BIT(4))
#define GDMA_DMA_RAM_FORCE_PD_V  0x1
#define GDMA_DMA_RAM_FORCE_PD_S  4

#define GDMA_MISC_CONF_REG          (DR_REG_GDMA_BASE + 0x3C8)
/* GDMA_CLK_EN : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: .*/
#define GDMA_CLK_EN    (BIT(4))
#define GDMA_CLK_EN_M  (BIT(4))
#define GDMA_CLK_EN_V  0x1
#define GDMA_CLK_EN_S  4
/* GDMA_ARB_PRI_DIS : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to disable priority arbitration function..*/
#define GDMA_ARB_PRI_DIS    (BIT(2))
#define GDMA_ARB_PRI_DIS_M  (BIT(2))
#define GDMA_ARB_PRI_DIS_V  0x1
#define GDMA_ARB_PRI_DIS_S  2
/* GDMA_AHBM_RST_EXTER : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit, then clear this bit to reset the external ahb FSM..*/
#define GDMA_AHBM_RST_EXTER    (BIT(1))
#define GDMA_AHBM_RST_EXTER_M  (BIT(1))
#define GDMA_AHBM_RST_EXTER_V  0x1
#define GDMA_AHBM_RST_EXTER_S  1
/* GDMA_AHBM_RST_INTER : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit, then clear this bit to reset the internal ahb FSM..*/
#define GDMA_AHBM_RST_INTER    (BIT(0))
#define GDMA_AHBM_RST_INTER_M  (BIT(0))
#define GDMA_AHBM_RST_INTER_V  0x1
#define GDMA_AHBM_RST_INTER_S  0

#define GDMA_IN_SRAM_SIZE_CH0_REG          (DR_REG_GDMA_BASE + 0x3CC)
/* GDMA_IN_SIZE_CH0 : R/W ;bitpos:[6:0] ;default: 7'd14 ; */
/*description: This register is used to configure the size of L2 Tx FIFO for Rx channel 0. 0:16
 bytes. 1:24 bytes. 2:32 bytes. 3: 40 bytes. 4: 48 bytes. 5:56 bytes. 6: 64 byte
s. 7: 72 bytes. 8: 80 bytes..*/
#define GDMA_IN_SIZE_CH0    0x0000007F
#define GDMA_IN_SIZE_CH0_M  ((GDMA_IN_SIZE_CH0_V)<<(GDMA_IN_SIZE_CH0_S))
#define GDMA_IN_SIZE_CH0_V  0x7F
#define GDMA_IN_SIZE_CH0_S  0

#define GDMA_OUT_SRAM_SIZE_CH0_REG          (DR_REG_GDMA_BASE + 0x3D0)
/* GDMA_OUT_SIZE_CH0 : R/W ;bitpos:[6:0] ;default: 7'd14 ; */
/*description: This register is used to configure the size of L2 Tx FIFO for Tx channel 0. 0:16
 bytes. 1:24 bytes. 2:32 bytes. 3: 40 bytes. 4: 48 bytes. 5:56 bytes. 6: 64 byte
s. 7: 72 bytes. 8: 80 bytes..*/
#define GDMA_OUT_SIZE_CH0    0x0000007F
#define GDMA_OUT_SIZE_CH0_M  ((GDMA_OUT_SIZE_CH0_V)<<(GDMA_OUT_SIZE_CH0_S))
#define GDMA_OUT_SIZE_CH0_V  0x7F
#define GDMA_OUT_SIZE_CH0_S  0

#define GDMA_IN_SRAM_SIZE_CH1_REG          (DR_REG_GDMA_BASE + 0x3D4)
/* GDMA_IN_SIZE_CH1 : R/W ;bitpos:[6:0] ;default: 7'd14 ; */
/*description: This register is used to configure the size of L2 Tx FIFO for Rx channel 1. 0:16
 bytes. 1:24 bytes. 2:32 bytes. 3: 40 bytes. 4: 48 bytes. 5:56 bytes. 6: 64 byte
s. 7: 72 bytes. 8: 80 bytes..*/
#define GDMA_IN_SIZE_CH1    0x0000007F
#define GDMA_IN_SIZE_CH1_M  ((GDMA_IN_SIZE_CH1_V)<<(GDMA_IN_SIZE_CH1_S))
#define GDMA_IN_SIZE_CH1_V  0x7F
#define GDMA_IN_SIZE_CH1_S  0

