espressif/esp-idf/components/soc/esp32s3/include/soc/gdma_reg.h
#define GDMA_OUT_SRAM_SIZE_CH1_REG          (DR_REG_GDMA_BASE + 0x3D8)
/* GDMA_OUT_SIZE_CH1 : R/W ;bitpos:[6:0] ;default: 7'd14 ; */
/*description: This register is used to configure the size of L2 Tx FIFO for Tx channel 1. 0:16
 bytes. 1:24 bytes. 2:32 bytes. 3: 40 bytes. 4: 48 bytes. 5:56 bytes. 6: 64 byte
s. 7: 72 bytes. 8: 80 bytes..*/
#define GDMA_OUT_SIZE_CH1    0x0000007F
#define GDMA_OUT_SIZE_CH1_M  ((GDMA_OUT_SIZE_CH1_V)<<(GDMA_OUT_SIZE_CH1_S))
#define GDMA_OUT_SIZE_CH1_V  0x7F
#define GDMA_OUT_SIZE_CH1_S  0

#define GDMA_IN_SRAM_SIZE_CH2_REG          (DR_REG_GDMA_BASE + 0x3DC)
/* GDMA_IN_SIZE_CH2 : R/W ;bitpos:[6:0] ;default: 7'd14 ; */
/*description: This register is used to configure the size of L2 Tx FIFO for Rx channel 2. 0:16
 bytes. 1:24 bytes. 2:32 bytes. 3: 40 bytes. 4: 48 bytes. 5:56 bytes. 6: 64 byte
s. 7: 72 bytes. 8: 80 bytes..*/
#define GDMA_IN_SIZE_CH2    0x0000007F
#define GDMA_IN_SIZE_CH2_M  ((GDMA_IN_SIZE_CH2_V)<<(GDMA_IN_SIZE_CH2_S))
#define GDMA_IN_SIZE_CH2_V  0x7F
#define GDMA_IN_SIZE_CH2_S  0

#define GDMA_OUT_SRAM_SIZE_CH2_REG          (DR_REG_GDMA_BASE + 0x3E0)
/* GDMA_OUT_SIZE_CH2 : R/W ;bitpos:[6:0] ;default: 7'd14 ; */
/*description: This register is used to configure the size of L2 Tx FIFO for Tx channel 2. 0:16
 bytes. 1:24 bytes. 2:32 bytes. 3: 40 bytes. 4: 48 bytes. 5:56 bytes. 6: 64 byte
s. 7: 72 bytes. 8: 80 bytes..*/
#define GDMA_OUT_SIZE_CH2    0x0000007F
#define GDMA_OUT_SIZE_CH2_M  ((GDMA_OUT_SIZE_CH2_V)<<(GDMA_OUT_SIZE_CH2_S))
#define GDMA_OUT_SIZE_CH2_V  0x7F
#define GDMA_OUT_SIZE_CH2_S  0

#define GDMA_IN_SRAM_SIZE_CH3_REG          (DR_REG_GDMA_BASE + 0x3E4)
/* GDMA_IN_SIZE_CH3 : R/W ;bitpos:[6:0] ;default: 7'd14 ; */
/*description: This register is used to configure the size of L2 Tx FIFO for Rx channel 3. 0:16
 bytes. 1:24 bytes. 2:32 bytes. 3: 40 bytes. 4: 48 bytes. 5:56 bytes. 6: 64 byte
s. 7: 72 bytes. 8: 80 bytes..*/
#define GDMA_IN_SIZE_CH3    0x0000007F
#define GDMA_IN_SIZE_CH3_M  ((GDMA_IN_SIZE_CH3_V)<<(GDMA_IN_SIZE_CH3_S))
#define GDMA_IN_SIZE_CH3_V  0x7F
#define GDMA_IN_SIZE_CH3_S  0

#define GDMA_OUT_SRAM_SIZE_CH3_REG          (DR_REG_GDMA_BASE + 0x3E8)
/* GDMA_OUT_SIZE_CH3 : R/W ;bitpos:[6:0] ;default: 7'd14 ; */
/*description: This register is used to configure the size of L2 Tx FIFO for Tx channel 3. 0:16
 bytes. 1:24 bytes. 2:32 bytes. 3: 40 bytes. 4: 48 bytes. 5:56 bytes. 6: 64 byte
s. 7: 72 bytes. 8: 80 bytes..*/
#define GDMA_OUT_SIZE_CH3    0x0000007F
#define GDMA_OUT_SIZE_CH3_M  ((GDMA_OUT_SIZE_CH3_V)<<(GDMA_OUT_SIZE_CH3_S))
#define GDMA_OUT_SIZE_CH3_V  0x7F
#define GDMA_OUT_SIZE_CH3_S  0

#define GDMA_IN_SRAM_SIZE_CH4_REG          (DR_REG_GDMA_BASE + 0x3EC)
/* GDMA_IN_SIZE_CH4 : R/W ;bitpos:[6:0] ;default: 7'd14 ; */
/*description: This register is used to configure the size of L2 Tx FIFO for Rx channel 4. 0:16
 bytes. 1:24 bytes. 2:32 bytes. 3: 40 bytes. 4: 48 bytes. 5:56 bytes. 6: 64 byte
s. 7: 72 bytes. 8: 80 bytes..*/
#define GDMA_IN_SIZE_CH4    0x0000007F
#define GDMA_IN_SIZE_CH4_M  ((GDMA_IN_SIZE_CH4_V)<<(GDMA_IN_SIZE_CH4_S))
#define GDMA_IN_SIZE_CH4_V  0x7F
#define GDMA_IN_SIZE_CH4_S  0

#define GDMA_OUT_SRAM_SIZE_CH4_REG          (DR_REG_GDMA_BASE + 0x3F0)
/* GDMA_OUT_SIZE_CH4 : R/W ;bitpos:[6:0] ;default: 7'd14 ; */
/*description: This register is used to configure the size of L2 Tx FIFO for Tx channel 4. 0:16
 bytes. 1:24 bytes. 2:32 bytes. 3: 40 bytes. 4: 48 bytes. 5:56 bytes. 6: 64 byte
s. 7: 72 bytes. 8: 80 bytes..*/
#define GDMA_OUT_SIZE_CH4    0x0000007F
#define GDMA_OUT_SIZE_CH4_M  ((GDMA_OUT_SIZE_CH4_V)<<(GDMA_OUT_SIZE_CH4_S))
#define GDMA_OUT_SIZE_CH4_V  0x7F
#define GDMA_OUT_SIZE_CH4_S  0

#define GDMA_EXTMEM_REJECT_ADDR_REG          (DR_REG_GDMA_BASE + 0x3F4)
/* GDMA_EXTMEM_REJECT_ADDR : RO ;bitpos:[31:0] ;default: 32'd0 ; */
/*description: This register store the first address rejected by permission control when access
ing external RAM..*/
#define GDMA_EXTMEM_REJECT_ADDR    0xFFFFFFFF
#define GDMA_EXTMEM_REJECT_ADDR_M  ((GDMA_EXTMEM_REJECT_ADDR_V)<<(GDMA_EXTMEM_REJECT_ADDR_S))
#define GDMA_EXTMEM_REJECT_ADDR_V  0xFFFFFFFF
#define GDMA_EXTMEM_REJECT_ADDR_S  0

#define GDMA_EXTMEM_REJECT_ST_REG          (DR_REG_GDMA_BASE + 0x3F8)
/* GDMA_EXTMEM_REJECT_PERI_NUM : RO ;bitpos:[11:6] ;default: 6'b0 ; */
/*description: This register indicate reject accessing from which peripheral..*/
#define GDMA_EXTMEM_REJECT_PERI_NUM    0x0000003F
#define GDMA_EXTMEM_REJECT_PERI_NUM_M  ((GDMA_EXTMEM_REJECT_PERI_NUM_V)<<(GDMA_EXTMEM_REJECT_PERI_NUM_S))
#define GDMA_EXTMEM_REJECT_PERI_NUM_V  0x3F
#define GDMA_EXTMEM_REJECT_PERI_NUM_S  6
/* GDMA_EXTMEM_REJECT_CHANNEL_NUM : RO ;bitpos:[5:2] ;default: 4'b0 ; */
/*description: The register indicate the reject accessing from which channel..*/
#define GDMA_EXTMEM_REJECT_CHANNEL_NUM    0x0000000F
#define GDMA_EXTMEM_REJECT_CHANNEL_NUM_M  ((GDMA_EXTMEM_REJECT_CHANNEL_NUM_V)<<(GDMA_EXTMEM_REJECT_CHANNEL_NUM_S))
#define GDMA_EXTMEM_REJECT_CHANNEL_NUM_V  0xF
#define GDMA_EXTMEM_REJECT_CHANNEL_NUM_S  2
/* GDMA_EXTMEM_REJECT_ATTR : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: The reject accessing. Bit 0: if this bit is 1, the rejected accessing is READ. B
it 1: if this bit is 1, the rejected accessing is WRITE..*/
#define GDMA_EXTMEM_REJECT_ATTR    0x00000003
#define GDMA_EXTMEM_REJECT_ATTR_M  ((GDMA_EXTMEM_REJECT_ATTR_V)<<(GDMA_EXTMEM_REJECT_ATTR_S))
#define GDMA_EXTMEM_REJECT_ATTR_V  0x3
#define GDMA_EXTMEM_REJECT_ATTR_S  0

#define GDMA_EXTMEM_REJECT_INT_RAW_REG          (DR_REG_GDMA_BASE + 0x3FC)
/* GDMA_EXTMEM_REJECT_INT_RAW : R/WTC/SS ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when accessing external RAM is rejecte
d by permission control..*/
#define GDMA_EXTMEM_REJECT_INT_RAW    (BIT(0))
#define GDMA_EXTMEM_REJECT_INT_RAW_M  (BIT(0))
#define GDMA_EXTMEM_REJECT_INT_RAW_V  0x1
#define GDMA_EXTMEM_REJECT_INT_RAW_S  0

#define GDMA_EXTMEM_REJECT_INT_ST_REG          (DR_REG_GDMA_BASE + 0x400)
/* GDMA_EXTMEM_REJECT_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the EXTMEM_REJECT_INT interrupt..*/
#define GDMA_EXTMEM_REJECT_INT_ST    (BIT(0))
#define GDMA_EXTMEM_REJECT_INT_ST_M  (BIT(0))
#define GDMA_EXTMEM_REJECT_INT_ST_V  0x1
#define GDMA_EXTMEM_REJECT_INT_ST_S  0

#define GDMA_EXTMEM_REJECT_INT_ENA_REG          (DR_REG_GDMA_BASE + 0x404)
/* GDMA_EXTMEM_REJECT_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the EXTMEM_REJECT_INT interrupt..*/
#define GDMA_EXTMEM_REJECT_INT_ENA    (BIT(0))
#define GDMA_EXTMEM_REJECT_INT_ENA_M  (BIT(0))
#define GDMA_EXTMEM_REJECT_INT_ENA_V  0x1
#define GDMA_EXTMEM_REJECT_INT_ENA_S  0

#define GDMA_EXTMEM_REJECT_INT_CLR_REG          (DR_REG_GDMA_BASE + 0x408)
/* GDMA_EXTMEM_REJECT_INT_CLR : WT ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to clear the EXTMEM_REJECT_INT interrupt..*/
#define GDMA_EXTMEM_REJECT_INT_CLR    (BIT(0))
#define GDMA_EXTMEM_REJECT_INT_CLR_M  (BIT(0))
#define GDMA_EXTMEM_REJECT_INT_CLR_V  0x1
#define GDMA_EXTMEM_REJECT_INT_CLR_S  0

#define GDMA_DATE_REG          (DR_REG_GDMA_BASE + 0x40C)
/* GDMA_DATE : R/W ;bitpos:[31:0] ;default: 32'h2101180 ; */
/*description: register version..*/
#define GDMA_DATE    0xFFFFFFFF
#define GDMA_DATE_M  ((GDMA_DATE_V)<<(GDMA_DATE_S))
#define GDMA_DATE_V  0xFFFFFFFF
#define GDMA_DATE_S  0


#ifdef __cplusplus
}
#endif



#endif /*_SOC_GDMA_REG_H_ */
